[
  {
    "categories": [
      "ApathyIndex"
    ],
    "descriptions": {
      "TheGoonies": "The classic Mikey quote from The Goonies: \\\"Because it's their time! Their time! Up there. Down here, it's our time \\u2014 it's our time down here!\\\" Martha Plimpton (Stef) even made fun of it in the cast commentary: \\\"We reiterate that!\\\"",
      "general": "To say that a thing is shaped like itself is a tautology, a truthful phrase with no informational content, an unnecessary repetition of words meaning the same thing: \\\"free gratis\\\" or \\\"I can see it with my own eyes\\\" or \\\"It is what it is\\\".\\nSometimes, this is just used as a joke, but it's often also used to describe something as boring. Calling a sofa sofa-colored, for instance, implies that its color is generic and unremarkable.\\nUsually the redundancy has a purpose though. Sometimes it's for intensification (e.g. \\\"kills bugs dead\\\"), for clarification (e.g. \\\"pin\\\" and \\\"PIN\\\" sound identical, so adding \\\"number\\\" makes it clearer), or for calling attention to the property of a thing, even if it's inherent (e.g. \\\"he draws beautifully round circles\\\"). Other times it's just a more concise and glib way of phrasing things (e.g. compare \\\"the state of being of this object is permanent and any attempts to modify its state are futile\\\" with \\\"it is what it is\\\", and \\\"once you overcome your initial reluctance and complete this task, you will enjoy the benefits of its completion\\\" with \\\"if you do it, it will be done\\\"). Furthermore, sometimes the concepts being used are not actually identical (e.g. \\\"Not only am I very intelligent, I'm also very smart!\\\". So, many apparent tautologies are worth thinking deeply about, as they often contain surprising insights.\\nThe name comes from William Shakespeare, who used tautologies a lot. In Antony and Cleopatra during a drunk scene:\\nThis article was brought to you by the Department of Redundancy Department, the Department that brought you this article. Since it is 100 percent true while imparting no new information, this is a subtrope of Mathematician's Answer, which is a supertrope of this. Related to A Dog Named Dog, Recursive Acronym, Captain Obvious, \\\"El Ni\\u00F1o\\\" Is Spanish for \\\"The Ni\\u00F1o\\\", Everyone Calls Him Barkeep, Exactly What It Says on the Tin, and The Trope without a Title, which are some articles to which this one is related. Can often overlap and sound the same as Buffy Speak (see the numerous examples below)."
    },
    "name": "Shaped Like Itself",
    "rdf_element": "ShapedLikeItself/int_22133ffc",
    "short_name": "ShapedLikeItself",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ShapedLikeItself"
  },
  {
    "categories": [
      "DiscordTropes"
    ],
    "descriptions": {
      "TheGoonies": "Stef and Mouth have this sort of relationship in The Goonies. At first they hate each other, but then she hugs him when they find the pirate ship and then pushes him back. Finally at the end they really do make up.",
      "general": "This trope is all but universal in romantic stories. It frequently brings to a close the Will They or Won't They? phase of a Romance Arc.\\nWhen a male and female character spend a lot of time bickering, it is all but inevitable that sooner or later he will interrupt her in mid-rant by suddenly grabbing her and kissing her. (Less frequently, she grabs and kisses him.) The kissed one rarely resists, and usually responds wholeheartedly.\\nUsually this is triggered by their hostilities reaching a climax that results in an exchange of slaps, followed by a moment where both stare at each other in combined confusion and shock, after which they dive into the kiss.\\nEither way, the kiss prompts both to realize that they've been in love all this time \\u2014 the rationale being that they wouldn't argue so much if they didn't give a damn about each other. Normally results in some kind of permanent change in their relationship.\\nThe concept is related to the theory that hate is not necessarily the opposite of love so much as its twisted twin; its opposite would be apathy. Ergo, lots of contained emotion towards a person might be translated into lust given the proper catalyst. Pulled off successfully, it can be... quite satisfying. Otherwise, not so much.\\nThis trope is a major factor in Foe Yay shipping, since such arguments between those characters in the actual shows are often similar to examples of this trope (or even get Why Don't You Marry It? reactions).\\nNote that this trope is mostly Exactly What It Says on the Tin. If there is no kiss, that's Belligerent Sexual Tension.\\nDating back at least to William Shakespeare's Much Ado About Nothing.\\nCompare \\\"Shut Up\\\" Kiss, Love at First Punch, Belligerent Sexual Tension, Take-That Kiss, Vitriolic Best Buds, and Destructo-Nookie. Often considered in similar terms to Foe Yay. Tsunderes are often involved on at least one end. Kiss-Kiss-Slap is this in reverse (kissing, then fighting).\\n\\nExamples"
    },
    "name": "Slap-Slap-Kiss",
    "rdf_element": "SlapSlapKiss/int_22133ffc",
    "short_name": "SlapSlapKiss",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SlapSlapKiss"
  },
  {
    "categories": [
      "ActionAdventureTropes"
    ],
    "descriptions": {
      "TheGoonies": "The older brother in The Goonies had to do this after the kids flattened his bike tires. It apparently ends up getting trashed. Though he did say he owes her one. And the little girl is probably Data's sister.",
      "general": "A character is in a hurry, most likely during a Chase Scene, when he or she sees a bike or some other mode of transportation propped on the side of the road. He or she promptly gets on it and keeps going full-speed. If the owner is present, the character will hastily say something like \\\"I'm just borrowing it!\\\" or \\\"I need your bike! I'll bring it back later!\\\"\\nNote that you usually never see the bike actually get returned, and if it is returned, don't expect the warranty to cover the damage.\\nA Sister Trope to Flashed Badge Hijack. In Real Life, you can get away with this without criminal charges on the plea of \\\"necessity\\\" if you can establish that the harm done by your stealing the vehicle was less than would have occurred if you hadn't.\\nContrast Casual Car Giveaway, in which the hero gives a random soul their vehicle.\\n\\nExamples"
    },
    "name": "Hero Stole My Bike",
    "rdf_element": "HeroStoleMyBike/int_22133ffc",
    "short_name": "HeroStoleMyBike",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/HeroStoleMyBike"
  },
  {
    "categories": [
      "GraphicalTropes"
    ],
    "descriptions": {
      "TheGoonies": "Sloth from The Goonies.",
      "general": "Exactly What It Says on the Tin: A character's ears are used to express his or her emotions.\\nAn animation convention, similar to Cartoony Eyes or Disembodied Eyebrows.\\nUnlike its cousin tropes, Expressive Hair (in most cases) and Expressive Mask, this trope actually leans toward being realistic because this is one way many animals in Real Life communicate their feelings. This obviously doesn't apply to human ears, though, so it's guaranteed all of the characters who use this trope are Not Quite Human. In many animated series, characters that have ears on top of their heads will often sport hats or helmets that allow them to stick through (barring Fridge Logic of not being able to hear otherwise). This trope is probably part of the reason why.\\nCompare Unusual Ears."
    },
    "name": "Expressive Ears",
    "rdf_element": "ExpressiveEars/int_22133ffc",
    "short_name": "ExpressiveEars",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ExpressiveEars"
  },
  {
    "categories": [
      "MusicTropes"
    ],
    "descriptions": {
      "TheGoonies": "In The Goonies, a creepy pirate organ opens a door or collapses the floor.",
      "general": "Using music and musical instruments as security measures. Pianos or similar instruments are common, as you are blatantly dealing with keys. Can often be the way to conceal your secret lair by being Hidden in Plain Sight. The tune itself may be significant/ironic, or the Theme tune or Leitmotif of a character.\\nSubtrope of Solve the Soup Cans. Compare with Musical Trigger. Can be related to Only Smart People May Pass, if actual musical ability is required."
    },
    "name": "Songs in the Key of Lock",
    "rdf_element": "SongsInTheKeyOfLock/int_22133ffc",
    "short_name": "SongsInTheKeyOfLock",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SongsInTheKeyOfLock"
  },
  {
    "categories": [
      "FearTropes"
    ],
    "descriptions": {
      "TheGoonies": "In The Goonies, when Brand removes a rock blocking further passage into the tunnel leading to One-Eyed Willy's hideout, he calls out to see if anybody's there, and a swarm of bats come flying out of the hole, scaring the Goonies.",
      "general": "The mass version of a Cat Scare, a Bat Scare is when characters who are exploring an apparently-deserted location \\u2014 a cave, vacant house, abandoned barn, etc \\u2014 unexpectedly disturb a colony of winged animals. As startled by the characters' presence as vice versa, the whole flock explodes into flight, fluttering en masse from their roosting-place and right at the explorers' faces. Both the characters and the audience get to jump out of their skins, but the animals don't actually hurt anyone, flying away as quickly as they'd emerged.\\nMoreso than a Cat Scare, this trope is often used to emphasize the forsaken and/or unexplored nature of the site itself. While a lone cat won't hesitate to wander around near people, a whole colony of bats (or birds, moths, pterosaurs, whatever) is unlikely to settle for long in a place where humans regularly venture. Sometimes combined with Hand in the Hole for added tension. Versions in which the animals turn out to be fleeing from something much more dangerous are common.\\nVariants with non-winged creatures also occur, but tend to lack the same in-your-face impact of flying ones, so usually rely on animals (rats, spiders) that audiences would find creepy in any case.\\nCompare Disturbed Doves, in which doves take flight to symbolize a dramatic event. Contrast Wallet Moths, which also indicates a vacancy (of money), but isn't played for scares."
    },
    "name": "Bat Scare",
    "rdf_element": "BatScare/int_22133ffc",
    "short_name": "BatScare",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/BatScare"
  },
  {
    "categories": [
      "INeedAnIndexByMonday"
    ],
    "descriptions": {
      "TheGoonies": "Andy in The Goonies was able to save her friends from a deadly trap on account of the fact she took piano lessons when she was four years old.",
      "general": "To become a hero, one has to train their body and mind so that it can think and act quickly in a life or death situation. They might enroll in a local dojo to learn martial arts or study psychology in order to better understand the human mind. However, there are times when the hero's best training can come from their day job or general hobbies. Often times it's a means of acquiring a Chekhov's Skill.\\nFor times when characters train in sports and apply their athletic abilities in combat situations see I Know Madden Kombat. Also look toward I Know Mortal Kombat for situations related to video games."
    },
    "name": "Workplace-Acquired Abilities",
    "rdf_element": "WorkplaceAcquiredAbilities/int_22133ffc",
    "short_name": "WorkplaceAcquiredAbilities",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/WorkplaceAcquiredAbilities"
  },
  {
    "categories": [
      "ActionAdventureTropes"
    ],
    "descriptions": {
      "TheGoonies": "One of the most memorable scenes in The Goonies. \\\"Let's\\u2014\\\" \\\"get\\u2014\\\" \\\"out\\u2014\\\" \\\"of here!\\\" \\\"Like, NOW!\\\"",
      "general": "The good guys have just activated the self-destruct on the Big Bad's Kill Sat or carefully laid a time bomb in the center of the Elaborate Underground Base. Or maybe they have advance warning for a natural disaster... Whatever the reason, it's time to beat a hasty retreat!\\nAccording to an official Trivial Pursuit question, this is the second most often used Stock Phrase in movies, right after \\\"I love you.\\\""
    },
    "name": "Let's Get Out of Here",
    "rdf_element": "LetsGetOutOfHere/int_22133ffc",
    "short_name": "LetsGetOutOfHere",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/LetsGetOutOfHere"
  },
  {
    "categories": [
      "Spectacle"
    ],
    "descriptions": {
      "TheGoonies": "In The Goonies, there is a skull-shaped cave entrance.",
      "general": "Image kept on page per Image Pickin' thread: <a class='urllink' href='http://tvtropes.org/pmwiki/posts.php?discussion=1396008403058146100'>http://tvtropes.org/pmwiki/posts.php?discussion=1396008403058146100<img src=\\\"http://static.mediatropes.info/pmwiki/pub/external_link.gif\\\" height=\\\"12\\\" width=\\\"12\\\" style=\\\"border:none;\\\" /></a>\\n Please do not replace or remove without starting a new thread.\\n\\n\\nThere's a good reason the entrance to any underground cavern is called a \\\"mouth\\\".\\nConsider that the mouth is a breeding ground for bacterianote\\u00A0(both good and bad); it's dark, and damp, too, and has a lot of sharp objects lining its roof and floor.\\nNow consider a typical cave: Dark, possibly damp, a breeding ground for all sorts of unsavory creatures, with stalagmites on the floor and sharp (and occasionally falling) stalactites lining the ceiling...\\nSo is it any wonder that sometimes authors can't resist making a Visual Pun out of the \\\"mouth\\\" to a cave?\\nSometimes this goes beyond the visual metaphor and actually becomes a plot-relevant \\u2014 perhaps That's No Cave."
    },
    "name": "Cave Mouth",
    "rdf_element": "CaveMouth/int_22133ffc",
    "short_name": "CaveMouth",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/CaveMouth"
  },
  {
    "categories": [
      "CharacterizationTropes"
    ],
    "descriptions": {
      "TheGoonies": "In The Goonies, there's Chunk (the Big Eater among the kids) but even more so, there's \\\"Sloth\\\" Fratelli, the deformed Gentle Giant brother of criminal gang. When Chunk is tied up and put in the same room with Sloth, he tries to make small talk, and tosses a Baby Ruth to him; this seems to make Sloth fly in to a rage, and Chunk is terrified, until he realizes that Sloth is just trying to reach the candy bar. Sloth eventually breaks free of the chains holding him to do so, causing Chunk to comment, \\\"Gee, mister, you're even hungrier than I am!\\\" Later, the two of them raid the freezer for ice cream.",
      "general": "A character who really, really likes their sweets. Everything they eat could be classed as a dessert and if they drink tea it's got so much sugar in that the smell alone could kill a diabetic.\\nSometimes identified as fuel for a hyperactive character. Another common version is for the Genius (see Gadgeteer Genius, Genius Ditz, Teen Genius) to require lots of sweets- they burn the sugars by thinking extra hard. Something of a Truth in Television: the brain uses glucose as its primary source of energy and not getting enough is bad. Real Life examples of the Sweet Tooth heed warning, however, because having too much sugar is also bad - not to mention the risk of cavities.\\nWith adult characters, the same effect can be achieved with much lower doses\\u2014after all, most kids are nuts about the stuff to begin with. One frequent shorthand is to show someone adding huge amounts of sugar to tea or coffee (sometimes to the extent of an Overly Long Gag), with a bystander looking on in horror. Another reason for an adult being obsessed with sugar can be to emphasise their immaturity (or more positively, \\\"being in touch with their inner child\\\").\\nMay have some of the tendencies of the Big Eater. If they particularly enjoy lollipops, you may have an Oral Fixation on your hands. In kids' shows, may lead to An Aesop about tooth decay.\\nSee also Genius Sweet Tooth, a subset of this Trope, which reflects the tendency smart people have for it.\\nIf you were looking for that other Sweet Tooth, click here.\\nCompare and contrast with Real Men Hate Sugar. See also Mascots Love Sugar. For the audio / visual version, go to Tastes Like Diabetes."
    },
    "name": "Sweet Tooth",
    "rdf_element": "SweetTooth/int_22133ffc",
    "short_name": "SweetTooth",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SweetTooth"
  },
  {
    "categories": [
      "FairyTaleTropes"
    ],
    "descriptions": {
      "TheGoonies": "Mama Fratelli in The Goonies. She's the head of a family of criminals, including two of her sons.",
      "general": "A mother is one of the most central figures that a character can have growing up, and her influence can have an impact on that character even as an adult. If the character is lucky, that mother will be a loving one, and if he or she is really lucky, she'll be an Action Mom who can kick ass and take names if the character is ever threatened.\\nBut if the character is really unlucky and isn't suffering from Parental Abandonment, the character's mother will be an Evil Matriarch and chances are, she will make that character's life a living hell.\\nThe Evil Matriarch comes in two forms:\\nComedic: Usually used in the Dom Com, this variety is usually the mother of one of the two parents on the show who comes to visit every so often, and someone on the cast dreads it. Usually (though not always) this variety of Evil Matriarch is a meddling parent, often to an irrational extreme. Classically, this is a Mother-in-Law situation, but from time to time, the kids themselves, or even the child of the mother is the one that dreads it. In some cases, everyone hates the Evil Matriarch, like in Malcolm in the Middle where everyone dreads Lois's mother coming to visit. In other cases, her visit is appreciated by everyone but the daughter or son of the Evil Matriarch, like in Family Ties, where the matriarch is evil because her daughter feels she can't live up to mom's perfection. Expect this variety of Evil Matriarch to have Power Hair and other Fashionable Evil.\\nDramatic: This variety, which shows up in more dramatic media, is truly evil in a traditional sense, and is one of the worst villains one can face, especially if one of the Heroes or Love Interests is one of her children (or if she's married into his or her family as a stepmother). Many such Evil Matriarchs are completely convinced that they, and only they, know what's best for their children, and can be very controlling, manipulative, and perfectly willing to do anything they deem necessary for their children's sake, no matter how evil or destructive it may be. The most vicious examples of this variety of Evil Matriarch despise their children (or at least the one they've singled out as The Unfavorite) and are often physically or emotionally abusive towards them, and many of them are not above Offing the Offspring.\\nIf she's not entirely human, then expect her to be a Hive Queen. If she is also the Queen, expect God Save Us from the Queen!.\\nThe Spear Counterpart of this character type is Archnemesis Dad. The inversion is Antagonistic Offspring. See Abusive Parents and Parental Neglect for the more mundane versions. See Offing the Offspring and/or Matricide for what this might lead to if the kids fight back. If it's not your mother but her replacement who's making your life a living Hell, see Wicked Stepmother."
    },
    "name": "Evil Matriarch",
    "rdf_element": "EvilMatriarch/int_22133ffc",
    "short_name": "EvilMatriarch",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/EvilMatriarch"
  },
  {
    "categories": [
      "NamingConventions"
    ],
    "descriptions": {
      "TheGoonies": "Ma Fratelli from The Goonies.",
      "general": "Shut yo' mouth! \\\"I'm only Describing a Trope!\\\" We can dig it!\\nHave you noticed that the word \\\"mother\\\" is a common villain name? Maybe it's ironic, maybe it's symbolic, maybe it overlaps with the Hive Queen, but writers seem to think it's a scary word. And sometimes, of course, it's a Curse Cut Short that's very effective at Getting Crap Past the Radar.\\nThis can also be known as:\\n An Evil Matriarch of some sort (similar to \\\"queen\\\")\\n A twisted version of a \\\"mother\\\" (spreading The Virus and considering the victims her \\\"children\\\", for example)\\nSee also Almighty Mom, Monster Is a Mommy, Mother of a Thousand Young.\\nHas nothing to do with Abusive Parents. Usually. Also may or may not have to do with Your Mom."
    },
    "name": "One Bad Mother",
    "rdf_element": "OneBadMother/int_22133ffc",
    "short_name": "OneBadMother",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/OneBadMother"
  },
  {
    "categories": [
      "NarrativeDevices"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies. After Mikey finds a framed Treasure Map in the attic, he hands it to Chunk\\u2014The Fool\\u2014who predictably breaks the frame by dropping it.",
      "general": "The main character is looking at a picture, trying to figure out a clue in it. In frustration, he throws it down, breaking the frame... and there, inside the frame, is the clue \\u2014 a Treasure Map, or a letter from the person who took the picture, or something else that fit behind the picture itself.\\nA variation is when the frame gets broken accidentally, usually due to The Fool knocking it over."
    },
    "name": "Framed Clue",
    "rdf_element": "FramedClue/int_22133ffc",
    "short_name": "FramedClue",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/FramedClue"
  },
  {
    "categories": [
      "OlderThanDirt"
    ],
    "descriptions": {
      "TheGoonies": "The tunnel leading to One-Eyed Willy's ship in The Goonies is filled with many booby-traps, such as the most memorable musical riddle. It makes sense since, during Willy's time, only people with a noble/high-born education would be able to read ''sheet music'. Even most musicians would only know how to play instruments, not read standardized notation.",
      "general": "This refers to any barrier that requires the heroes to solve some kind of puzzle, Riddle or test of skill in order to pass. It is often given by Threshold Guardians (especially if the guardian in question is a Riddling Sphinx). You must be able to work it out based on the clues you are given on the spot.\\nIt's often a defense against smart people who want to take whatever is being guarded like a Treasure Room. It can also be a Secret Handshake of sorts to only allow smart people inside like Mensa.\\nIf you must come to it with some knowledge, it's Only the Knowledgable May Pass. Sometimes if those who tried to deploy that trope were clumsy, they gave you enough clues to make it this, and conversely, if the answer to this is too weird or insane, you may really need to know it in advance.\\nThe architect must have deemed this a better barrier than say, a lock and key carried on someone's person instead of being in a chest elsewhere in the building. After all, keys can be stolen but knowledge is intangible. Unfortunately, this will not stop people who are evil in addition to smart  or at least smart enough to trick the heroes into solving the puzzle for them.\\nSee Block Puzzle, the various Stock Puzzles and Stock Videogame Puzzles, and Solve the Soup Cans for examples of this.\\nExpect even the least smart of protagonists to be able to find a way to solve what was supposed to be an ingenious puzzle.\\nThis trope dates back to at least the Sphinx in Greek Mythology, making it Older Than Feudalism.\\nCompare Only the Worthy May Pass, These Questions Three; also see First Contact Math, and contrast Only Idiots May Pass."
    },
    "name": "Only Smart People May Pass",
    "rdf_element": "OnlySmartPeopleMayPass/int_22133ffc",
    "short_name": "OnlySmartPeopleMayPass",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/OnlySmartPeopleMayPass"
  },
  {
    "categories": [
      "Trivia"
    ],
    "descriptions": {
      "TheGoonies": "In two different scenes in The Goonies, Robert Davi, who plays Jake Fratelli, is shown singing opera. Davi had trained as an opera singer.",
      "general": "Some screen actors have talents other than acting\\u2014singing, dancing, what have you\\u2014and the show they're in will want to make use of it at some point. In most cases, this doesn't derail the story (much), often leading to viewers exclaiming, \\\"I didn't know [actor/actress] could [sing/dance/whatever]!\\\" However, it's not unheard of for the plot to stop dead just to allow such an actor (usually the lead) to show off.\\nThe line between this and Cast the Expert can be quite thin indeed. Contrast Irony as She Is Cast (in which an actor who is good at something [singing, dancing, etc] in real life has to play a character who is not good at whatever the talent is)."
    },
    "name": "This entry is trivia, which is cool and all, but not a trope. On a work, it goes on the Trivia tab.\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\n\\t\\t\\n\\t\\tThe Cast Showoff",
    "rdf_element": "TheCastShowoff/int_22133ffc",
    "short_name": "TheCastShowoff",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TheCastShowoff"
  },
  {
    "categories": [
      "IndexOfExactTropeTitles"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies. The Hero, Mikey, gives a speech convincing the Goonies to continue following the Treasure Map after the Jerk Jock offers them a chance to be rescued.",
      "general": "La R\\u00E9sistance is about to be crushed by The Empire. The Ragtag Bunch of Misfits sports team is way behind at halftime. The Dork Horse Candidate has just seen their opponent make a strong point in the political debate, to enthusiastic applause. The opposing attorney in the courtroom drama has just made their argument with laser-like precision. The MacGuffin was seized by the Mooks, and the team sees no way to recover it or succeed without it.\\nIn short, everything looks hopelessly lost.\\nAnd this is when the hero will step forward and make a pithy speech including at least one noteworthy One-Liner (similar to a \\\"Facing the Bullets\\\" One-Liner), to the effect of (or the specific phrase) \\\"It's time to take the fight to them,\\\" (often followed by a One-Liner Echo or a Dramatic Gun Cock). This sometimes happens right after a sidekick has joined the choir invisible via a Heroic Sacrifice. Sometimes the characters are going Give Me Liberty or Give Me Death!.\\nIn TV and movies, there's no situation so desperate that it can't be turned completely around with a brilliant one-minute rant. This speech means that the heroes are going to (finally) move to a proactive posture, despite the overwhelming odds and very real chance that they'll all end up dead.\\nThe background music usually swells to a rousing, if not outright majestic climax as the hero drives his point home. The Slow Clap or other ovation followup is practically essential, followed by a Misfit Mobilization Moment (or a Miracle Rally for sports-based works). But if a Grand Finale does not result, the whole thing will often backfire leaving the heroes badly battered. A Sedgwick Speech often looks like one of these at the beginning. When it's the whole damn human race that's getting the Rousing Speech, that's Last Stand. When the Rousing Speech is delivered by the leader of a nation or world, it is an example of Emergency Presidential Address.\\nUsually, it's the leader of the heroes who delivers the Rousing Speech signaling this transition, but a common variation is to have whichever character is typically most cautious (even cowardly) deliver it."
    },
    "name": "Rousing Speech",
    "rdf_element": "RousingSpeech/int_22133ffc",
    "short_name": "RousingSpeech",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/RousingSpeech"
  },
  {
    "categories": [
      "JustForPun"
    ],
    "descriptions": {
      "TheGoonies": "The Fratellis from The Goonies are never actually seen killing anybody, but have stuffed a corpse in the freezer at their hideout, and Ma Fratelli has no qualms with forcing the kids to walk the plank.",
      "general": "While it's not uncommon for some people skilled in a trade to pass it on to their children, sometimes the only thing a parent is skilled at that he can teach to his kids is murder, cold-blooded torture, and any other heartless criminal deeds you can think of. This will usually result in raising an evil clan, and when the kids are old enough, the family collectively and regularly adds to a rising body count and a growing criminal file.\\nThis is basically Siblings in Crime but with the parents (and maybe a few other extended relatives) having a hand in the villainy, as well.\\nUsually, The Family That Slays Together consists of at least one parent (if it is only one parent, it's usually the father), and at least two children of blood relation to the parent. If a mother and father are both present in the story, it's possible for the family to have only one child join them on crime sprees. Aunts, uncles, grandparents, or cousins may be among the ranks as well from time to time, especially when family inbreeding is suggested.\\nOne common variation involves an Outlaw Couple kidnapping a child or a group of children for the duo to raise as they would their own kids (typically, this either results in Stockholm Syndrome, which is rare, to betraying or outright killing their own kidnappers, which would be more common).\\nVery often, this trope might overlap with Cannibal Clan, especially in the horror genre. Sometimes, they are also Professional Killers.\\nCompare Overlord Jr./Daddy's Little Villain, where a single descendant of a Big Bad seeks to follow in his footsteps, and Unholy Matrimony which involves two villains being in a loving relationship or marriage. Siblings in Crime can follow, naturally, if there's more than one child in the mix. In the Blood is related if the kids pick up on their parents' evil habits without having been directly exposed to any of their criminal behaviors and/or it's a persistent trend throughout the generations. May also be a Badass Family, though your mileage may vary, depending on how \\\"badass\\\" you think violent crime and other felonies are.\\nContrast Mama Didn't Raise No Criminal, which involves parents denying that their criminal offspring are really evil, and Evil Parents Want Good Kids, where villains take steps to actively keep their children away from all that.\\nCompare and contrast the Badass Family, who can sometimes be this as well when villains but are usually more heroic, and all forms of the Generic Ethnic Crime Gang, particularly The Mafia and The Irish Mob."
    },
    "name": "The Family That Slays Together",
    "rdf_element": "TheFamilyThatSlaysTogether/int_22133ffc",
    "short_name": "TheFamilyThatSlaysTogether",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TheFamilyThatSlaysTogether"
  },
  {
    "categories": [
      "StockPhrases"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies: After realizing they're dealing with the wanted Fratelli gang.",
      "general": "A character is (sometimes, quite specifically) warned of the horrible things that can happen if they do Action A. They blow off the warnings. After the terrible things happen, The Cassandra then informs them they have no-one to blame but themselves.\\nThat statement, whether or not it uses the Stock Phrase \\\"I Warned You\\\" or \\\"I Told You So\\\" is this trope, provided the warning took place. If it did not, due to Poor Communication Kills, Not Now, Kiddo, or the warning not reaching its intended recipient, but the Stock Phrase is dropped anyway, the trope has been inverted, not played straight.\\nGenerally \\u2014 though not always \\u2014 Played for Drama if played straight. If Played for Laughs, expect The Cassandra to be an exaggeratively smug or jerkish in using this trope (a likely consistent trait that lent to no-one listening to them in the first place) and at least one indignant victim to try and silence them (usually by yelling a bitter \\\"Oh Shut Up!\\\").\\nSubverted, The Cassandra has every opportunity to say \\\"I warned you!\\\", but doesn't even bat an eye.\\nThis trope is often used after one of the various Threatening Tropes appears only to be ignored, or after a seemingly-mundane threat that is taken lightly turns out to be Not Hyperbole.\\nContrast Poor Communication Kills, Not Now, Kiddo, where the information doesn't reach its intended destination. Compare Cassandra Truth and Ignored Expert.\\n\\nExamples"
    },
    "name": "I Warned You",
    "rdf_element": "IWarnedYou/int_22133ffc",
    "short_name": "IWarnedYou",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/IWarnedYou"
  },
  {
    "categories": [
      "ComedyTropes"
    ],
    "descriptions": {
      "TheGoonies": "In The Goonies, Chunk says the worst thing he ever did was start one with fake vomit in a movie theater.",
      "general": "When one character barfs, soon everyone else starts barfing as well.\\nThis is Truth in Television, since vomiting has been known to inspire vomiting, as part of a prehistoric instinct: if someone from your same tribe vomits because he ate something harmful, chances are you ate the same thing and therefore it's best if you hurl it too.\\nFor the one person version, see Vomit Indiscretion Shot. Compare Reactive Continuous Scream. Contrast Vomit Discretion Shot. A small version of Disaster Dominoes. A form of Brown Note."
    },
    "name": "Vomit Chain Reaction",
    "rdf_element": "VomitChainReaction/int_22133ffc",
    "short_name": "VomitChainReaction",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/VomitChainReaction"
  },
  {
    "categories": [
      "SiblingTropes"
    ],
    "descriptions": {
      "TheGoonies": "Sloth in The Goonies. He's mentally disabled and physically deformed, kept chained in the basement, and not even a candidate to be his mama's Un Favorite. More importantly, unlike the rest of his family he's a good guy at heart, opposing them when given the chance.",
      "general": "This page is about the trope. For the 1996 film, go here. For the 2007 film, go here.\\nThe Black Sheep is the one member of a family who does not fit in, the prodigal son, the castaway from The Clan or from the Big Screwed-Up Family unless he left on his own smashing the door and Calling the Old Man Out. Can be The Unfavorite, but not necessarily.\\nA Black Sheep is not just someone who doesn't fit in with the family \\u2014 it's someone who rejects their role in the family, either deliberately or not. Or possibly someone whose reputation or morality is at odds with the family reputation/morality, because it makes them different from the rest of the family.\\nThe Black Sheep might be The Unfavorite but he can also be the Favorite instead. The latter case, of course, drives The Dutiful Son crazy as to why he's the favored one.\\nSometimes the Black Sheep is really bad \\u2014 AKA a criminal. Other times a Black Sheep is just considered rebellious, and might be a Cool Big Sis or Cool Uncle. On occasion, he is actually the Defector from Decadence. Often, he is a Misunderstood Loner with a Heart of Gold.\\nIn kids shows there is a common Aesop where a Black Sheep from one of the kids' families will show up as either a Cool Big Sis (or brother) or a Cool Uncle. Often the Cool Relative will inspire emulation by all the kids in town (sometimes excepting only the kid who is actually related to him). Eventually this emulation gets the kids into trouble. Either the Black Sheep helps the kids out and then delivers the Aesop that they really don't want to be like him, or he reveals himself to be a Jerkass and leaves the kids in their mess (often to be saved by the one kid who didn't emulate the Black Sheep).\\nContrast White Sheep, where all inversions of this trope belong.\\n\\nExamples"
    },
    "name": "Black Sheep",
    "rdf_element": "BlackSheep/int_22133ffc",
    "short_name": "BlackSheep",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/BlackSheep"
  },
  {
    "categories": [
      "ComingAttractions"
    ],
    "descriptions": {
      "TheGoonies": "The ultimate crossover: Goonies of the Caribbean: The Search for One-Eyed Willy (Mashup of The Goonies and Pirates of the Caribbean)\\n How about The Fugitive's Day Off, (Mashup of The Fugitive and Ferris Bueller's Day Off)?\\n Or even No Country for Old Men in Black (Mashup of No Country for Old Men and Men In Black)? It becomes Hilarious in Hindsight as Tommy Lee Jones' No Country costar Josh Brolin would play young Agent K in Men in Black III.",
      "general": "\\\"In a World where trailers are made for movies that will never exist...\\\"\\nThe show's great. You've seen every episode and bought the DVD collection. And there, tucked away in the extras, is the Holy Grail: the trailer for the movie.\\nBut something's not quite right. Perhaps the trailer gives a 1999 release date, and it's already 2007. Perhaps the characters in the trailer are parodies of themselves. Perhaps?\\nPerhaps it's a spoof. The movie isn't going to be made, and there was never any intention of making it; it was just the production crew having a bit of fun.\\nNever mind. At least the trailer's funny \\u2014 we hope.\\nThis is the Logical Extreme of Trailers Always Lie - while that trope is about trailers misrepresenting various portions of a real film, this is about a trailer lying about an entire work. That being said... sometimes the trailer is so well-received that people actually make the movie.\\nCompare Trailer Spoof, which is for a real movie, just not the one you thought it was."
    },
    "name": "Real Trailer, Fake Movie",
    "rdf_element": "RealTrailerFakeMovie/int_22133ffc",
    "short_name": "RealTrailerFakeMovie",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/RealTrailerFakeMovie"
  },
  {
    "categories": [
      "Spectacle"
    ],
    "descriptions": {
      "TheGoonies": "During the jail break in the opening of The Goonies, Francis Fratelli dumps gasoline in a ring around the local jail. When the cops attempt to pursue, Francis shoots the gasoline to create a big ring of flame to cover the escape.",
      "general": "In the world of fiction, when bullets hit a surface, they ricochet with sparks. When such bullets hit a container of anything remotely like gasoline, this has predictable results.\\nIn real life, bullets almost never spark, for various reasons. This is a Trope Examined by the MythBusters. Detailed here. Compare with Sword Sparks.\\nWhen adding examples, please only post subversions, when it's done realistically or when it's exaggerated."
    },
    "name": "Bullet Sparks",
    "rdf_element": "BulletSparks/int_22133ffc",
    "short_name": "BulletSparks",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/BulletSparks"
  },
  {
    "categories": [
      "Dialogue"
    ],
    "descriptions": {
      "TheGoonies": "Played for laughs in The Goonies. When the Fratellis catch Chunk and order him to tell everything under threat of shredding his arm in a blender, he proceeds to tell them every bad thing he's done in his life.",
      "general": "Someone confesses to something that wasn't actually what the interrogators were asking about. Often happens after a bit of Perp Sweating.\\nOften the conversation will play out so that none of the dialogue between the cops and the Mistaken for Murderer lets slip that he is really talking about the cookie he stole from his mother's house (which has been plaguing him ever since).\\nCompare You Just Told Me and One Dialogue, Two Conversations. Subtrope of Poor Communication Kills.\\n\\nExamples"
    },
    "name": "Mistaken Confession",
    "rdf_element": "MistakenConfession/int_22133ffc",
    "short_name": "MistakenConfession",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/MistakenConfession"
  },
  {
    "categories": [
      "CharactersAsDevice"
    ],
    "descriptions": {
      "TheGoonies": "Troy in The Goonies. He inherited his Jerk Ass genes from his father. \\\"Come on, Walsh. We don't have all day. There's 50 more houses to tear down after yours.\\\"",
      "general": "In every school, there's a Jerk Jock. See that tall, hunky and vulgar blond guy in the football letterman jacket picking on the nerd over there? What's his name, Dick? Bill? Kyle? One of those? That's him.\\nThe Spear Counterpart to the Alpha Bitch, the Jerk Jock is the Chief Bully who dominates the school/college environment through physical violence and threats of brutal retaliation. A boorish, obnoxious, spiteful asshole with an out-of-control sense of entitlement, he spends his time beating people up, getting drunk and destroying property; and in darker works, he may also be an incorrigible rapist. Just as the Alpha Bitch has a Girl Posse, the Jerk Jock has the Cool Crowd, a crowd of hangers-on who bow to his every whim and help him victimize whomever he decides to pick on. And he inevitably decides that Our Heroes are his favorite targets. His rare literal Distaff Counterpart (known as the Jock Bitch) exists mostly as a curiosity, mostly because it would take an unusually tall girl to play the part (at least six feet or taller).\\nLike the Alpha Bitch, despite his largely repellent personality the Jerk Jock is surprisingly popular, especially with the school's staff and most adults, and can get away with most anything. Chances are he's the only child of a wealthy family and usually has his parents wrapped around his finger. Or perhaps he's the son of some important Corrupt Politician who will cover up for him everytime. Or maybe he's simply the star quarterback in a town where highschool football is Serious Business. But whatever the case, most Jerk Jocks know there are certain lines not to cross if they don't want to get disowned. Needless to say, all of the above often lands him a 0% Approval Rating, but that's not something he cares about. Often in open conflict with the Lovable Jock or with the Big Man on Campus, who are usually too influential or physically strong for him to bully, especially if neither of them is willing to condone his behaviour. If he has siblings, one of them is usually a Nice Guy or a Nice Girl with whom he doesn't get along.\\nHowever, where the Alpha Bitch uses her wiles and sex-appeal to get what she wants, the Jerk Jock usually isn't very smart and is more likely to fall back on fear of violent reprisal instead. Usually, violence is not an option to deal with him, unless The Hero or somebody on their side is indeed physically stronger than him. Other than that, manipulating him to his doom often proves to be the more effective way to deal with him, since he's seldom bright enough to see through intrigues and the fear of public humiliation, loss of status or his parents discovering his ways is often sufficient to keep him at bay.\\nUnlike the Alpha Bitch who almost always gets what's coming to her, the Jerk Jock is a frequent Karma Houdini in fiction. But if the heroes try to get revenge on him by alternative means, this will often result in an Anvilicious Family-Unfriendly Aesop about \\\"not stooping to his level\\\". If the hero does manage to take revenge, it will be glorious and extravagant to such a brutal degree that one wonders if the writers are working through issues from their own childhood. In other cases, when Karma eventually comes for him, we'll see the Jerk Jock all grown-up, probably either a Jaded Washout, dreaming about his glory days, or a failed corporate thug who ended up in jail.\\nIn shows focusing entirely on school life, he'll be a primary antagonist; however, if the school environment is merely a setting and not the key focus he's more likely to be just a recurring nuisance for the characters to deal with, or a Villain of the Week. In shows dealing with the fantastic, he can often be found Mugging the Monster, or portrayed as stupid enough to bully someone even if he knows that they have powers that could reduce him to a smear on the wall.\\nWhilst it's not as common to get a sympathetic side to the Jerk Jock as with the Alpha Bitch, you'll sometimes get a softer version who isn't evil so much as an arrogant, self-absorbed Jerk with a Heart of Gold who doesn't really know any better. This version is much more likely to end up petting the dog, and may reveal his sensitive side in an Enemy Mine. He may also mend his ways and join the hero's side. And even while still a villain, the Jerk Jock can garner sympathy if he's given a Freudian Excuse (with having a \\\"Well Done, Son!\\\" Guy as a father or an outright abusive family being the most common).\\nIn some cases, the Jerk Jock could even be seen as a subtle author expression of white guilt, and/or anti-Americanism. This is because examples of this trope are almost exclusively white and either American, British, or German, (even in multicultural environments) and usually also exemplify the worst forms of behaviour stereotypically associated with white colonialism, even if it is only towards members of the Jerk Jock's own ethnic group.\\nSee Schoolyard Bully All Grown Up and Kids Are Cruel. Compare to, and sometimes may even overlap with, Big Man on Campus, who usually matches the Jerk Jock in popularity, but is less of an antagonistic force. Also compare Dumb Jock. Little relation to Violent Glaswegian.\\nNote if a character is a bully, but isn't depicted as a Sports player or a rich boy with Good publicity, then they're probably just a Barbaric Bully. However if thuggish, and Obviously Evil enough, some Jerk Jock characters can qualify as a Barbaric Bully as well.\\nContrast with Lovable Jock, which is often deliberately done to show that not all jocks are like this."
    },
    "name": "Jerk Jock",
    "rdf_element": "JerkJock/int_22133ffc",
    "short_name": "JerkJock",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/JerkJock"
  },
  {
    "categories": [
      "Dialogue"
    ],
    "descriptions": {
      "TheGoonies": "Mikey Walsh engages in this in The Goonies, while Andy is trying to hit the right notes on the skeletal organ (where one more wrong note will send them plunging to their deaths):",
      "general": "A common trend for characters in works of fiction is to shrug off danger or laugh at it. In totally serious drama, characters might be crying in fear or \\\"shell-shocked\\\" from life-threatening situations, but in any other genre, characters react to danger in any number of more calm ways:"
    },
    "name": "Casual Danger Dialog",
    "rdf_element": "CasualDangerDialog/int_22133ffc",
    "short_name": "CasualDangerDialog",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/CasualDangerDialog"
  },
  {
    "categories": [
      "MilitaryAndWarfareTropes"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies: Several, including a couple examples of the Rube Goldberg Device. Data, in his broken English, calls them \\\"Booty Traps\\\".",
      "general": "A version of the Death Trap, except instead of the good guys being put into it, they have to somehow get past it to achieve their objective. Such devices will usually gruesomely kill the first Red Shirt sent into it before the hero correctly figures out how to get past.\\nOtherwise, most such traps act in exactly the same way as Death Traps. Explosives are a particular favorite, as they will also destroy the installation involved. Expect a retreating character to trick a pursuer into it. Naturally a feature of the Death Course and Temple of Doom.\\nIf you're looking for that other kind of Booby Trap, see the Marshmallow Hell page.\\nAlso, please note that while some good guys and definitely the audience knows when and where the booby trap is, most characters just don't have these privileges. Unless they feel compelled to do things the \\\"right\\\" way.\\nObviously, Truth in Television. Keep in mind, however, that in most countries booby traps are illegal and if they kill someone you'll likely face jail time. This includes incidences of home invasion by a thief.\\nCompare and contrast Trick Bomb.\\n\\nExamples"
    },
    "name": "Booby Trap",
    "rdf_element": "BoobyTrap/int_22133ffc",
    "short_name": "BoobyTrap",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/BoobyTrap"
  },
  {
    "categories": [
      "TranslationTropes"
    ],
    "descriptions": {
      "TheGoonies": "In the Spanish dub of The Goonies, Mouth and Rosalita speak Italian.",
      "general": "Say there is a foreign product which gets ported over to your local market. It is notable, though, that the original version features references to this new culture. This reference will often be changed to another culture. This is usually done to keep the \\\"exotic flavor\\\" that is invoked in the original work, but sometimes this is done for less wholesome reasons: After all, who wants to see a bad guy whose defining character trait is that he comes from the audience's own country?\\nOther times, it can have a pragmatic reason, since sometimes having the person be foreign is necessary to the plot. (For example, in the play Chicago, a minor plot revolves around an innocent woman being sentenced to death primarily because she spoke no English and no-one could understand her Hungarian. Obviously, this wouldn't work when the show was performed in Hungary, so the Hungarian was changed to Chinese.)\\nWhen this is not done and there is a footnote or any author/translator's comentary of sorts, it will often say something on the lines of \\\"In English in the original\\\".\\nSubtrope of Cultural Translation. See also Accent Adaptation, Too Long; Didn't Dub."
    },
    "name": "Keep It Foreign",
    "rdf_element": "KeepItForeign/int_22133ffc",
    "short_name": "KeepItForeign",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/KeepItForeign"
  },
  {
    "categories": [
      "HorrorTropes"
    ],
    "descriptions": {
      "TheGoonies": "In The Goonies, Mama Fratelli threatens to invoke this trope on Mouth.",
      "general": "Refers to damage done to the tongue of any kind:\\n Someone's tongue getting burnt.\\n Someone biting their own tongue.\\n Someone biting someone else's tongue.\\n Someone tearing out someone else's tongue.\\n Someone's tongue getting cut off.\\n Someone's tongue getting stabbed.\\n Someone having a really nasty looking piercing on their tongue.\\n Someone eats their own tongue.\\n Someone eats someone else's tongue. Bonus points if they are force fed one.\\n Someone's tongue gets sliced with a knife.\\n Someone's tongue getting stuck on extremely cold metal.\\nNaturally with this trope, you may expect Nausea Fuel and/or Nightmare Fuel. Also a Sister Trope of Eye Scream, and Fingore. May dovetail with Overly Long Tongue in many cases."
    },
    "name": "Tongue Trauma",
    "rdf_element": "TongueTrauma/int_22133ffc",
    "short_name": "TongueTrauma",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TongueTrauma"
  },
  {
    "categories": [
      "WeaponsAndWieldingTropes"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies: Notable in that the dynamite is a dusty stick that sits unknowingly in a bundle of candles, so the kids spend the movie lighting candles as they traverse the maze. Only at the end do they light the dynamite and realize how lucky they were to have lit it in a place where it only caused a small cave-in.",
      "general": "A character is in a dark area and manages to grab something candle-like and lights it. As he looks around his surroundings, he doesn't notice he actually lit a stick of dynamite! And the room he is in contains a lot more dynamite!\\nAlternatively, it can be when a birthday cake has dynamite instead of candles.\\nSee also Matchlight Danger Revelation and Explosive Stupidity."
    },
    "name": "Dynamite Candle",
    "rdf_element": "DynamiteCandle/int_22133ffc",
    "short_name": "DynamiteCandle",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/DynamiteCandle"
  },
  {
    "categories": [
      "DeathTropes"
    ],
    "descriptions": {
      "TheGoonies": "Sloth does it in The Goonies to help his friends escape from the crumbling cavern.  He survives.",
      "general": "Rather than let their friends be squished like a bug by a Descending Ceiling, falling boulder, or one of those hero-seeking falling pillars, the Big Guy will step in, catch the falling object, and hold it up long enough for their friends to escape. Often utilizes the Atlas Pose.\\nCharacters don't need to have Super Strength or huge muscles to use this trope, so almost anyone can invoke it. However, weaker characters will likely face a Heroic Sacrifice as they are stuck holding up something that will crush them if/when they let go. That said, expect melodramatic characters intent on being a Martyr Without a Cause to be pulled to safety by their allies.\\nNot to be confused with Load-Bearing Boss (but that may very well lead to this trope). Barrier Warriors will frequently do this. Don't think too much about why the falling object doesn't break under its own weight and collapse all around the character, or how the ground underneath the character can support all that weight being channeled through the Load-Bearing Hero's feet.\\nDistantly related to the Barrier Maiden, whose \\\"load bearing\\\" duty is more metaphorical and less literal.\\nNot to be confused with We Cannot Go On Without You, and actually having fairly little to do with the Load-Bearing Boss."
    },
    "name": "Load-Bearing Hero",
    "rdf_element": "LoadBearingHero/int_22133ffc",
    "short_name": "LoadBearingHero",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/LoadBearingHero"
  },
  {
    "categories": [
      "InsecuritySystem"
    ],
    "descriptions": {
      "TheGoonies": "All the centuries-old booby traps in The Goonies.\\n Though many of these were shown to be falling apart; pieces falling off as the trap activated, and several parts of the caves collapsed completely.\\n Fridge Brilliance says that they were built for instant death, but the time that passed have left the traps barely able to do the killing, giving the Goonies time to get out alive. Plus Prof. Copperpot was killed by just ONE boulder from a trap of Rock Falls Everyone Dies and before reaching the trigger mechanism, so maybe the decaying ropes just snapped and killed the Prof. Now for that wooden ship sitting in salt water for the last 300 years....",
      "general": "Picture the following: Our adventure/fantasy heroes enter some ancient ruins in search of something important or valuable. Although the site may have lain undisturbed for centuries or even millennia, the place is filled with a variety of lethal, fully functional traps left behind by the previous occupants. Said traps are often Bamboo Technology considerably more complex than anything else the creators were capable of making. Even more remarkable is the fact that they have not decayed at all, even if the environment is one that should require extra maintenance, and are just as lethal as they ever were, let alone the fact that any poisons should have decayed centuries ago. Projectile traps might even be capable of reloading themselves an indefinite number of times.\\nIf we consider how this would work in the real world, it is obvious that if a facility is in actual use, it is grossly impractical to install traps that must be disabled or circumvented every time. It is much easier and more efficient to post guards as needed. If it had to be abandoned for some reason, traps might be left behind, but it would probably be easier to remove the important stuff and/or collapse the roof. In any case, traps would decay and cease to function if no one maintained them. But in these kinds of stories, the most complex things are the ones that are least susceptible to decay. This will only ever be pointed out if the ancient civilization is, in fact, still around and doing regular maintenance.\\nNote that in Speculative Fiction this can be hand waved as being caused by self-repairing technology, and in fantastic settings magic traps may be exempt from decaying or running out of ammo. Still, in most cases it is a grossly unrealistic way to introduce danger into the environment.\\nThis trope is a staple in fiction featuring Adventurer Archaeologists.\\nSee also Ragnarok-Proofing. A subtrope of They Don't Make Them Like They Used To and Older Is Better. When the deathtrap is one-time-use-only, this can often be an example of Already Undone for You.\\nContrast Forgot to Feed the Monster, for living hazards which suffer for not getting regular upkeep."
    },
    "name": "Durable Deathtrap",
    "rdf_element": "DurableDeathtrap/int_22133ffc",
    "short_name": "DurableDeathtrap",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/DurableDeathtrap"
  },
  {
    "categories": [
      "Settings"
    ],
    "descriptions": {
      "TheGoonies": "In The Goonies, one of the things Chunk confesses to when caught by the Fratellis was being sent to a fat camp and getting kicked out for pigging out.",
      "general": "A summer camp where overweight and obese children are sent to lose weight. Of course the children's parents are oblivious to what actually goes on in fat camp.\\nDrill Sergeant Nasties are everywhere, pushing the kids to their limit. The children constantly have to run up hills and the food is so scarce it could starve the kids to death, provided that they don't sneak candy into their rooms.\\nTreatment is so bad that the kids will eventually plan a Great Escape, in which the camp councillors will use the same methods that prison guards will use to recapture escapees.\\nThis is not true of real fat camps of course, which always use positive reinforcement, and attempt to teach the children healthy eating habits, instead of starving them. They are called, the more politically correct, fitness and weight loss camps, and now also allow teens and adults to attend.\\nSome of the stereotypes of fat camp are Truth in Television, however. Especially the running up the hill part."
    },
    "name": "Fat Camp",
    "rdf_element": "FatCamp/int_22133ffc",
    "short_name": "FatCamp",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/FatCamp"
  },
  {
    "categories": [
      "HighFatIndex"
    ],
    "descriptions": {
      "TheGoonies": "Jeff Cohen, best known as Chunk from The Goonies.",
      "general": "A character that used to be fat, but now isn't.\\nSometimes, part of a character's personality is driven by the fact that they were once overweight. Having a thin character revealed to have once been fat can tell you plenty about them. It can tell you that they have a past they aren't proud of and that they care enough about their health and appearance to do something about it. It also shows that the character has the strength and will power to take control of their life and get what they want, that they have self-discipline and motivation.\\nBe that as it may, a formerly fat background is not always all sunshine and rainbows. It can also imply a lot of self loathing and damaged self esteem, too. Many times, their slim-down can be a symptom of a desperate need to be accepted by society and an unhealthy dependence on what others think of them. The positive and negative attitudes are not mutually exclusive either, leading to many Formerly Fat individuals to have complicated self-images.\\nWhenever a celebrity loses weight, expect an Internet Backdraft over whether they looked better before or after, with plenty of size-shaming getting tossed in both directions.\\nFor the inverse of this trope, see Formerly Fit."
    },
    "name": "Formerly Fat",
    "rdf_element": "FormerlyFat/int_22133ffc",
    "short_name": "FormerlyFat",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/FormerlyFat"
  },
  {
    "categories": [
      "Dialogue"
    ],
    "descriptions": {
      "TheGoonies": "\\\"Heyyyyy yoooou guuuuuyyyyys!\\\" (The Goonies)",
      "general": "Related to Signature Scene, a Signature Line is a quote of dialogue that everyone remembers from a work of fiction, and has become synonymous with it. When the general public thinks of the work, this is the one quote that immediately springs to mind, and may be the only reason to remember the work at all.\\nThere are many reasons that the line may stand out. It may be..."
    },
    "name": "Signature Line",
    "rdf_element": "SignatureLine/int_22133ffc",
    "short_name": "SignatureLine",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SignatureLine"
  },
  {
    "categories": [
      "YMMV"
    ],
    "descriptions": {
      "TheGoonies": "The eponymous Goonies are mostly this alignment if not Chaotic Good.",
      "general": "The Character Alignment of sweetness and light. A Neutral Good character will usually comply with laws if doing so benefits the greater good, but rebel against those they consider unjust or which conflict with the greater good.\\nThere are different kinds of Neutral Goodness:\\n Passively Good \\u2014 they have fairly normal lives and ambitions, but will do good as the situation arises. They will help anyone they come across who needs it, then get back to their normal routine. They are most likely to be good towards family, friends, and those within their social circle (if they are a Jerk with a Heart of Gold, to the extent allowed), though they have no issue with helping strangers. They may even do volunteer work or other do-gooding that they find personally satisfying. At the same time, they do not view Good as the concept that defines their lives \\u2014 for them, Goodness is an obligation, or even just their nature. They will do what Good they like or what needs to be done, and then they will go home and carry on as normal.\\n Actively Good \\u2014 for them, Goodness is an Ideal as well as (or less likely, instead of) an obligation. They devote themselves to a life of Goodness and doing Good is the most important thing in their lives, or one of at least. They believe in doing what is Right and may sacrifice personal happiness, perhaps even in advance, in pursuit of that. If they are not an Ideal Hero, they admire and seek to imitate them. This type wants to do good, to go out and have adventures and to right wrongs and fight evil, but might be unprepared for the harsh realities they have to face, though they will probably have strong enough principles and beliefs that this will not stun them for long. Alternatively, Comes Great Responsibility is in play and they feel that doing good is their duty \\u2014 this does not make them Lawful Good, but means that they will do good regardless of whether Lawfulness is in play.\\nNeutral Good can be the best alignment you can be because it means doing what is good without bias for or against order. Neutral Good characters value freedom and will protect others' freedom as long as it's not used to do harm.\\nA Neutral Good character is not too caught up in Order Versus Chaos; they are concerned with moral goodness, but often not willing to enforce it in others. Something of a 'classic' hero or adventurer alignment as seen in many RPGs and JRPGs, as well as many anime series, particularly Sh\\u014Dnen (although most of them are Chaotic Good nowadays) or more idealistic Seinen works.\\nA Neutral Good character is sometimes a Friend to All Living Things and/or a Technical Pacifist, but they don't necessarily have to be either. Just think \\\"basically good person\\\" and you've probably got it. If they do decide to take up arms, they may have a particular affinity with kneecap and other non-lethal shots.\\nNeutral Good states may be really nice places to live, but depending on how idealistic the setting is, they may be deluding themselves. Neutral Good characters tend to suffer more personal conflicts in Grey and Grey Morality settings with Order Versus Chaos themes.\\nHowever, before you all run up to this alignment expecting it to hand out unconditional love and free cake, a small word of caution: if this alignment is combined with Good Is Not Soft, things can get interesting and you could end up with a Granny Weatherwax Type neutral good character. That is to say, someone who will always, always do what they believe is right, and won\\u2019t let either laws or personal freedoms get in their way. If played properly alongside Good Is Not Nice, this alignment can be downright scary.\\nLike Chaotic Good, Neutral Good is an alignment which is driven by an internal, rather than external code of morality. The difference between Chaotic and Neutral here is that Neutral Good is more pragmatic and usually (although not always) more moderate. Neutral Good's internal definition of Goodness is what directs them, irrespective of the presence or absence of an externally enforced legal code. If abiding by the law is the most expedient means of accomplishing a goal which is internally defined as Good, then that is what Neutral Good will do. If, on the other hand, they live in an environment with laws that they consider unjust, or which impede them in doing what they internally define as Good, then they will quite happily (although usually a bit more hesitantly and carefully than Chaotic) break said laws.\\nNeutral Good is primarily dangerous because the alignment is primarily concerned with Good results, whereas the means employed to achieve those ends are usually considered irrelevant. A fanatical Neutral Good can therefore be just as dangerous as Chaotic Good, if their internal heuristics get screwed up.\\nSee Also: Lawful Good, Chaotic Good, Lawful Neutral, True Neutral, Chaotic Neutral, Lawful Evil, Neutral Evil, Chaotic Evil."
    },
    "name": "This is based on opinion. Please don't list it on a work's trope example list.\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\n\\t\\t\\n\\t\\tNeutral Good",
    "rdf_element": "NeutralGood/int_22133ffc",
    "short_name": "NeutralGood",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/NeutralGood"
  },
  {
    "categories": [
      "AudienceReactions"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies was directed by Richard Donner but was produced by Spielberg. As an adventure starring children in the lead roles, it does seem typical of early-80s Spielberg movies.",
      "general": "When a work \\u2014 usually a film \\u2014 is better known as the work of its producer than as the work of its director. Often a result of marketing, as the name of a well-known producer may be used prevalently in advertising a film where the director is a rookie or largely unknown. In some cases, the director can also be displaced by the screenwriter if the writer is well-known (and neither the producers nor director are). More rarely, all of these can be displaced by an actor if the movie is seen as a star-vehicle.\\nThis trope tends to happen more in America than elsewhere due to Hollywood being a very producer-focused system, as opposed to other countries where directors get much more clout."
    },
    "name": "Director Displacement",
    "rdf_element": "DirectorDisplacement/int_22133ffc",
    "short_name": "DirectorDisplacement",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/DirectorDisplacement"
  },
  {
    "categories": [
      "SiblingTropes"
    ],
    "descriptions": {
      "TheGoonies": "Brand in The Goonies.",
      "general": "He's smarter, stronger, faster, more talented, and more refined than the hero, and \\u2014 just to add insult to injury \\u2014 he's probably sexier, too. His only problem seems to be moving his face out of that expression of bored, dignified disdain. And he just happens to be the elder brother of one of the main cast, which often gives them a raging inferiority complex.\\nWill most likely double as the Ineffectual Loner and Noble Demon, thereby running the risk of becoming an Ensemble Darkhorse. May or may not be evil, strictly speaking, but is almost guaranteed to fight against the protagonists at one point, and spout off Cryptic Conversation to prove how much better informed they are. May or may not be a Stealth Mentor. Often an integral part of an Evil Organisation, and may be the Enigmatic Minion in that case.\\nCompare to Always Someone Better, who is also often an older brother, Big Brother Mentor, where the brother is more open as well as a leader, and Big Brother Bully, where the brother is mean towards younger siblings. Contrast Big Brother Instinct, where the older brother instead goes out of his way to look after his younger siblings. A subtrope of The Stoic.\\n\\nExamples"
    },
    "name": "Aloof Big Brother",
    "rdf_element": "AloofBigBrother/int_22133ffc",
    "short_name": "AloofBigBrother",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/AloofBigBrother"
  },
  {
    "categories": [
      "CharactersAsDevice"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies - Brand, as the oldest, tries to be the Team Dad. He makes a point of trying to take charge of the younger kids, but this doesn't work out so well.",
      "general": "The opposite number to the Team Mom, more often than not the disciplinarian, lead-by-example-kind of character in contrast to the warm, nurturing tendencies of a Team Mom. The Team Dad is almost always the oldest member of The Team and if he isn't The Leader, then he's definitely The Mentor, and in family-based teams, he is the father (or at least the big brother) of at least one member. He tends to be strict and gruff, but he never hesitates to put his life on the line for his team members. Sometimes the facade might even crack and he'll show undisguised pride over his \\\"kids\\\", particularly if the team members are True Companions.\\nLike the occasionally non-female Team Mom, Team Dads aren't Always Male, but the rare female ones are almost always the exception.\\nIf a team has a Team Mom and a Team Dad, expect them to either play a Good Cop/Bad Cop routine on the rest of the team or come in conflict over their \\\"parenting\\\" philosophies. Cue \\\"Mom and Dad are fighting\\\" jokes from the \\\"kids\\\" if Team Mom and Team Dad aren't a couple, quickly followed by \\\"It's not like that, we swear\\\" from them (but they're very likely to end up together, anyway).\\nCompare Papa Wolf, whose children are his Protectorate; while the tropes can overlap, the Team Dad strives to make the \\\"children\\\" (who also tend to be older than the Papa Wolf's, and are less likely to be blood relatives) able to fight and defend themselves. A stern version of The Face since no one's going to argue when he says not to and will take the responsibility of speaking for the group.\\nCompare also A Father to His Men."
    },
    "name": "Team Dad",
    "rdf_element": "TeamDad/int_22133ffc",
    "short_name": "TeamDad",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TeamDad"
  },
  {
    "categories": [
      "NarratorTropes"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies specifically had someone mention this with the legend of One-Eyed Willy. The main character gives a handwave and says he asked his dad the same thing; probably one person got away.",
      "general": "This happens whenever a character relates a story or an urban legend they've heard about some monster or location which never leaves anyone alive. Ten to one, it'll directly affect them later.\\nThis of course raises the question of where the legend came from, if nobody has ever lived to talk about it? Perhaps the author was undead. Or the monster. Or both.\\nCompare Did You Die? No relation to Death of the Author. Apocalyptic Log is another possible explanation."
    },
    "name": "Undead Author",
    "rdf_element": "UndeadAuthor/int_22133ffc",
    "short_name": "UndeadAuthor",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/UndeadAuthor"
  },
  {
    "categories": [
      "WordPower"
    ],
    "descriptions": {
      "TheGoonies": "In The Goonies, Chunk is forced to do \\\"The Truffle Shuffle\\\" for the others to gain admittance.",
      "general": "If a former friend, former ally, enemy, political rival, or just someone you hate or like to make fun of wants your help, or a favor, or just to get in the clubhouse, why not make them grovel a bit before helping them?\\nYah, so, make them admit that you rule, or make them do a silly dance. A form of Word Power.\\nSometimes used by villains as part of trying to make a hero Kneel Before Zod.\\n\\nExamples"
    },
    "name": "Say It",
    "rdf_element": "SayIt/int_22133ffc",
    "short_name": "SayIt",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SayIt"
  },
  {
    "categories": [
      "StockPhrases"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies - the framed map is passed to Chunk specifically because the others know he'll smash it open by accident. They even count down in unison to the crash.",
      "general": "A Genre Savvy character knows what's going to happen next when the Genre Blind character does something stupid. So they voice that outcome and count down.\\n\\\"Three... two... one...\\\"\\nThe outcome happens exactly when the countdown ends.\\nRelated to Exact Time to Failure and Improbably Predictable. Not to be confused with the gameshow 321 or the Class 321 Electric Multiple Units."
    },
    "name": "Three... Two... One...",
    "rdf_element": "ThreeTwoOne/int_22133ffc",
    "short_name": "ThreeTwoOne",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ThreeTwoOne"
  },
  {
    "categories": [],
    "descriptions": {
      "TheGoonies": "The Goonies has aged very well indeed due to its use of simply massive and quite simply awe inspiring sets. The final act features a fully constructed pirate ship sitting in a gigantic water filled cavern. And it was all real. Even the water slides used to reach it in the film were 100% practical (the crew spent weekends using them). Its only major special effect failure is an obvious greenscreen shot when Mikey is lining up rocks to his medallion piece. The Special Edition commentary even has joking cries of \\\"worst greenscreen ever\\\" but throughout director Richard Donner is notably very proud of the way movies used to have epic sets like this built, not to mention how well it's held up because of it.",
      "general": "Practical effects are those which are done using props or special gear to produce an effect for the camera to film. Wind- and rain-machines, squibs, radio controlled vehicles, and pyrotechnics are all practical effects. So are breakaway furniture, walls or windows, and tilting or shaking platforms under the set.\\nThey are probably the most common type of effect and often seen as giving the most realism. The truth of the matter is that they give rise to a lot of Hollywood Science but we are so used to seeing them that The Coconut Effect plays across nearly everything we see and we get used to them. Really all those car explosions, spurting veins and gun shots would behave very differently in reality, it's a shame reality is so unrealistic.\\nRightly or wrongly, though, practical effects are seen by many as being in some way superior to Computer Generated Images or CGI. Certainly early CGI was much more prone to Special Effects Failure, the lower resolution, texturing and lighting flaws would push the images into the Uncanny Valley while even a bad practical effect could be seen to be physically real. The more modern CGI can be very conspicuous compared to well integrated practical effects.\\nA number of those who are Doing It for the Art will therefore stick to practical effects and the audience will often thank them for it. They will make proud announcements during promotions that everything in their movies is real and will take extra costs and risks to ensure their \\\"realism\\\".\\nCompare/Contrast Off-the-Shelf FX."
    },
    "name": "Practical Effects",
    "rdf_element": "PracticalEffects/int_22133ffc",
    "short_name": "PracticalEffects",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/PracticalEffects"
  },
  {
    "categories": [
      "SelfDemonstratingArticle"
    ],
    "descriptions": {
      "TheGoonies": "Brand uses this in The Goonies.",
      "general": "Have you ever noticed how sometimes, a character emphasises a dramatic line by ending it with the addressee's name, and repeating the line?\\nI sure have, Tropey. I suuure have.\\nOften used as a dramatic bookend before the credits or commercial break, or a cliffhanger ending. A variant common enough to get its own trope is \\\"I don't know, Billy... I just don't know.\\\"\\nNot to be confused with One-Liner Echo, where a different character repeats the line. Compare Call Back, where a line is echoed much later \\u2014 this is when the line is echoed straight away. See also The Name Is Bond, James Bond.\\n\\nExamples"
    },
    "name": "One-Liner, Name... One-Liner",
    "rdf_element": "OneLinerNameOneLiner/int_22133ffc",
    "short_name": "OneLinerNameOneLiner",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/OneLinerNameOneLiner"
  },
  {
    "categories": [
      "InjuryTropes"
    ],
    "descriptions": {
      "TheGoonies": "Francis lets out a high-pitched scream in The Goonies after he slips a on log over a stream of water and lands on it groin-first.",
      "general": "A comic follow-up to a Groin Attack, this is when a male character whose gonads have suffered injury cries out or speaks in a much higher frequency than his voice usually displays. Most often it's just a brief squeak of anguish, surprisingly high-pitched; in more extreme cases, he may talk, whine or even sing in falsetto for a time, or have his voice dubbed temporarily by an actress.\\nLess slapstick-oriented works sometimes reference this phenomenon, as when a Deadpan Snarker taunts a male with a high-pitched voice about his Vocal Dissonance, or The Snark Knight narrowly avoids a Groin Attack and muses how close he came to playing this trope straight.\\nWhile shrill yelps at the initial injury may be justified, prolonged high-pitched speech is a misconception, based on the false notion that eunuchs' voices are always high-pitched. In actuality, while boys whose testes are lost before puberty will retain a high vocal range into adulthood, a grown man whose voice already changed in adolescence can't lose his masculine tone of speech due to testicular injury: his larynx (voicebox) has already grown to a larger size that produces deep sounds, and lack of testosterone won't make it shrink. Castration is not retroactive.\\nSubtrope of Vocal Dissonance. Works that overplay it follow it up with Share the Male Pain. Helium Speech is a non-painful variant.\\nNot related to The Sopranos, unless the mob is fighting really dirty."
    },
    "name": "Instant Soprano",
    "rdf_element": "InstantSoprano/int_22133ffc",
    "short_name": "InstantSoprano",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/InstantSoprano"
  },
  {
    "categories": [
      "ComedyTropes"
    ],
    "descriptions": {
      "TheGoonies": "In The Goonies, this happens to Troy while he is in the bathroom, and Mikey and the others were fooling around with the water pipes. However, this would also count as a Special Effect Failure, because while Troy is thrust up into the air by the water from the toilet, you can clearly see the platform on which he is sitting that makes the stunt work.",
      "general": "This is a Comedy trope that can be seen very often in Western Animation. A character comes across a geyser and becomes innately curious about it as he looks directly into it, when the geyser suddenly erupts in a torrent of water that thrusts the character up into the air. This sometimes results in the victim bouncing around on the top of the spray.\\nThis is not Truth in Television, because a person will just get thrown back a few feet from such high water pressure. And be cooked by the superheated water.\\nThis is often a mechanic in video games (usually of the Platformer genre), and the geysers end up being moving and/or slippery platforms.\\nCan go hand-in-hand with: Making a Splash\\n\\nExamples"
    },
    "name": "Water Geyser Volley",
    "rdf_element": "WaterGeyserVolley/int_22133ffc",
    "short_name": "WaterGeyserVolley",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/WaterGeyserVolley"
  },
  {
    "categories": [
      "LoveTropes"
    ],
    "descriptions": {
      "TheGoonies": "Mikey's evident crush on Andi in The Goonies.",
      "general": "Children having \\\"crushes\\\" on one another isn't uncommon. To most children, loving someone just means liking them a lot\\u2014they have no notions of romantic or sexual love, and are, for the most part, innocent. They may make a Childhood Marriage Promise with their best friend just because, and even pretend to get \\\"married.\\\" Older kids generally have a basic idea of the birds and the bees, but still have to deal with raging hormones and lots of confusion.\\nWhat happens when kids get crushes on adults?\\nIn some cases, Squick happens. But in most instances, you have an ordinary kid who has to deal with the ordinary awkwardness of having a crush on someone way out of their league.\\nThe Precocious Crush is any instance of a child (usually pre-teen or younger, though young teenagers are sometimes susceptible) having a crush on an adult. Teachers are common targets, as are other, non-related caretakers. While having this kind of crush is more often associated with girls, it is increasingly common to portray boys as having this kind of crush. Usually, nothing ever comes of it\\u2014at least not until the character in question is much older, and even then, it still might seem a bit Squicky to some. In animation, the trope can be invoked without fully using it in the case of teenagers, where one character is only a few years younger than their crush, but differing rates of physical development makes the crush look a lot older than them.\\nAlthough it may seem to have Unfortunate Implications, this trope is Truth in Television. Lots of kids get crushes on their teachers or on their older neighbors, or friends of their older siblings...\\nSee also Puppy Love, where two little kids crush on each other, and Father, I Want to Marry My Brother, which relies on an innocent inability to distinguish between different types of love.\\nShould anything actually happen in the relationship, see Wife Husbandry, Jail Bait Wait, Hot for Student, and May-December Romance. See also Likes Older Women and Kidanova."
    },
    "name": "Precocious Crush",
    "rdf_element": "PrecociousCrush/int_22133ffc",
    "short_name": "PrecociousCrush",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/PrecociousCrush"
  },
  {
    "categories": [
      "NarrativeDevices"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies has Andy returning Troy's jacket to him as a wordless breakup.",
      "general": "A character breaks up with someone and deliberately returns what had been a personal gift, typically a ring. A good way to rub salt in the wound, even when done politely."
    },
    "name": "Take Back Your Gift",
    "rdf_element": "TakeBackYourGift/int_22133ffc",
    "short_name": "TakeBackYourGift",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TakeBackYourGift"
  },
  {
    "categories": [
      "CharactersAsDevice"
    ],
    "descriptions": {
      "TheGoonies": "Mouth in The Goonies is appropriately nicknamed. \\\"Shut up, Mouth!\\\"",
      "general": "This is what you get when a child believes they know better than adults, except this time, they actually do.\\nAlmost always on the side of good, most likely belonging to the Chaotic Good category, this character isn't an indiscriminate back-answerer like the Bratty Half-Pint but rather steps up when an unreasonable or outright abusive authority figure tries to do something stupid or horrible, instead of submitting quietly to their authority. Expect them to be quite snarky about it, at least at first.\\nUnlike the Bratty Half-Pint, who is almost always (and proudly) antagonistic and mostly exists to make The Hero's life miserable, the Mouthy Kid is almost always the protagonist or close to The Hero.\\nIn the '50s the Mouthy Kid would have been slapped upside the head and shipped off to the Military School. Children were little angels, or at least tried to be (Leave It to Beaver, My Three Sons, Family Affair). That all changed when Arnold on Diff'rent Strokes popularized the Mouthy Kid. Television parents have been dealing with attitude ever since.\\nLikely started out as a subversion of the Children Are Innocent attitude that had prevailed since Victorian times.\\nSee also: Bratty Half-Pint, Plucky Girl and Wise Beyond Their Years. Contrast Constantly Curious, who talks as much but has less sass."
    },
    "name": "Mouthy Kid",
    "rdf_element": "MouthyKid/int_22133ffc",
    "short_name": "MouthyKid",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/MouthyKid"
  },
  {
    "categories": [
      "ArchetypalCharacter"
    ],
    "descriptions": {
      "TheGoonies": "Chunk in The Goonies. Mikey even uses Chunk's clumsiness to break the Treasure Map from its frame. \\\"What'd you break this time, Chunk?\\\"",
      "general": "This is a character that everyone knows and loves. So long as they aren't involved in their plans, anyway. The Klutz bumbles and fumbles at seemingly anything they do, but they are kept around for one reason or another. The unstated reason is that they make a great Plucky Comic Relief, and serve as a humanizing accessory to a hero if he is The Stoic.\\nThere are varying degrees of klutziness, of course. Some characters are fairly capable with a notable tendency to trip, drop things, forget important tasks, or just plain hurt themselves with their reckless use of explosives, while others can effectively be a force of raw chaos, inducing Deus ex Machina levels of disaster that can foil even the best-laid plan.\\nA broader supertrope covering those characters that cannot be fit into the narrower Cute Clumsy Girl/Dojikko, which combines with Ms. Fanservice, The Ditz, and The Woobie specifically to transform the character into a Moe factory. Klutziness may be the bunny ears on the Bunny-Ears Lawyer, where their clumsiness is forgiven when they possess valuable knowledge or work skills where their utter lack of grace are not such an impediment. May occasionally transform into The Millstone or Spanner in the Works, depending on how well the heroes can point the klutz at their enemy's plans, and away from their own. If the klutz is routinely The Millstone, the audience may be compelled to yell \\\"Just Eat Gilligan!\\\"\\nOften used as an excuse to inject The Pratfall and other elements of Slapstick comedy. Interestingly, they may actually be Graceful in Their Element\\u2014 it's just not land."
    },
    "name": "The Klutz",
    "rdf_element": "TheKlutz/int_22133ffc",
    "short_name": "TheKlutz",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TheKlutz"
  },
  {
    "categories": [
      "IndexOfGothicHorrorTropes"
    ],
    "descriptions": {
      "TheGoonies": "An interesting variant: in The Goonies, Mouth uses a rip in the painting of a naked woman(conveniently placed at the mouth), to stick his tongue through for a quick laugh.",
      "general": "While visiting a Haunted House, someone sees the eyes of a creepy portrait painting seem to follow them. The other members of the party blame it on nerves, when in fact, the villain really is spying on our heroes through peepholes in the eyes of the portrait.\\nSee Also Stand-In Portrait"
    },
    "name": "Portrait Painting Peephole",
    "rdf_element": "PortraitPaintingPeephole/int_22133ffc",
    "short_name": "PortraitPaintingPeephole",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/PortraitPaintingPeephole"
  },
  {
    "categories": [
      "SelfDemonstratingArticle"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies. Hollywood long ago decided that children communicate solely in shouts or screams and just never calm down. To some extent this is truth in television, but \\\"to some extent\\\" is parsecs below where this film is.",
      "general": "There are Dark Worlds, Crapsack Worlds, Crapsaccharine Worlds, Worlds of Badass, Dystopias,\\nWretched Hives, Worlds of Chaos, Worlds of Snark, Worlds Gone Mad, complex Layered Worlds, even brutal Death Worlds...\\n...and then there are Worlds of Ham.\\nBasically, a World of Ham is an entire universe populated by Large Hams and the Hot-Blooded, where everything that happens is extremely dramatic, and every activity is deadly Serious Business, where in every conflict everything is on the line. Not because of the treatment it receives, but because it just works when done that way! Moments of Awesome, Funny Moments, Heartwarming Moments, and Tear Jerkers happen almost one after another, giving works with this sort of setting unbearably high Holy Shit Quotients.\\nEvery factor (characters, plot, pacing...) is configured to produce the maximum possible amount Emotional Torque, the more low-key scenes being used efficiently to make the more dramatic and action-filled scenes all the more breathtaking.\\nIn such a world, you cannot merely act - YOU MUST OVERACT! Scenery... will be chewed \\u2014 ground to fine dust. Giant cows will be milked dry. Every single line of dialogue will be given as if it were a pronouncement from Heaven itself, or unto the Heavens themselves \\u2014 WITH! ADDED! EMPHASIS! Furthermore, there's a good chance that BRIAN BLESSED can be found STOMPING around somewhere. In this kind of world, it may seem like everyone's having a ball being as over the top as possible, but, in fact, it is the setting that requires, nay, DEMANDS it... and by GOD, its demands will be met!\\nWorks that take place in a World of Ham tend to be Trope Overdosed, and contain Melodrama, as well as plenty of Ham-to-Ham Combat. They also preclude Evil Is Hammy, as that required just one side to be hams.\\nFor a world actually made of hamlike substance, see Meat Moss. It'll probably be just as badass, though."
    },
    "name": "World of Ham",
    "rdf_element": "WorldOfHam/int_22133ffc",
    "short_name": "WorldOfHam",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/WorldOfHam"
  },
  {
    "categories": [
      "ComedyTropes"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies. Stef loses her glasses early on in the adventure. While she complains a few times about not being able to see, she doesn't seem to have much of a problem throughout the rest of the movie.",
      "general": "Nobody who wears glasses in TV ever needs them for minor vision correction, except for reading glasses that are worn mainly to make the character look wise. Almost all TV characters with glasses have such bad vision that if they are deprived of their spectacles, they are practically blind \\u2014 usually hammered home by showing (briefly) the character's uselessly blurry point of view or the character making a Blind Mistake.\\nIn animation, when such a character's glasses are lost, their eyes shrink down to pinpoints, which indicates either that they are squinting to see, or to point out the jarring real life effect of seeing someone who has huge eyes when seen through heavily magnified glasses without their glasses. An anime variation on this is usually represented with the character's eyes being replaced by 3's or 3_3, which is another stylization of squinting.\\nOddly, when a character discards his/her glasses in order to look more attractive or more badass, that character invariably turns out not to be blind without 'em after all (unless it's a parody). Sometimes both will occur, with the character's eyesight varying based on what's convenient for the situation.\\nNote: The legal term \\\"legally blind\\\" is with corrective lenses (per linked article). Saying you are \\\"legally blind without your glasses\\\" is absurd.\\nFurther note: because special lenses are needed to keep eyeglasses from flashing stage lights, and reflecting filming equipment, any time an actor wears glasses, it's a character choice, and the glasses are special stage glasses, which the actor may or may not need. If an actor needs corrective lenses, and it's deemed wrong for the character, the actor has to do without, or wear contacts.\\nTruth in Television, albeit much rarer than it is in fiction.\\nSee also Nerd Glasses.\\nUnrelated to Fan Myopia.\\n\\nExamples"
    },
    "name": "Blind Without 'Em",
    "rdf_element": "BlindWithoutEm/int_22133ffc",
    "short_name": "BlindWithoutEm",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/BlindWithoutEm"
  },
  {
    "categories": [
      "Trivia"
    ],
    "descriptions": {
      "TheGoonies": "The Disney Channel used to air a version of The Goonies with a deleted scene in which the gang gets attacked by a giant octopus. This incident was actually mentioned by Data at the end of the theatrical cut.",
      "general": "How Did We Miss This One? Don't worry, it'll be included as an extra on the TV Tropes DVD.\\nA scene made for a work (in part or completed), but not included in the final release. These are often put back in special editions or included on the DVD release. They are also sometimes included in heavily-cut broadcast TV versions of films to stretch them back to a reasonable length.\\nScenes can be cut for a number of different reasons. Often the scenes are of much lower quality, so they were deleted for good reason. Yet some may contain details that appeal to audiences. Among the reasons include:"
    },
    "name": "This entry is trivia, which is cool and all, but not a trope. On a work, it goes on the Trivia tab.\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\n\\t\\t\\n\\t\\tDeleted Scene",
    "rdf_element": "DeletedScene/int_22133ffc",
    "short_name": "DeletedScene",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/DeletedScene"
  },
  {
    "categories": [
      "CameraTricks"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies had this when they realize they have enough treasure to ensure that they don't need to leave.",
      "general": "A group of characters want to discuss something privately amongst themselves, so they form a huddle; the camera POV switches, looking directly upward at the characters' heads and torsos as they talk. This is incredibly common in sports movies, where it appears during \\\"the strategic discussion during halftime\\\". (And in (American) Football movies, it appears even more frequently).\\nThis is also seen when a character is in bed, thrown onto his back, or in some other kind of upward-looking position; in this case, it's a P.O.V. Cam. It occurs frequently after a character has blacked out, leading to a suitable freak-out when he wakes up and sees loads of people staring down at him."
    },
    "name": "Huddle Shot",
    "rdf_element": "HuddleShot/int_22133ffc",
    "short_name": "HuddleShot",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/HuddleShot"
  },
  {
    "categories": [
      "ArchetypalCharacter"
    ],
    "descriptions": {
      "TheGoonies": "\\\"Sloth\\\" Fratelli from The Goonies.",
      "general": "He's big, muscular and angry looking. He might even be an actual monster. People are often fearful of him. But he's got a heart of gold. He loves children and puppies, and frequently abhors unnecessary violence. He probably has a few unexpected hobbies. He's the Gentle Giant. However, when push comes to shove, he's great to have on your side in battle.\\nThis is a subversion of common sense that has become an archetype in its own right. We are all used to thinking of big people and giant creatures as frightening and mean. Starting back as far as Frankenstein's Monster or earlier, the seven-foot shambling hulk of a man is almost always gentle inside, and misunderstood by society at large.\\nThis archetype is so common it's probably more surprising for the musclebound hulk to turn out to be an irreconcilable jerk or bloodthirsty killer.\\nTwo out of three examples of The Big Guy from the Five-Man Band are likely to be this type; he is their Class 2. (The other is usually a Genius Bruiser.)\\nThe typical Gentle Giant is quiet and, while not \\\"book smart\\\" (and sometimes outright stupid), is usually closer to Earth. An occasional subversion of this is to make him the most intelligent member of the group, either as a scientist and tech guy or as a cynic. He may also like things that other guys will think of as \\\"un-manly\\\", and woe to you if you mock him for that.\\nIf someone manages to push him too far, bad things will happen.\\nCompare The Grotesque. Contrast The Napoleon and Killer Rabbit. Not to be confused with the British progressive rock band.\\n\\nExamples"
    },
    "name": "Gentle Giant",
    "rdf_element": "GentleGiant/int_22133ffc",
    "short_name": "GentleGiant",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/GentleGiant"
  },
  {
    "categories": [
      "Dialogue"
    ],
    "descriptions": {
      "TheGoonies": "Done in The Goonies by Data, who \\\"cusses\\\", \\\"Holy S-H-I-T!\\\" He didn't want to swear in the film for his parents' sakes.",
      "general": "Whenever people (usually parents) want to discuss something they don't want anyone younger (or dumber) to know about, they will tend to spell it out because they figure that kids can't spell. Usually Played for Laughs, and is Truth in Television. In comedy, usually results in either the person being spoken to not understanding what was spelled and/or the person who's supposed to be locked out understanding perfectly.\\nThis can also be done with animals (e. g., mentioning a C-A-T within earshot of the dog).\\nCompare T-Word Euphemism, in which only one letter is used to represent an entire word.\\n\\nExamples"
    },
    "name": "Censorship by Spelling",
    "rdf_element": "CensorshipBySpelling/int_22133ffc",
    "short_name": "CensorshipBySpelling",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/CensorshipBySpelling"
  },
  {
    "categories": [
      "ComedyTropes"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies: Stef drops her glasses in a dark tunnel and Mikey accidentally steps on them. Despite a few early complaints about finding things hard to see, it doesn't seem to affect her that much, but she spends the remainder of the film squinting.",
      "general": "Any character who wears glasses and is Blind Without 'Em \\u2014 which is to say, almost every character who wears glasses on TV \\u2014 lives in fear of dropping or losing their spectacles, because invariably some helpful but elephantine bystander will promptly step forward to help look for them \\u2014 and immediately crush them underfoot. The sight-impaired character must then often spend at least part of an episode temporarily blind.\\nSometimes this is done deliberately, with the Jerk Jock or other bully of the week knocking the glasses off and crushing them underfoot in a classic Kick the Dog moment.\\nTruth in Television: Losing your spectacles can be a severe problem, as anyone who has really bad eyesight will testify. Although it's reasonably unlikely for the lens of glasses to be crushed when stepped on: in most cases, the frame will warp and a lens might pop out, but both are easily fixable on the spot. Despite the fact that they are still called GLASSes, these days lenses are made from lighter and less likely to break plastics.\\nSurprisingly, losing the single screw holding a lens in place is rarely done on TV. Which, in real life, are far far harder to find.\\nNot to be confused with A Glass in the Hand."
    },
    "name": "Dropped Glasses",
    "rdf_element": "DroppedGlasses/int_22133ffc",
    "short_name": "DroppedGlasses",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/DroppedGlasses"
  },
  {
    "categories": [
      "ActionAdventureTropes"
    ],
    "descriptions": {
      "TheGoonies": "The tunnel network explored by The Goonies certainly qualifies; while it didn't kill anyone in the movie, its traps had caused the death of Mr. Copperpot some decades before.",
      "general": "The linear version of the Death Trap, the Death Course is a gauntlet through which a hero must pass, using all his acrobatic skills, guile, Le Parkour, and witty bravado. The hero may have to traverse a narrow walkway hundreds of feet in the air while avoiding swinging blades, guillotines, statues that fire lasers at him, mechanical hands that grab him and throw him off the path to fall to his death, boulders that roll along the path to bowl him over, molten metal pouring from the ceiling, Pit Traps, etc. If he falls victim to just one obstacle or hazard, then the ordeal \\u2014 and his life \\u2014 is over. Essentially a sequence of Booby Traps, with Everything Trying to Kill You."
    },
    "name": "Death Course",
    "rdf_element": "DeathCourse/int_22133ffc",
    "short_name": "DeathCourse",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/DeathCourse"
  },
  {
    "categories": [
      "RomanceArc"
    ],
    "descriptions": {
      "TheGoonies": "In The Goonies, Andi intends to have her first kiss with Brand but in the darkness, and with her eyes closed, she accidentally kisses his younger brother Mikey instead. She really does believe it was Brand until later, when she gets another chance to kiss him and confirms that only Mikey has braces.",
      "general": "Well, we all know what a first kiss is, so let's just get down to the trope.\\nAn individual's first kiss will generally be the subject of a great deal of nervousness. It may be preceded by some Kissing Warm Up. Subjects (usually teenaged) will approach one another tentatively. They'll want it to be perfect, and with the perfect person, and when it inevitably isn't... well, it'll turn out all right anyway. In Japan, where the culture is more strict, the first kiss is an even bigger deal; Sacred First Kiss has more details.\\nA couple's first kiss will be the subject of much squeeing among fans, who have had to suffer through Will They or Won't They? for months or years. It may end the UST and result in a Relationship Upgrade, or may be sacrificed at the altar of the god, Status Quo. These kisses tend to be made in times of high stress, because the participants Cannot Spit It Out under normal circumstances. This often becomes a Big Damn Kiss, especially in action-packed dramas.\\nWhatever the type, a First Kiss is very susceptible to being a Crowning Moment of Heartwarming\\u2014 more so if the First Kiss is also a Last Kiss.\\n\\nExamples"
    },
    "name": "First Kiss",
    "rdf_element": "FirstKiss/int_22133ffc",
    "short_name": "FirstKiss",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/FirstKiss"
  },
  {
    "categories": [
      "IndexOfGothicHorrorTropes"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies. Right after the line \\\"If we don't do something now there's going to be a golf course right where we're standing.\\\" when Chunk, Mikey, Mouth, and Data are looking at the Treasure Map.",
      "general": "Nothing says \\\"This is dramatic, ominous and/or heavy foreshadowing!\\\" like an ionic ground-to-air charge-release \\u2014 in other words, lightning, and the accompanying thunder. Whether underlining the villain's apparent success, or the heroes' last-second arrival, you can just bet that the thunder is anything but a random result of the global weather-system.\\nThere are variants of this:\\n The Thunderous Underline marks a recently-spoken sentence or word as particularly important, illuminates a recently-arrived character as particularly dangerous and/or sinister, or provide appropriate mood lightning for a villainous laugh. This is frequently lampshaded, subverted, or just plain mocked, though it still gets played straight on occasion.\\n In The Thunderous Confrontation, a fierce thunderstorm provides an appropriately chaotic background to a battle \\u2014 of weapons or of wills. Usually, it will be the final, climactic confrontation between hero and villain, and you can just bet that the weather will clear up as soon as the hero's won. Frequently, the thunderstorm will play an active part in the battle, with lightning striking exposed targets, starting fires, causing trees to fall, or just making the Airborne Cavalry unable to come to the hero's aid. Almost always played straight.\\n A Storm Is Coming adds thunder as a sound effect to a dramatically brewing storm as part of the Foreshadowing. Often far off in the distance and with its lightning not visible; conversely, if lightning flashes had not had audible thunder earlier, thunder may indicate that the storm is closing in. It may also thunder with the storm clouds directly overhead but no rain yet.\\n Thunder Equals Downpour occurs when the thunder announces the torrential downpour, for which there is no other clue.\\nIn the past, the stock sound effect for this was \\\"Castle Thunder\\\", which now is only used for a retro feel. Interestingly, almost all Hollywood thunder occurs simultaneously with the lightning flash (obviously averted when said lightning is blowing up trees and power lines right in the middle of the scene). See also Lightning Reveal.\\nThis will not overlap with Gray Rain of Depression unless the person is angry as well as sad. An example of Empathic Environment. See also Thunder Shock, Fear of Thunder. Also see It Was a Dark and Stormy Night. Compare Lightning Can Do Anything, related to Stop Motion Lighting."
    },
    "name": "Dramatic Thunder",
    "rdf_element": "DramaticThunder/int_22133ffc",
    "short_name": "DramaticThunder",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/DramaticThunder"
  },
  {
    "categories": [
      "HorrorTropes"
    ],
    "descriptions": {
      "TheGoonies": "The pirate ship in The Goonies.",
      "general": "When our heroes explore the remains of an old and long since abandoned craft they may discover to their shock and surprise, as the light of their lamps fall upon the members of the craft's crew, that they are still dutifully manning their stations as skeletons or mummified corpses.\\nIt may be the wreck of a sunken ship on the ocean bottom, a Japanese WWII submarine stranded on a lone island, a derelict drifting through the endless night of outer space, a small plane caught high above the ground in the trees of the jungle or may take many other forms. It will often be a military craft of some sort or other. This means that the crew will be clad in the recognizable remains of their uniforms. Pilots will still be strapped in their seats. The helmsman will still be at the wheel. The Captain will be at the center of The Bridge sitting in the captain's chair surrounded by his Bridge Bunnies as he was in life. Often he will be wearing a captain's hat and some spider webs for decorations.\\nWhen the heroes approach them from behind the life like poses, durable uniforms, and the back of the captain's chair can create the short-lived illusion that the crew is actually still alive before the ghastly truth is revealed. Recoiling in horror from that revelation, a clumsy hero might end up knocking over another crewman, who collapses from a life-like pose to a pile on the ground. IN SPACE! with everyone wearing spacesuits the illusion can be especially vivid with only the skull inside the helmet giving it away.\\nThe important distinction that defines and separates it from just finding a craft with some human remains in it is the fact that the dead crew is mostly found in the same places and poses that the would have been in life, showing few if any signs of having panicked or fought their fate. Either that, or they died too quickly to react.\\nIt is also important to note that the crew in those cases is most definitely dead and not just mostly dead or undead. In the latter case, it's Dem Bones.\\nIf the reveal provides a Jump Scare, see also Peek-A-Boo Corpse. If you're looking for the more figurative meaning of the term, that's under Crew of One."
    },
    "name": "Skeleton Crew",
    "rdf_element": "SkeletonCrew/int_22133ffc",
    "short_name": "SkeletonCrew",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SkeletonCrew"
  },
  {
    "categories": [
      "LanguageTropes"
    ],
    "descriptions": {
      "TheGoonies": "The treasure map in The Goonies is in Spanish, but when translated into English, it becomes rhyming verse. No one even stops to consider how unusual this is.\\n Unusual? Or brilliant:",
      "general": "There's a phrase that's important to the plot or arc (possibly Arc Words). There will come a time the characters encounter the phrase in a foreign language. The foreign phrase will always be translated precisely to the important phrase, even though linguistic quirks would make this unlikely. It even works with songs, when the translation rhymes.\\nHowever, in TV land, languages have exact 1:1 word/syntax relationships and the translation, even if done by a third party who has never heard the Arc Words, will always be exact.\\nAn ancient inscription will always be rendered in complex long words with nuanced meanings, despite the fact that on-the-spot translation typically sounds more like a two year old trying to put together a sentence.\\nIt gets even more amazing when ancient spells and prophecies rhyme or are puns in English.\\nFor a good real-world demonstration, see Lost In Translation.\\nAn exception occasionally pops up when the form of a word in another language (usually with declensions, like Latin) reveals information such as number or gender that would require additional words in English, allowing the translation to be more precise than one would expect.\\nSee Either World Domination or Something about Bananas for the most common subversion, and Lucky Translation for a few real life examples."
    },
    "name": "Conveniently Precise Translation",
    "rdf_element": "ConvenientlyPreciseTranslation/int_22133ffc",
    "short_name": "ConvenientlyPreciseTranslation",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ConvenientlyPreciseTranslation"
  },
  {
    "categories": [
      "CharactersAsDevice"
    ],
    "descriptions": {
      "TheGoonies": "In The Goonies, the kids discover the bones of treasure hunter Chester Copperpot, who was apparently killed by the very first pirate booby trap he encountered. Rather than be horrified and turn back, the kids manage to use it as inspiration that they've made it farther than the expert.",
      "general": "They know more about the threat than anyone. Can tell the hero/heroine everything they want to know. They're a cop who's been hunting the Serial Killer for their entire career, or the Great White Hunter who knows more about dangerous animals than anyone. Perhaps they're an expert on ancient curses, or are schooled in the ways of killer robots. Whoever they are, they're the good guy's best and most reliable source of information regarding The Threat, its plans, its motivations, its patterns, its strengths, and its weaknesses.\\nUnfortunately for them, they're not the hero of the story and hence cannot rely on Plot Armor. Even more unfortunately, they're just useful enough to the hero that their death will make our heroes even more vulnerable, and their plight more dramatic. Worse still, since they're the expert on The Threat, their death by the Threat will augment the advantage the villain has over the heroes \\u2014 after all, if this Expert couldn't win against them, what shot do our non-Expert main heroes have?\\nCompare/contrast The Obi-Wan, who is also wise to the threat and often killed by it nonetheless, but The Obi Wan's death, if and when it comes, is often a Moment Of Awesome, Obi-Wan Moment, or at least dramatic. Compare also The Worf Effect, which is where an enemy dispatches a more generally established badass with ease, rather than one specialized against them. Finally, consider Mentor Occupational Hazard, which is the tendency of mentors to the hero to die.\\nAs a Death Trope, all Spoilers will be unmarked ahead. Beware."
    },
    "name": "The World's Expert on Getting Killed",
    "rdf_element": "TheWorldsExpertOnGettingKilled/int_22133ffc",
    "short_name": "TheWorldsExpertOnGettingKilled",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TheWorldsExpertOnGettingKilled"
  },
  {
    "categories": [
      "Dialogue"
    ],
    "descriptions": {
      "TheGoonies": "In The Goonies, Andi calls Mama Fratelli \\\"you gross old witch.\\\" Which is probably more an indicator of Andi's personality than it is censorship, since there's plenty of swearing elsewhere in the movie.",
      "general": "A Sub-Trope of Parenthetical Swearing, this is a line of dialogue used for Getting Crap Past the Radar, or that at least always leads to many raised eyebrows and jokes amongst the online fandom. Basically, Bob calls Alice a \\\"witch.\\\" The context and inflection, however, strongly imply that, in a world free of Media Watchdogs and censors, he would have used a different epithet \\u2014 one that rhymes with \\\"witch\\\" but starts with a B. Extra-fun if the woman in question really does have magic powers, justifying the word.\\nAnd this is not just in English...Spanish-speakers may like to use \\\"bruja\\\" as a polite form of \\\"puta.\\\" Yes, this includes \\\"hijo de bruja.\\\" Be warned, however, calling a girl a \\\"bruja\\\" could imply that she is more \\\"a woman of ill-repute\\\" whereas calling a girl a \\\"witch\\\" would simply suggest she is \\\"not a very nice lady.\\\"\\nMost prevalent in Western Animation. See also This Is for Emphasis, Bitch!, which can be used to set up this trope. It's often used when bowdlerizing a work for broadcast, when the version seen in videos, movie theaters, or CDs does say \\\"bitch.\\\"\\n\\nExamples"
    },
    "name": "Witch with a Capital B",
    "rdf_element": "WitchWithACapitalB/int_22133ffc",
    "short_name": "WitchWithACapitalB",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/WitchWithACapitalB"
  },
  {
    "categories": [
      "WeaponsAndWieldingTropes"
    ],
    "descriptions": {
      "TheGoonies": "Also used in The Goonies.",
      "general": "The character is using a blade as a brake or an anchor to stop his or her movement. This is done by ramming the blade into a wall or the floor, depending on direction of the character's movements.\\nBonus points if the movement is not stopped abruptly and long sparkly \\\"skid marks\\\" occur. The weapon may carve a long gash in the surface until its wielder comes to a halt.\\nA variation is when the character slows his fall by stabbing his blade into a tall banner (or, on a sailing ship, the sail). The \\\"stab the sail\\\" version shows up in a bunch of old pirate movies and was busted by the MythBusters.\\nIf the weapon is later used as a perch, to swing back up into battle, or to climb off of, it's a Stepping-Stone Sword. Not to be confused with Break Blade, or with literally breaking a sword.\\n\\nExamples"
    },
    "name": "Blade Brake",
    "rdf_element": "BladeBrake/int_22133ffc",
    "short_name": "BladeBrake",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/BladeBrake"
  },
  {
    "categories": [
      "Trivia"
    ],
    "descriptions": {
      "TheGoonies": "The singing thief Fratelli in The Goonies.",
      "general": "Most actors appear in more than one work. Often, this means that you don't know their name, but are forced to just exclaim \\\"hey, it's that guy!\\\" when you see one of these.\\nIf you're watching Law & Order or other Clueless Mystery, it might result in Narrowed It Down to the Guy I Recognize.\\nVoice actors in Animated Shows, as well as live-action voice dubs for foreign language shows, have a similar syndrome.\\nIf you can't quite remember which show the actor was in, it can result in much time spent on IMDB, trying to narrow down where else the viewer has seen that actor. If you get stuck, try You Know That Guy\\u2014someone might help you.\\nCompare Actor Allusion, You Look Familiar, You Might Remember Me from..., Hey, It's That Voice! and Plays Great Ethnics. Inverse of Retroactive Recognition. Parent trope of WTH, Casting Agency?. Retroactive Recognition happens when a That Guy later becomes a big-name star. The Cameo is when you're meant to recognize That Guy because he's already famous elsewhere.\\nHey It's That Guy!, now in (slightly outdated) book and docu mentary form.\\nNot to be confused with the television program That Girl."
    },
    "name": "This entry is trivia, which is cool and all, but not a trope. On a work, it goes on the Trivia tab.\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\n\\t\\t\\n\\t\\tHey, It's That Guy!",
    "rdf_element": "HeyItsThatGuy/int_22133ffc",
    "short_name": "HeyItsThatGuy",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/HeyItsThatGuy"
  },
  {
    "categories": [
      "TheIndexTeam"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies",
      "general": "Works titled after the organization or team that they revolve around. A blanket way of naming Character Titles.\\nIf it names the characters explicitly (or implicitly by numbering), it's a Multi-Character Title. If their team name is their number, it's The Notable Numeral. If the team is a group of parents/children/siblings/cousins or otherwise relations, it's a Family Title."
    },
    "name": "Team Title",
    "rdf_element": "TeamTitle/int_22133ffc",
    "short_name": "TeamTitle",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TeamTitle"
  },
  {
    "categories": [
      "TheIndexTeam"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies.",
      "general": "A Badass Family, even if they're not related. This will turn up a lot when discussing the Superhero Team, The Squad, and the Five-Man Band. And a fair number of Sci-fi shows set aboard a ship, since normally, even the baddest hero can't run a whole Cool Ship on their own. This isn't a requirement though.\\nSome general conventions that apply to almost all Badass Crews are:\\n They must include at least two people for obvious reasons. Two badasses might be Back-to-Back Badasses.\\n A Crew typically has a recurring and more-or-less permanent roster; you can reasonably expect to see the same members over and over. Which is why this trope is a fixture of TV shows, comics, and other media which is made of recurring installments. You see this less in movie series, since they're often built around a central character who may have different supporters in each movie, e.g. Die Hard or James Bond. This is probably because it's easier to sign one actor for a film rather than three or five.\\n Most heroes have some sort of support or backup, but in a Badass Crew, everyone must be capable of a Moment of Awesome. In fact a given episode may involve the least badass character doing something so awesome the jaws of the others drop in unison.\\n There's usually one person who acts as The Leader of the bunch.\\n In actual combat, on the battlefield, their combined badassery is indispensable. Not so much in their day-to-day applications on the home front; in fact, since they may also deal with lower-level antagonists that don't directly affect the other crew members, it can be downright messy and embarrassing. This is why, when not on the battlefield, they have to really watch what they tell each other.\\n Most important: the crew must have a certain loyalty toward one another. Like a family. If one of them is hurt/kidnapped/killed the others will bring holy hell on those responsible, even (and especially) if it means violating orders. For this reason, all Badass Crews are a form of True Companions.\\nSince, unlike a Badass Family, none of the members were born into the Crew (though some of them might be blood relatives), some writers will use the story of the Badass Crew's formation as an interesting origin story. In most Action/Adventures and Sci-Fi/Fantasy stories, the badasses came together to foil a Big Bad and/or save the world.\\nThe members of the Crew may not have even liked each other at first or even been outright enemies, but they come together and join forces because a) none of them can defeat the Big Bad and his plot without total cooperation, b) they worked out their differences, c) they see the badassness in each other and recognize a kindred spirit, or d) all the above.\\nThe Badass Crew may be or have been a Ragtag Bunch of Misfits. Amazon Brigade is an all-female variation of this. The logical extension of this is the Badass Army where they are essentially a gigantic Badass Crew. Almost invariably a Caper Crew doubles as a Badass Crew.\\nAlso see Misfit Mobilization Moment, which is often an origin for the Badass Crew."
    },
    "name": "Badass Crew",
    "rdf_element": "BadassCrew/int_22133ffc",
    "short_name": "BadassCrew",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/BadassCrew"
  },
  {
    "categories": [
      "Plots"
    ],
    "descriptions": {
      "TheGoonies": "In The Goonies, Astoria's evil realtors want to turn the main characters' house and possibly the entire town into a country club.",
      "general": "You know that big tree you used to play in as a kid? Well, you're twelve now, so you're old enough for the Childhood Memory Demolition Team to arrive and tear it down to build a new suburb/highway/bypass/parking lot/skyscraper.\\nThis demolition is often planned when a character is about to leave their childhood. The Memory is usually a house, an orphanage, sometimes even a small apartment building. If it's a big tree, expect a bonus Green Aesop. Whatever it is, it has great emotional value to the protagonist and friends.\\nExpect the young protagonist to have flashbacks and then try to protest the demolition team with mixed results. Temporary hold-offs like chaining yourself to the tree and deception will at first appear not to work. Eventually, the Childhood Memory Demolition Team will give up due to The Power of Friendship \\u2014 or they will succeed, giving the protagonist the Aesop that nothing lasts forever and you should sometimes let go of things.\\nSee also You Can't Go Home Again, It's All Junk, Death by Newbery Medal and End of an Age.\\nNot to be confused with the apostles of Rule 34.\\nCompare Saving the Orphanage where it's more than someone's childhood memories being destroyed."
    },
    "name": "Childhood Memory Demolition Team",
    "rdf_element": "ChildhoodMemoryDemolitionTeam/int_22133ffc",
    "short_name": "ChildhoodMemoryDemolitionTeam",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ChildhoodMemoryDemolitionTeam"
  },
  {
    "categories": [
      "DeathTropes"
    ],
    "descriptions": {
      "TheGoonies": "The body Chunk is locked in the freezer with in The Goonies.",
      "general": "On the big or small screen, if someone falls over motionless with their eyes wide open, it is a sure sign that they are dead\\u2014not unconscious, not capable of being resuscitated, but dead for good. In real life the position of the eyelids means nothing; people can pass out or fall asleep with their eyes open.\\nAdditionally, dead bodies always have their eyes either closed or all the way open, with no middle ground. (Again, this stands in contrast to reality, but nobody wants a dead body making a weird face and it's hard for an actor to have half-closed eyes without flickering.) In the latter case, someone who knew the deceased will often come along and manually close the corpse's eyes for \\\"respect\\\" or \\\"dignity\\\". This is always done the same way - using the palm flat open, they pass their hand over the dead person's face, somehow closing their eyes.\\nIn old times, the friend will also put two coins over their closed eyes as well, to \\\"pay the boatman\\\" to take them across the river Styx into the afterlife. See Due to the Dead.\\nThe above is universally true of live-action, but anime occasionally depicts someone fainting with open eyes or dying with half-closed eyes. Open-eyed deaths in anime often have the iris/pupil area of the eye drawn as a dull grayish spot. In Western animation, death is rare, visible dead bodies even rarer, and open-eyed corpses unheard of. Except in animated Batman movies, of course. In Western comics, expect instead two large X drawn over the eyes. In many Western (not as in Cowboy movies) action films, people will often die with eyes wide open when they are killed by surprise.\\nIf they're Not Quite Dead, expect to see their eyes open. Otherwise? He's Dead, Jim.\\nNote that \\u2014 perhaps because of Partly Cloudy with a Chance of Death \\u2014 frequently it rains into the eyes. That is the clinching proof of death.\\nIf a character's eyes close when they die, it's Big Sleep.\\nAs a Death Trope, several spoilers will be unmarked ahead. Beware."
    },
    "name": "Dies Wide Open",
    "rdf_element": "DiesWideOpen/int_22133ffc",
    "short_name": "DiesWideOpen",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/DiesWideOpen"
  },
  {
    "categories": [
      "NationalStereotypingTropes"
    ],
    "descriptions": {
      "TheGoonies": "Data from The Goonies is this in full 80's glory.",
      "general": "Pretty much any South or East Asian character in western media who isn't a martial artist or a gangster will be highly intelligent or unusually geeky...if not both. If done clearly and more on the intelligent side than geeky, this will be an exaggeration of the Brainy Brunette.\\nThe polar opposite of this, becoming more common in recent years, is the Asian Airhead \\u2014 an almost Always Female character archetype centering on an Asian girl who is gorgeous, popular, thoroughly Americanized (or not) and dumb as a brick.\\nThe reasoning behind this stereotype is that most Asian cultures regard education and smarts as very important things. Children are expected to study very hard to obtain good grades and get into good schools. This also means that \\\"nerdiness\\\" is viewed more positively in these cultures (as evidence of studying hard, rather than too hard as it is usually perceived in American popular culture).\\nThe possible Trope Codifier was Japanese leader Hideki Tojo, who wore glasses and had an overbite like so many stereotypical nerds, and was portrayed as very nerdy in World War II Allied propaganda. In fact, you could argue that the classic Nerd archetype is a combination of how Jewish people (supposedly) talk with how Japanese people (supposedly) look.\\nSee also Bollywood Nerd and Jewish and Nerdy. The Other Wiki has an article on the \\\"model minority\\\" stereotype from which this trope is derived. Contrast All Asians Know Martial Arts, as most Asian and Nerdy characters lack the athletic ability for martial arts. For related tropes, see Nerd and Black and Nerdy."
    },
    "name": "Asian and Nerdy",
    "rdf_element": "AsianAndNerdy/int_22133ffc",
    "short_name": "AsianAndNerdy",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/AsianAndNerdy"
  },
  {
    "categories": [
      "VideoGameTropes"
    ],
    "descriptions": {
      "TheGoonies": "A non-video-game example from The Goonies: Data activates his \\\"Bully Blinders\\\" because nobody else brought a flashlight to the cave. While the intense light does indeed blind the rest of the gang for a few moments, it also burns out the batteries just as quickly.",
      "general": "In video games where the player is given a flashlight, it will come in one of two flavors: either its batteries run forever or a pitifully short time. This is the latter case.\\nPerhaps they put in some near-dead batteries, perhaps it's solar powered, perhaps it's simply a cruel trick being played on the player's avatar. Whatever the reason, few - if any - games have realistic flashlights with cells that last at least an hour before needing a replacement.\\nMore shockingly, in most cases of Ten Second Flashlight, the battery will actually recharge by itself, and in in half the time it took to discharge, leaving questions as to why they simply didn't double up the power source. If it doesn't recharge, you may have to rely on your Muzzle Flashlight instead. Typically, this kind of torch tends to shine a brighter light than the infinite variety to compensate for the short runtime.\\nUsed to be Truth in Television in the flashlight's early years \\u2013- the reason it has this name is exactly because it could only be \\\"flashed\\\" in short bursts, or the batteries would die at about the rate a safety match burns out. Technology Marches On, however, and with it came low-powered models that could last a few good hours... provided the bulb held (the regular incandescent one hardly would last a full battery charge). Finally, since The New Tens, LEDs can easily invoke a downplayed version of Infinite Flashlight: torches on low-output modes have ordinary batteries lasting months even when used nonstop.\\nIn regards to the same modern flashlights, they can actually be ten-second, fast-recharge (in a sense; they don't turn off completely, but the output is lowered) for one reason: overheating. However, good luck finding a single work (not just videogames) that takes that into account or a creator that knows that.\\n\\nExamples"
    },
    "name": "Ten-Second Flashlight",
    "rdf_element": "TenSecondFlashlight/int_22133ffc",
    "short_name": "TenSecondFlashlight",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TenSecondFlashlight"
  },
  {
    "categories": [
      "ComedyTropes"
    ],
    "descriptions": {
      "TheGoonies": "Francis's hairpiece in The Goonies. It's especially bad after the various times it gets knocked off his head and he puts it back on.",
      "general": "The ridiculously bad and often obvious toupee that adorns comedic character and men in mid life crises to show off their folly and reveal the character's desire to maintain a facade of authority or manliness (it might not even have to be an incredibly bad toupee but one revealed comically to such an end). Can be Played for Drama if the character is wearing a cheap wig/toupee due to chemotheraphy or a horrific accident that cost the victim his or her hair (like a fire or a chemical mishap).\\nFor other types of fake hair, look here."
    },
    "name": "Dodgy Toupee",
    "rdf_element": "DodgyToupee/int_22133ffc",
    "short_name": "DodgyToupee",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/DodgyToupee"
  },
  {
    "categories": [
      "VideogameSettings"
    ],
    "descriptions": {
      "TheGoonies": "An underground area in The Goonies has one. Sloth pushes on a pipe and causes a traffic accident above.",
      "general": "Water pipes, ducts and similar things have a tendency to be arranged in ways that resemble great walls of metallic spaghetti.\\nThis is especially common in videogames that use thick pipes for Space-Filling Paths, Insurmountable Waist High Fences, or just generic platforms in an Absurdly Spacious Sewer or Eternal Engine.\\nCan sometimes be Truth in Television due to people taking the easy path out and just using whatever scrap parts they happened to have lying around."
    },
    "name": "Pipe Maze",
    "rdf_element": "PipeMaze/int_22133ffc",
    "short_name": "PipeMaze",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/PipeMaze"
  },
  {
    "categories": [
      "StockPhrases"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies \\u2014 Mouth.",
      "general": "A difficult situation presents itself, or the protagonists find themselves in a bad situation. One of them says something about how the situation, like how dangerous it is. And then another character, showing how tough they are, takes that description and says it's their middle name.\\nOn the lighter side of this trope, it may be when a character states that they're up to a task, and to prove it, that the nature of the task just happens to be part of their name.\\nOften played with these days, such as having another character then say they thought their middle name was something else (almost invariably embarrassing), or pointing out how silly it would be if that was really part of their name. Or that they have Only One Name, so can't have a middle. Or, conversely, having it actually being their real middle name.\\nA Stock Phrase.\\n\\nExamples"
    },
    "name": "Metaphor Is My Middle Name",
    "rdf_element": "MetaphorIsMyMiddleName/int_22133ffc",
    "short_name": "MetaphorIsMyMiddleName",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/MetaphorIsMyMiddleName"
  },
  {
    "categories": [
      "GunsAndGunplayTropes"
    ],
    "descriptions": {
      "TheGoonies": "Data's \\\"Pinchers of Peril\\\" in The Goonies. This gadget appears to be made from wind-up teeth and a Slinky and turns out to be useful not only in saving him from a fall, but also for a later Groin Attack against the Fratellis.",
      "general": "The Grappling-Hook Pistol is an essential item for any aspiring Badass Normal, Cape, or secret agent. This handy bit of Applied Phlebotinum can deploy a grappling hook with laser-guided precision to a secure holding point at the top of any tall building, allowing its user to climb with ease. Particularly spiffy examples are equipped with motors, and can function as field-expedient elevators as their users hold on for dear life. It can also be used to implement the Building Swing, though its primary function is usually just for climbing. It also lends itself to You Will Not Evade Me.\\nIn settings that predate firearms the alternative is the grappling arrow used by bow wielding protagonists. While it can be an arrow with a grappling hook more often it's just a standard arrow with a rope tied to it.\\nThe Grappling-Hook Pistol is generally a fairly bulky item for a handheld pistol, though unreasonably small for the length of line and hook firing charge that it contains. Its limited utility makes it a special-purpose item that the hero is unlikely to carry... but it generally conveniently appears from hammerspace when it is needed.\\nThe hooks themselves are Plot-Sensitive Items, capable of all three variants of Instant Knots - latching onto, wrapping the cable around, or piercing their target, depending on the needs of the script. The wrap-around cable is a strange effect, as it always attaches to the anchor point snugly enough to support whatever is on the other end of the cable on the first try. If the cord can automatically retract, the person can just hold on with one hand with inhuman strength to get pulled up; this is especially dramatic if they're holding someone else with their other arm. It's also very handy when you find yourself or an innocent civilian falling, but let's hope the cord has some elasticity.\\nGrappling guns actually exist (see \\\"Real Life\\\" below), but the real ones are somewhat larger than depicted on screen, especially if not base-fired only (though recent designs allows more compact systems). As in \\\"pneumatic grenade launcher of load-bearing design with built-in reel of strong rope\\\" \\u2014 though strong crossbow could work too. Hook is massive, rope adds a lot of drag, so the launcher's power (and recoil) should be considerable.\\nPartially busted by the MythBusters in 2007. (Because the aforementioned size makes them too large to be carried around on a superhero belt.) An ascension device was built that essentially fit the size, but including the launching mechanism would have made it simply too bulky.\\nA variation \\u2014 also partially busted by the Mythbusters \\u2014 has the grappling hook attached to the hero's (or villain's) car, for turning corners at high speed. There is no line capable of withstanding the sheer force that goes into a car turning at high speeds \\u2014 yet.\\n\\nExamples"
    },
    "name": "Grappling-Hook Pistol",
    "rdf_element": "GrapplingHookPistol/int_22133ffc",
    "short_name": "GrapplingHookPistol",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/GrapplingHookPistol"
  },
  {
    "categories": [
      "StayAheadOfThisIndex"
    ],
    "descriptions": {
      "TheGoonies": "In The Goonies, it's implied that Sloth's deformity was caused by being dropped as a baby. When Ma Fratelli tries to calm him down by singing \\\"Rock-a-bye Baby\\\", Sloth reacts to the line \\\"the baby will fall\\\" as if it has unearthed Repressed Memories, precipitating his Heel-Face Turn.",
      "general": "A explanation for a character's eccentricity, ditziness, lack of intelligence, brashness, etc is for them (or others) to harm their head as a infant or a child. A possible cause of this trope could be that they were accidentally dropped by their Alcoholic Parent, who had a little too much to drink. In some cases, they were actually pretty intelligent before the incident happened. One variation of this trope is that the character's mental deficiencies are not from a head injury but by them ingesting something harmful and toxic such as paint chips or alcohol. Another is that the brain damage was due to the character being deprived of something that's essential or substantial to having a relatively healthy body.\\nIf this trope is Played for Laughs, a character may jokingly or cheerily suggest to the others that a daft moment that another character (who usually has no disabilities and is mostly functional otherwise) just had was due to them injuring their head in their childhood. However, if it's Played for Drama and the character genuinely had head trauma in the past, it's used as a indication that the character was abused as a child or had a very dysfunctional childhood (they may also have a head deformity because of it).\\nRelated to Easy Amnesia, Tap on the Head, Hard Head, Circling Birdies.\\nA classic example of a Hilariously Abusive Childhood."
    },
    "name": "Childhood Brain Damage",
    "rdf_element": "ChildhoodBrainDamage/int_22133ffc",
    "short_name": "ChildhoodBrainDamage",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ChildhoodBrainDamage"
  },
  {
    "categories": [
      "HorrorTropes"
    ],
    "descriptions": {
      "TheGoonies": "In The Goonies, Chunk finds a freezer full of ice cream in the basement of the Fratellis' hideout. Gradually the others notice something behind him, or rather someone who happens to be dead and promptly falls on the heroes. \\\"It's a stiff!\\\"",
      "general": "The heroine has just escaped from the Serial Killer or the gruesome corporeal manifestation of the Cosmic Horror and is running through the Haunted House, desperately trying to find a means of escape. She's managed to avoid tripping over her own feet and falling like an idiot, and if she can just make it through this next upcoming door, she may just be able to make it to the outside world and sweet, sweet freedom!\\nShe opens the door... only to find herself standing nose to nose with a decayed, maggoty, slack-jawed corpse...\\nCue Scare Chord. Cue also a huge scream from the heroine and from any traumatized 8-year olds who may have the misfortune to be watching this show.\\nYes. Once again, the Peek-A-Boo Corpse \\u2014 the bane of squeamish horror movie watchers everywhere \\u2014 has made an appearance, rearing its ugly, eyeless, wormy head and worming its way into the nightmares of kids and adults alike.\\nIf you're a naive moviewatcher (e.g., a child), there is no defense from the Peek-A-Boo Corpse, for there is no way to see it coming. Even if you've had some experience watching horror movies (and you can pretty much tell if a desperate Damsel in Distress is going to run into trouble), there are still times and places when the Peek-A-Boo Corpse will pop out unexpectedly, scaring the bejeezus out of even the most hardened of horror fans, especially if it's a particularly hideous one. Most Peek-A-Boo Corpses like to hang around haunted houses and cemeteries, but occasionally they'll turn up in clean and innocuous environments where you'd least expect them (and where they'll have maximum shock value). A common way to find out if an ordinary, non-suspicious character is actually a villain is to have the heroine stumble upon a Peek-A-Boo Corpse hidden in their closet or basement. (Unfortunately, for the heroine, the villain is usually close by, watching this development, if they're not actively chasing her already.)\\nYou can expect the identity of the Peek-A-Boo Corpse to be:\\n An anonymous female victim of the villain, if he's a Serial Killer, or possibly his wife (or wives) if he has a history of marrying women who mysteriously disappear.\\n A non-main character who, up until the discovery of his body, was considered the prime suspect in the Murder of the Week (\\\"Hunh. Guess he didn't do it after all...\\\")\\n A Jerkass non-main character whose karmic death would have been very satisfying if his corpse hadn't turned up in such a horrible, trauma-inducing way.\\n Just some random, hapless ghoul\\nIn order for a body to qualify as a Peek-A-Boo Corpse , its appearance must somehow jolt the viewer and the person finding it should either be (a) actively engaged in a search for something else or (b) running to escape some real or perceived danger. Note: In the event that the half-destroyed corpse-like body of the villain should pop out and scare the heroes after they had mistakenly thought that they had laid it to rest, it technically doesn't qualify as a Peek-A-Boo Corpse moment (the main reason being that... well... the villain isn't entirely a corpse yet...)\\nCompare Cat Scare and Spring Loaded Corpse. If the corpse playing peek-a-boo was hidden in an extremely odd location, that's Body in a Breadbox. If they were found on the ceiling, that's Ceiling Corpse."
    },
    "name": "Peek-A-Boo Corpse",
    "rdf_element": "PeekABooCorpse/int_22133ffc",
    "short_name": "PeekABooCorpse",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/PeekABooCorpse"
  },
  {
    "categories": [
      "ComedyTropes"
    ],
    "descriptions": {
      "TheGoonies": "In The Goonies, Mrs. Walsh asks Mouth, who can speak Spanish, to translate her instructions to Rosalita, who doesn't know any English.",
      "general": "In a scene between two or more characters, one of them might ask another to translate for them, but they give them \\\"translations\\\" that are so off-the-wall and far from the original meaning that it shocks the other party.\\nCompare My Hovercraft Is Full of Eels, which is when someone trying to speak a foreign language does this accidentally, regardless of whether they're using a translator to do it or not.\\nWhen it happens only to subtitles, that's Fun with Subtitles.\\nSister trope to Translation with an Agenda (and overlaps with it if the translator's agenda is to disrupt negotiations or pick a fight between the two sides).\\nContrast Tactful Translation."
    },
    "name": "Trolling Translator",
    "rdf_element": "TrollingTranslator/int_22133ffc",
    "short_name": "TrollingTranslator",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TrollingTranslator"
  },
  {
    "categories": [
      "LoveTropes"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies: In Brand's case it\\u2019s a girl who happens to be a cheerleader.",
      "general": "In almost no movie or TV show from the USA that has one will you find a male character who finds cheerleaders anything other than a turn-on. This, despite the fact that the cheerleaders are almost universally presented as shallow, bitchy and led by the Alpha Bitch.\\nIt might have something to do with the (greater or lesser) element of sexual titillation in many of the cheers. Beside being a lifesaver for people who hate sports but like girls, a little sexual excitement can boost the transient testosterone of the competitors, or at least remind the crypto-warriors of 'what they're fighting for', as well as who they don't want to be embarrassed in front of...\\nThis is part of the same syndrome that leads to Hollywood Homely. Most American television also banks on the idea their viewing audience may not have gone to college but did go to high school, where cheerleaders were prominent, attractive, and unattainable.\\nIt is worth noting that Reality Is Unrealistic in terms of the girls' outfits. Fictional cheerleaders often perform in uniforms that wouldn't be allowed in a high school. In real life, sleeves are optional, but bellies are covered and skirts are fingertip-length. Not that it really matters, since cheerleaders on screen are usually played by adults anyway.\\nCommonly carries Unfortunate Implications, stereotyping men as brainless and shallow and cheerleaders as slutty.\\nIt should be stressed again that that while cheerleaders are universally seen as sexy in American TV and movies it is by no means a certainty that the male lead will end up with them; indeed they will often be depicted as a vindictive Alpha Bitch or shallow Brainless Beauty who will be dumped in favor of a Girl Next Door, Hollywood Nerd, or Cool Loser.\\nSee also The Cheerleader for how the girl herself is usually portrayed."
    },
    "name": "All Guys Want Cheerleaders",
    "rdf_element": "AllGuysWantCheerleaders/int_22133ffc",
    "short_name": "AllGuysWantCheerleaders",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/AllGuysWantCheerleaders"
  },
  {
    "categories": [
      "Dialogue"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies. While running through trees in the night, Chunk plays this straight and also inverts it.",
      "general": "To contrast Madness Mantra, this is a prayer, koan, or just plain reassuring phrase that gives the speaker peace or confidence, or at least forestalls a panic attack in a dangerous situation.\\nBe advised, reading these entries may or may not actually make you brave... but it is all pretty reassuring!\\nIf it works at a crucial moment, it may be adopted as a Badass Creed; alternatively, characters may use an existing Badass Creed to galvanise themselves in a moment of panic.\\nSee also Madness Mantra. Might be used in a Meditation Powerup. May or may not coincide with a Crowning Moment of Awesome.\\n\\nExamples"
    },
    "name": "Survival Mantra",
    "rdf_element": "SurvivalMantra/int_22133ffc",
    "short_name": "SurvivalMantra",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SurvivalMantra"
  },
  {
    "categories": [
      "ReligionTropes"
    ],
    "descriptions": {
      "TheGoonies": "Chunk in The Goonies.\\n He's also mentioned \\\"old Hannukah decorations\\\" when checking out Mikey's attic, and he's heard reciting Hebrew when his Oh Crap! face shows upon seeing Jake Fratelli in the vehicle he just got down waving down.",
      "general": "This character is Jewish. How do we know?\\nWell, remember when the show did the Christmas Special? And there was that Aesop about diversity and the other holidays in December? And she was shown with a menorah lighting candles? But then again, you never see her observing Passover, or the High Holy Days.\\nFine, but then there was that episode about pork and how she keeps Kosher? Despite the shrimp cocktail and cheeseburger she had for dinner.\\nOK what about her Bat Mitzvah? You know, the characters were confused by the whole thing, and how they learned about her traditions. Which never got mentioned before or since.note\\u00A0 This happens in real life a lot, too.\\nAnd that's the problem. A character who practices Informed Judaism will perform acts that most people can recognize as being Jewish, in contrast to the non-Jewish characters, but they don't show any more subtle signs of Judaism, even for an assimilated Jew, even the cultural aspect. Their Judaism becomes an Informed Attribute. The characters listed on this page are Jewish because the writers tell us, they don't show us, possibly because You Have to Have Jews.\\nThis is a trope that pops up in a number of Western Animation Christmas Episodes; due to the nature of the shows' audience, the powers that be will want to place An Aesop in to show that the characters keep a diverse set of friends or peers. As a result, a character's Judaism is mentioned at some point in the episode, or perhaps a menorah will just be shown in the background, in order to keep up that diverse appearance. After all, who really knows what other religiously affiliated holidays are celebrated by a large enough group of people in the mid to late period of December? This will in fact be the only mention of religion throughout the episode (if not the series) , as Christmas itself (assuming the name is used at all) will not be depicted as having any religious significance, but rather just be a \\\"Warm, Feel Good Time\\\", thus making this revelation of a major character feel shoehorned in. This is also despite the fact that since the Jewish calendar is a lunar one, there is no guarantee that Hannukah and Christmas will in any way overlap: Hannukah could be completely over way before Christmas starts.\\nOf course, there is a place between Informed Judaism and Anvilicious. A character doesn't need to shout \\\"Oy, how meshuggenah, a golem! I'm ferklempt!\\\" to be non-informed Jewish, and likewise, not every character who has a Chanukkah Special is informed. It's more of a gestalt of the sense of the character. Yiddish as a Second Language, for example, can be a clue...though, of course, pushing any element too far lands you back here.\\nThis has an element of Truth in Television: Some Jews in countries where they've been able to assimilate increasingly practice their religion only on the most important holidays (Passover, Rosh Hashanah, and Yom Kippur), and only celebrate Chanukah to have a winter holiday. They don't keep Kosher or observe the Sabbath. A practitioner of Reform or Reconstructionist Judaism \\u2014 quite common in America \\u2014 is especially likely to disregard most forms of Jewish ritual, including the Kosher laws. \\\"Passover and High Holy Days Jews\\\" are the Jewish equivalents of \\\"Christmas-and-Easter Christians.\\\" That said, even many of these still show the cultural aspects of Judaism, often missing from these characters.\\nIt is also true that Jews are not only people who practice Judaism. Generally, in modern secular usage, Jews include three groups: people who were born to a Jewish family regardless of whether or not they follow the religion, those who have some Jewish ancestral background or lineage (sometimes including those who do not have strictly matrilineal descent), and people without any Jewish ancestral background or lineage who have formally converted to Judaism and therefore are followers of the religion. Therefore, someone can be a Jew and no one else would know unless they asked. Many Jews do not do any religious rituals, and some even have Christmas trees (\\\"Chanukkah bush\\\").\\nThis has occasionally sparked controversy, in cases of religious figures in other religions who have explicitly claimed Jewishness via ancestry. A particularly well-known recent example is the late French Cardinal Lustiger, the former archbishop of Paris and a son of Polish Jews (his mother was killed during the Holocaust). He described himself as a \\\"fulfilled Jew\\\" all his life and maintained Jewish customs even as a Roman Catholic clergyman (he was known to recite Kaddish for his mother at a synagogue even after he became a cardinal, for example). Still, he was subject to much criticism by both Jewish and Christian groups.\\nFan Fiction often subjects these characters to extreme Flanderization.\\nIt should be noted that speculating on whether or not someone is really a Jew (if they're patrilineal, a convert, or secular, for example) in real life is a big no-no, especially if the person doing the speculating is themselves not Jewish. There's a reason why this list has no real life examples.\\nContrast Ambiguously Jewish, where a character displays stereotypically Jewish traits, but is never referred to as such; halfway between these two is reality. Compare Raised Catholic, which shares some characteristics with this trope."
    },
    "name": "Informed Judaism",
    "rdf_element": "InformedJudaism/int_22133ffc",
    "short_name": "InformedJudaism",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/InformedJudaism"
  },
  {
    "categories": [
      "ActionAdventureTropes"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies features a Type 1 example:",
      "general": "A gag where an elaborate, high-risk plan is concocted by the good guys, we hear all the planning, and then it never gets past step one. There are three varieties:\\n Instant failure. eg, Once they all know what they're supposed to do, they step out the door and immediately one of them trips over and breaks a leg. This never occurs in shows where the heroes are professionals.\\n Instant discouragement. eg, Once they all know what they're supposed to do, they open the door, notice it's raining and call the whole thing off. This absolutely never occurs in shows where the heroes are professionals.\\n Instant success. eg, The convoluted scheme for breaking into the bad guy's vault becomes redundant when they get there and find the door has been left ajar. This is particularly effective when the instant success is achieved by good old common sense, such as the scene in The Bourne Identity where Matt Damon coaches Franka Potente in how to obtain information from a hotel clerk, and she succeeds just by asking for it. (Compare Cutting the Knot.)\\nSometimes this joke gives itself away by having the plan be too elaborate, too dicey, and explained in too much detail.\\nSubtrope/converse of the Unspoken Plan Guarantee."
    },
    "name": "Impossible Mission Collapse",
    "rdf_element": "ImpossibleMissionCollapse/int_22133ffc",
    "short_name": "ImpossibleMissionCollapse",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ImpossibleMissionCollapse"
  },
  {
    "categories": [
      "MediaAdaptationTropes"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies, penned by James Kahn, has its chapter headings in the forms of summations of the events in each chapter (\\\"...We Stop For Provisions...\\\") and is narrated by Mikey, except for chapter six (\\\"Chunk's Story\\\") which details what happened when Chunk was taken by the Fratellis in his own words.",
      "general": "The counterpart to The Film of the Book: A novelization retells the story of the film in novel form. In some cases this can even go as far as a book based on the film of the book (distinct from just re-releasing the original novel with a film poster slapped on the cover).\\nAt best, the novelization is a faithful rendition of the film's story that takes additional time to explore and explain things the movie didn't have time to do itself (like the inner motivations of the characters, or justification for certain plot holes); at worst, you end up with something that reads like someone copied the film script and added \\\"It Was a Dark and Stormy Night\\\" at the top.\\nNovelizations are also often put together quickly, using an early draft of the film's script so that the author can finish the writing and have the book published to tie in with the movie's theatrical release; this incurs a very real risk that the copy of the script the author was working from may differ substantially from the final script used in filming (this happened with Chris Claremont's X2: X-Men United novelization, amongst many others). If the movie winds up having its release delayed, the book might be in something of a no man's land when it comes to sales, while the film itself is potentially spoiled by anyone who reads the novel (which happened to Penelope). On the other hand, sometimes the book is better than the movie, especially if the movie wasn't great in the first place.\\nMany of these novels are ghostwritten or with the authors writing under pen names, with some having written quite a few of them under a variety of different aliases.\\nThe novelization is not exclusive to film; episodes of popular television shows may be novelized as well (for example, almost all of the Doctor Who original series serials were novelized), as can Comic Book Story Arcs, and even video games (usually ones with strong narrative elements, like RPGs). These vary from Expanded Universe material to complete bastardizations that only bear the name of the original.\\nSee also Tie-In Novel."
    },
    "name": "Novelization",
    "rdf_element": "Novelization/int_22133ffc",
    "short_name": "Novelization",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/Novelization"
  },
  {
    "categories": [
      "ImagesWithoutASource"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies featured a grotesque Gentle Giant named Sloth held in the basement of an abandoned restaurant where the bad guys were staying.",
      "general": "Let's face it. The darkness is scary. Even if you aren't terrified of it by itself, it can sometimes give you a horrible feeling that you're Being Watched, because you just can't see if there's something there. Children everywhere feel nervous about the closet or the space under the bed, but while those little bits of darkness are unnerving, there is a place yet creepier. A room where the darkness is the color of pitch, with no little lights anywhere, where even standing still and waiting for your eyes to adjust doesn't help. That room, home of the really, really really scary dark, is the basement.\\nPerhaps it's the fact that most basements are built into the ground, or how the dank, sparsely furnished ones seem horribly reminiscent of some kind of tomb or prison. And those spiders that like to hang out in the cracks and corners spinning their sticky transparent webs probably don't help much.\\nIt should be noted that for a lot of people, this trope is Truth in Television. Although, nothing impedes a houseowner from averting the trope entirely by making the basement a clean, well-lit and light-hued living area, even with ground-level windows for natural illumination. Many bedrooms are done that way, in fact.\\nSee also Torture Cellar. If there's a monster locked down there, see Madwoman in the Attic or Room Full of Zombies."
    },
    "name": "Creepy Basement",
    "rdf_element": "CreepyBasement/int_22133ffc",
    "short_name": "CreepyBasement",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/CreepyBasement"
  },
  {
    "categories": [
      "Plots"
    ],
    "descriptions": {
      "TheGoonies": "The plot of The Goonies was set into motion by the children trying to find a lost treasure in order to save their neighborhood from evil developers.",
      "general": "A heartless developer plans to buy out and then knock over the local Orphanage of Love because they haven't paid their bills in ages. Despite the horrible fate awaiting the adorable ragamuffin orphans and their caretakers, it seems all hope is lost. Enter the hero, who will embark upon a quest to gather the necessary funds...or at least stop the developer from being able to knock the place down.\\nThis trope serves a a popular stock plot for a number of reasons. It's a simple enough goal for the audience to grasp and support, plus it's a pretty easy way to establish a black and white good vs. evil theme. After all, who but a truly good person would devote their time and welfare to saving an orphanage that can't offer much in the way of reward but its gratitude? And who but a truly evil person would dump a bunch of orphans onto the street so they can build a parking lot over it?\\nPlus, since there's a number of ways to reach this goal, you can pretty much insert any kind of film into it. Want a funny Road Movie? Just have the Hero hop into his van with his quirky sidekick and drive cross-country to pay the rent. Need to sell a soundtrack or musical? Have the centerpiece of the film be a fundraiser concert. Want a Downer Ending drama which explores the good and evil of mankind? Just have the heroes fail and watch the orphans cry their eyes out as their only chance at a loving home gets demolished before their eyes.\\nThis plot doesn't have to center around an orphanage. Another popular variant is saving a family farm, followed closely by a youth or community center. Really though, as long as the building has someone's welfare tied up into it, there's probably an evil developer lurking in the shadows and planning its demise.\\nFurthermore, those wily developers don't always need cash. Sometimes, saving the orphanage may require a fight to claim the deed to the building or land, or a battle over a will.\\nCompare the Childhood Memory Demolition Team where the structure being knocked down isn't necessarily going to result in catastrophic circumstances for anyone."
    },
    "name": "Saving the Orphanage",
    "rdf_element": "SavingTheOrphanage/int_22133ffc",
    "short_name": "SavingTheOrphanage",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SavingTheOrphanage"
  },
  {
    "categories": [
      "GunsAndGunplayTropes"
    ],
    "descriptions": {
      "TheGoonies": "Lampshaded in The Goonies.",
      "general": "In a typical movie or video game, the sound of a gun firing is impossible to mistake for anything else; a distinctive booming report with lots of bass accompanies the firing of even the most puny weapon, unless fitted with a magic noise-removing machine.\\nIn reality, this boom is closer to the sound of a shotgun firing. Smaller guns typically lack the howitzer-like boom of the movie versions, instead making a sound similar to a firecracker going off. This means when hearing a real gunshot, many people find it hard to tell that's what it is.\\nThis is not to say gunshots are not loud; quite the opposite, a gunshot is the loudest normal sound a human being is likely to hear, which is why ear protectors are mandatory in firing ranges. Hollywood gunshots are usually much too quiet relative to other sounds, with a character in one scene able to shout as loud as a shotgun blast in another. This is really an Acceptable Break from Reality; most shooting enthusiasts will suffer from some degree of sound-induced hearing loss due to their hobby, and movie sound systems typically aren't designed to output noise above the human pain threshold anyway. Therefore we are given standard sounds that represent gunfire.\\nCharacters in fiction never seem to flinch or be in pain from the sound of gunshots, even when firing fully automatic weapons in confined spaces. People on TV never experience tinnitus or hearing loss, even temporarily. TV characters have the ability to fire their weapons and also hear tiny noises or whispers at the same time.\\nGunfire sound effects may also be exploited for other dramatic purposes, most notably a tendency to assign distinctive \\\"good guy\\\" and \\\"bad guy\\\" sounds, akin to Sound-Coded for Your Convenience. Sometimes directors will even assign a distinctive-sounding gunshot effect to a specific character, (as in the Indiana Jones examples below) in order to emphasize their heroic, villainous, or badass nature.\\nIf a gun makes way too much noise when it isn't being fired, that's Noisy Guns, or Dramatic Gun Cock when done on purpose. See also Blown Across the Room for exaggeration of the results of gunfire. For when fistfights are louder than they should be, see Kung-Foley.\\n(Probably) Not related to the Armchair Cynics song.\\nNot to be confused with More Dakka, although the two naturally go well together."
    },
    "name": "Bang, Bang, BANG",
    "rdf_element": "BangBangBANG/int_22133ffc",
    "short_name": "BangBangBANG",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/BangBangBANG"
  },
  {
    "categories": [
      "OlderThanDirt"
    ],
    "descriptions": {
      "TheGoonies": "Mikey in The Goonies has a heart-to-ribcage chat with the skeletal remains of One-Eyed Willie.",
      "general": "The mundane equivalent to Dead Person Conversation, a Sub-Trope of Surrogate Soliloquy. A character addresses a dead person, not expecting a response, not getting one \\u2014 at least, not an unequivocal one. Can be spoken to the corpse, the coffin, the grave \\u2014 or to thin air. (If the body is present, often Peaceful in Death is in play.)\\nUbiquitous in Japanese media; it is believed in Japan that unless the living keep the memories of their near and dear ones alive by talking to them, their spirits will disappear into oblivion. Thus a manga or anime character chatting about everyday things with a picture of their dead parents or sibling is not a sign of losing it.\\nLibation for the Dead may involve this. For some reason, I Gave My Word is actually particularly binding in this situation (generally for Best Served Cold).\\nDoes not, of course, preclude the dead person's not actually being dead, but does require that the character believe the person to be dead. (Please Wake Up does not fall under this.)\\nSymbolic or ambiguous apparent messages from the dead start to edge this into Dead Person Conversation.\\nCompare Converse with the Unconscious. Motives may be similar."
    },
    "name": "Talking to the Dead",
    "rdf_element": "TalkingToTheDead/int_22133ffc",
    "short_name": "TalkingToTheDead",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TalkingToTheDead"
  },
  {
    "categories": [
      "LawsAndFormulas"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies: People are more likely to assume \\\"Hey you guys!\\\" is from this film rather than The Electric Company.",
      "general": "When a parody of a particular work remains popular after the original work becomes forgotten in popular consciousness.\\nNamed for the fact that, when listening to the earlier work of \\\"Weird Al\\\" Yankovic, modern fans may be so unfamiliar with the songs being mocked as to not even realize that the Weird Al's song is a parody. For example, many people are now more familiar with \\\"I Lost on Jeopardy\\\" than with the original \\\"Jeopardy\\\" by the Greg Kihn Band (or even the original game show from the sixties). Some may even have forgotten Jimmy Webbs \\\"MacArthur Park,\\\" or Coolio's \\\"Gangsta's Paradise\\\" (or Stevie Wonder's \\\"Pastime Paradise,\\\" for that matter), remembering only Weird Al's \\\"Jurassic Park\\\" or \\\"Amish Paradise.\\\"note\\u00A0Given that \\\"MacArthur Park\\\" handily won Dave Barry's epic Bad Song survey, this is probably a fortunate thing for the people who don't know of the original.\\nOften, people who are only 'familiar' with a work through the parody are surprised when the subject of the parody turns out to be better than they thought.\\nRelated to the concept of a Forgotten Trope, except it is not tropes but works or personalities that have been forgotten. Could be an extreme expression of Rule of Funny (the music may not have had much staying power, but at least the parody is funny). See also Adaptation Displacement, Popcultural Osmosis, Popcultural Osmosis Failure, Older Than They Think, The Coconut Effect, Covered Up and Revival by Commercialization."
    },
    "name": "\\\"Weird Al\\\" Effect",
    "rdf_element": "WeirdAlEffect/int_22133ffc",
    "short_name": "WeirdAlEffect",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/WeirdAlEffect"
  },
  {
    "categories": [],
    "descriptions": {
      "TheGoonies": "The Goonies: Mikey being kissed accidentally by Andy in a cave while Stephanie is watching. Then Mikey walks dizzy afterwards.",
      "general": "You think True Love's Kiss is impressive? Hah, all that kiss can do is wake someone up. The most powerful kiss does the opposite: sending a person into a stiff, rigid, frozen state of shock, unable to move, talk, comprehend their surroundings, or remember their own name. Kiss-induced shock is severe enough that a Colony Drop cannot snap them out of it. The condition can last anywhere from 24 seconds to 24 hours after the kiss, during which time they can expect to see lots of imaginary fireworks. An Accidental Kiss or First Kiss will exacerbate the symptoms.\\nThis affliction overwhelmingly favors males.\\nNot to be confused with Kiss of Death.\\n\\nExamples"
    },
    "name": "Post-Kiss Catatonia",
    "rdf_element": "PostKissCatatonia/int_22133ffc",
    "short_name": "PostKissCatatonia",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/PostKissCatatonia"
  },
  {
    "categories": [
      "ComedyTropes"
    ],
    "descriptions": {
      "TheGoonies": "Subverted in The Goonies; after Stephanie and Andrea step on the rake it doesn't hit them in the face but pops up with a fish head on the other end.",
      "general": "Common in cartoons, an innocuous-looking rake (or hoe, or shovel...) is lying on the ground. A character steps on it the wrong way and gets a face full of the stick part. Ouch.\\nObviously Truth in Television for anyone who tried that. In real life, however, it usually results in a nosebleed or, if bad enough, a trip to the emergency room - Looney Tunes jokes notwithstanding. And if an actual rake fails to rise and smack you, it may instead hurt your foot and/or break the rake.\\nSee also Amusing Injuries."
    },
    "name": "Rake Take",
    "rdf_element": "RakeTake/int_22133ffc",
    "short_name": "RakeTake",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/RakeTake"
  },
  {
    "categories": [],
    "descriptions": {
      "TheGoonies": "In The Goonies, a highschool bully drives up next to Brandon who is riding a little girl's bike (long story), grabs his hand, and attempts to drag him along before sending him over a cliff. Somehow he survives.",
      "general": "Often in media, The Bully is portrayed as a typical Jerkass who's biggest threat to their victim is a wedgie or fist in the face. Aside from that, they are mostly harmless in the grand scheme of things. Bully Brutality takes the typical bully Up to Eleven by having him do things that could actually kill their victim, even though the bully doesn't actually want to commit murder. Where the typical bully just wants to give their victim a black eye, the brutal bully wants to beat them to a bloody pulp. The fact that the bully is capable of inflicting such harm is usually lampshaded by the characters. Other times, it becomes clear that these bullies have no limits.\\nDo not confuse this with cases where bullying has led to the victim committing suicide, that's just a specific case of Driven to Suicide. This trope is where the bullying itself has reached levels that the bully has committed manslaughter, or come close to it by landing the victim in hospital or leaving them permanently disabled.\\nRelated to Teens Are Monsters. Compare No-Holds-Barred Beatdown, a common weapon in the bully's arsenal for this trope. Contrast with School Bullying Is Harmless. This is Truth in Television since there are countless Real Life examples of kids being bullied to death."
    },
    "name": "Bully Brutality",
    "rdf_element": "BullyBrutality/int_22133ffc",
    "short_name": "BullyBrutality",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/BullyBrutality"
  },
  {
    "categories": [
      "StockPhrases"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies: At a critical moment, the kids have a chance to escape from the dangerous treasure hunt but Mikey wants to continue. An argument starts between Andi and Mikey and eventually leads to Mikey's Rousing Speech.",
      "general": "During a tense situation, the protagonist starts berating himself: \\\"I'm useless! It'd be better if I didn't exist!\\\" then \\u2014 SLAP! The older-sister type (usually a Tsundere) tells him to get a hold of himself and yells, \\\"Don't say such stupid things!\\\"\\nShe gives a speech about the people who love him, the reasons he really is important, and so on. This always seems to be just what he needs to gain the confidence to resolve the story.\\nIf the title sounds dorky, it's because it's mirror-translated from Japanese (\\u99AC\\u9E7F\\u306A\\u3053\\u3068\\u3092\\u8A00\\u3046\\u306A, \\\"bakana koto o iu na\\\"). A more natural translation would be along the lines of \\\"Don't be an idiot!\\\"\\nIf it's the forces of the universe telling a character this, it can result in It's a Wonderful Plot. For the softer version, see You Are Better Than You Think You Are.\\n\\nExamples"
    },
    "name": "Don't Say Such Stupid Things",
    "rdf_element": "DontSaySuchStupidThings/int_22133ffc",
    "short_name": "DontSaySuchStupidThings",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/DontSaySuchStupidThings"
  },
  {
    "categories": [
      "CharactersAsDevice"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies was like Malapropers Gone Wild!, what with Data and his \\\"booty traps\\\" and Mikey \\\"I guess we're in big shit now right?\\\" Walsh, who definitely inherited it from his mom.",
      "general": "The distinguishing characteristic of the Malaproper is that they constantly replace words with similar-sounding but wrong ones. A common form of this is for the Malaproper to mangle proverbs, idioms, and other figures of speech. They may use overly complicated synonyms that make them sound wrong; e.g., \\\"The cat's out of the bag\\\" becomes \\\"The feline has been released from the sack!\\\" Alternatively, they may use words that sound almost right \\u2014 \\\"Let's get this shoe on the toad!\\\" for \\\"Let's get this show on the road!\\\" They may also nonsensically combined figures of speech (\\\"You can't cross the same river without breaking a few eggs\\\"). (See Mixed Metaphor.) This character will sometimes be corrected, not that this does any good.\\nThe term \\\"malaproper\\\" comes from \\\"malapropism,\\\" which, in turn, is derived from malapropos, an adjective or adverb meaning \\\"inappropriate\\\" or \\\"inappropriately\\\". However, it's more typically attributed to Mrs. Malaprop, a character from the 1775 play The Rivals by Richard Brinsley Sheridan. Given that Mrs. Malaprop's name and character were based on the idea of making malapropos statements, it's a chicken and egg matter.\\n(Although the trope can be found in earlier works - for instance, it is also exemplified by Sergeant Dogberry in Shakespeare's Much Ado About Nothing.)\\nInjuries to certain parts of the brain can produce aphasia, loss of speech or speech impediment. Damage to Broca's Area can cause a complete inability to form words at all, while damage to Wernicke's Area can produce complete loss of comprehensible speech (the words come out okay but don't mean anything in relation to each other). This is one cause of malapropism. That and liquor. Another very rare condition \\u2014 proxyglossoriasis \\u2014 (according to the Duckman television show) has the sufferer replace the intended word with a nearby word in the dictionary. The effect is often hysterical.\\nOften used by those speaking Poirot Speak. Can also be used to indicate one who is Raised by Wolves, an Alien Speaking English, or else a Cloudcuckoolander, whose sense of reality isn't affected (or effected, as the case may be) by actual reality. May be used to set up an Expospeak Gag.\\nCompare and contrast with Delusions of Eloquence, Blunt Metaphors Trauma, and My Hovercraft Is Full of Eels. Compare and contrast also with the Spoonerism, where the first letter or syllable is transposed for comedy effect. If the speaker uses the apparently correct words instead but gets hopelessly lost in their train of thought, that's Metaphorgotten. If using the wrong word is the result of mishearing the correct word, that's a Mondegreen.\\nSee here for a self-demonstrating version of this page."
    },
    "name": "Malaproper",
    "rdf_element": "Malaproper/int_22133ffc",
    "short_name": "Malaproper",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/Malaproper"
  },
  {
    "categories": [
      "SeatedTropes"
    ],
    "descriptions": {
      "TheGoonies": "Exploding toilets in the country club during one scene in The Goonies.",
      "general": "When you gotta go, you gotta go, and everybody's gotta go sometime, so what better time to make someone take their final exit than waiting for them to evacuate?\\nWhat's that? Needlessly cryptic? Fine. Let us spell it out: If you want to kill somebody, wait until they go to the bathroom.\\nWhile this seems like a comedy trope, it's used in horror films, too... presumably because of the inherent vulnerability of a person using the toilet.\\nIf the toilet is used for the kill, then The Can Kicked Him; either way, it's an Undignified Death. If the \\\"attack\\\" is a relatively harmless prank, see Swirlie. Related to Searching the Stalls."
    },
    "name": "Camping a Crapper",
    "rdf_element": "CampingACrapper/int_22133ffc",
    "short_name": "CampingACrapper",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/CampingACrapper"
  },
  {
    "categories": [
      "MoneyTropes"
    ],
    "descriptions": {
      "TheGoonies": "The pirate ship full of treasure in The Goonies.",
      "general": "A staple of role playing games, video games, movies, TV, and wherever stories are told. A big room full of treasure... money, gold and jewels. Usually not organized very well, it's all just piled in together like an episode of Hoarders: Filthy Rich Edition. Often the McGuffin. Often trapped or guarded by a monstrous beast, most frequently a dragon. Often a cause of Laser-Guided Karma due to all the Death by Materialism. Sometimes The Hero might get all of it, but generally they only manage a choice piece or two, if anything. In many scenarios there will be some sort of cave-in, massive flood, or other such death trap which will inevitably chase the hero/heroes out. And since it would only take a few days or maybe a week to dig it back out, the treasure is clearly Lost Forever. Apparently adventurers have never heard of modern excavation equipment.\\nMay overlap with Pooled Funds or Dragon Hoard. See also City of Gold."
    },
    "name": "Treasure Room",
    "rdf_element": "TreasureRoom/int_22133ffc",
    "short_name": "TreasureRoom",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TreasureRoom"
  },
  {
    "categories": [
      "StockPhrases"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies. Stef barks this at Andi when she hits the wrong notes on the musical lock, causing part of the floor to collapse.",
      "general": "The inevitable question asked when another character's rash plan or reckless behavior results in disaster or near-disaster. Asked upon discovery of the mayhem caused by said recklessness, or after picking up the pieces, and is usually asked by their superior, a concerned parent, or simply a friend or ally.\\nPopular answers include \\\"I wasn't!\\\", \\\"I don't know!\\\", \\\"It Seemed Like a Good Idea at the Time!\\\", and \\\"I Did What I Had to Do.\\\" If someone answers \\\"For Science!!\\\" it's a good bet that he's a lost cause.\\nCan follow a My God, What Have I Done? for a Kick the Dog moment. A Deal with the Devil is almost always followed by this, if only from the audience. Not to be confused with What the Hell, Hero?, which has less to do with recklessness and more to do with kicking or shooting the dog, though it can overlap. If someone is asking himself (or herself) this, it's Didn't Think This Through.\\nCompare What an Idiot and What the Hell, Hero?."
    },
    "name": "What Were You Thinking?",
    "rdf_element": "WhatWereYouThinking/int_22133ffc",
    "short_name": "WhatWereYouThinking",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/WhatWereYouThinking"
  },
  {
    "categories": [
      "UhOhEyes"
    ],
    "descriptions": {
      "TheGoonies": "This trope is partially used in The Goonies when the Goonies discover the lost pirate ship, and Mikie finally finds the skeletal remains of One Eyed Willy, the ship's former captain, still sitting in a chair. Curiosity leads Mikie to lift up Willy's eyepatch, and he is visibly spooked by the discovery that One Eyed Willy didn't earn his nickname by way of any injury, but rather by way of never having a left eye in the first place. There was no eye socket where it should have been.",
      "general": "Imagine you're drawing a face. You draw an oval, perhaps a jutting chin, some ruffled hair. Give him (or her, it doesn't matter) ears and a nose and a nice big smile. And then stop.\\nWhat does it look like? Well, not human, that's for sure. Without eyes (even just the sockets), our faces are unrecognizable and unreal. Without eyes, how can we see? More importantly, we as human beings normally use eye contact to connect with others on an emotional level (with a few exceptions). It is said that eyes are windows to the soul, so intuitively it is impossible to connect with something/someone that has no eyes.\\nCreatures without eyes can be downright creepy, let's face it. Seeing a Faceless Eye chasing you is scary, sure, but seeing an Eyeless Face is usually more scary, since it looks so close to human but there's something not quite human about it.\\nCompare with Hidden Eyes, which is a temporary, metaphorical implementation of this. Contrast Extra Eyes, where the character in question has too many eyes. Related to The Blank. And if something doesn't have eyes on their face, they may have them somewhere else. Not to be confused with Youngblood's disease. Justified if Bizarre Alien Senses are used in place of vision.\\n\\nExamples"
    },
    "name": "Eyeless Face",
    "rdf_element": "EyelessFace/int_22133ffc",
    "short_name": "EyelessFace",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/EyelessFace"
  },
  {
    "categories": [
      "ComedyTropes"
    ],
    "descriptions": {
      "TheGoonies": "While attending UC Berkeley, Jeff Cohen, who played Chunk in The Goonies, became student body president, using \\\"Chunk for president!\\\" as his campaign slogan, and would also do the \\\"Truffle Shuffle\\\" at home games, even though he had lost weight as an adult.",
      "general": "Some actors get reputations that just won't go away. Maybe they're famous for being divas on the set. Maybe they're famous for only playing certain roles \\u2014 or even worse, only playing one role. Nobody will let them forget it. They can struggle mightily to earn a new reputation as decent people who can play a variety of roles.\\nOr they can resign themselves to their fate, and make a career out of it by Adam Westing.\\nAdam Westing is a form of Self-Parody where actors play either themselves, or a Captain Ersatz of themselves, or a Captain Ersatz of their most famous role, and they play it as a total Jerkass, a total idiot, or both. More rarely, they play the character as the exact opposite of what they're most famous for, but still a Jerkass and an idiot.\\nWhile this can be an Affectionate Parody, it can also be a way for the actor to vent their spleen against a part that got old fast and/or ruined their career, until it amounts to a Take That against themselves. Particularly bitter actors will make The Parody a Deconstruction of their old part, explaining how it was a horrible role and nobody should watch it. Like all Deconstruction, this can come full circle, with the actor doing a Reconstruction Self-Parody. Sure, the role was stupid, but they enjoyed it.\\nCompare closely to the use of Meta Casting, where this can be turned around and made impressionable by playing off this personality. Adam Westing is most often found among actors who have had certain forms of Type Casting:\\n Actors who had to act goofy all the time and never got a chance for serious work. If they must be goofy, let it be in mocking goofiness.\\n Actors known for an incredibly hammy or Badass persona, and people expect them to play the same over-the-top role in everything.\\n Actors who had to act dreadfully serious all the time, until it was impossible not to laugh at their own work.\\n Actors who had been subjected to Contractual Purity, who couldn't so much as have a glass of wine in public and need to cut loose.\\nSee also The Danza, where the character's name is clearly taken from the actor/actress portraying him/her. See also Parody Assistance, when the actor works on a parody of whatever show/film/etc. made them famous. Very closely related to Playing with Character Type, which is when a typecast actor takes on a role superficially similar to their \\\"type\\\" in order to subvert, deconstruct or otherwise play with it.\\nCompare to Self-Deprecation."
    },
    "name": "Adam Westing",
    "rdf_element": "AdamWesting/int_22133ffc",
    "short_name": "AdamWesting",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/AdamWesting"
  },
  {
    "categories": [
      "StockPhrases"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies loves this. \\\"Oh my God\\\" is stated 17 times, spoken by 7 characters. Some of the more drawn out ones include:\\n Mikey and Chunk when Chunk breaks the small statue of David.\\n Brand when he's about to fly off the road at high speed on a child-sized bicycle.\\n Stef and Andi when they step on the rake.\\n Mouth and Stef when they spot the pirate ship for the first time.\\n Mama Fratelli when Mouth spits out all the jewels he was hiding.\\n And finally topped off by the sheriff with \\\"Holy Mary, mother of God\\\" when he sees the pirate ship sailing off at the end.",
      "general": "Sometimes, an astonished someone just has to scream: \\\"OH MY GOD!!!\\\"\\nAnime that use this as Gratuitous English are always strange because they enunciate it like a Valley Girl \\u2014 but they obviously intended the less... silly version.\\nNote that the Big OMG in more intimate situations has its own trope.\\nRarely does their god answer, no matter how loud they shout.\\nCompare Big \\\"NO!\\\", Big \\\"WHAT?!\\\", Big \\\"WHY?!\\\", Big Word Shout, Say My Name."
    },
    "name": "Big \\\"OMG!\\\"",
    "rdf_element": "BigOMG/int_22133ffc",
    "short_name": "BigOMG",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/BigOMG"
  },
  {
    "categories": [
      "OlderThanDirt"
    ],
    "descriptions": {
      "TheGoonies": "\\\"Goonies never say die!\\\"",
      "general": "Certain concepts considered \\\"too sensitive\\\" are only ever referred to by euphemisms.\\nThe most common example is euphemisms for death in children's shows, even in cases where a character is killed and they are rendered dead, the script will never use those two words. Almost always, the writers don't even get very creative with poetic descriptions, and will apply basic synonyms of \\\"destroyed\\\" to living things that we usually associate with inanimate objects, or have the characters unable to finish their sentences (\\\"Is he...?\\\"). Hell is also constantly neutered; when the plot absolutely needs something similar, they often resort to calling them \\\"Nether-something\\\" (of course, except for the Netherlands, aka Holland).\\nAnother frequent method is to hastily add dialogue that suggests the people we've just indirectly seen killed didn't really die, e.g. showing a city being destroyed, and having a character note: \\\"Good thing everyone in that city evacuated at the last minute!\\\"\\nFor one reason or another, children's shows also shy away from using \\\"God.\\\" Whenever religion comes into play, it is generally replaced with something along the lines of \\\"the big guy\\\". This one also has its roots in ancient tradition: in Judaism, it is considered blasphemous to use any of God's various actual names except in specific prayers, so His titles (\\\"God\\\" is considered a title; also \\\"the Lord\\\", \\\"the Name\\\", etc) are used instead, Jews can't say or write their God's real name that is Jehovah so there is no in numerology the 15 or 16 letters.\\nWords such as Damn and Hell will likely be replaced by \\\"Dang it!\\\" while Hell is replaced by underworld or Hades and so on.\\nIt should be noted that one likely reason for this trope is because the writers and producers seem to think that their target demographic is too immature to grasp the concept of somebody dying, or alternatively will be horribly traumatised - rationales that in fact cancel each other out. Some people reason that the belief that since children may not be able to understand death they should be subjected to a villain who plans to destroy them, insults and desensitizes everybody.\\nOne major exception is the verboseness of a Big Bad usually makes the trope work for him.\\nAlso note that just because a character didn't mention any variation of \\\"dead\\\", \\\"die\\\" or \\\"death\\\", that doesn't automatically make it an example of this trope. Saying something like \\\"It's time to smash you into pieces!\\\" isn't this trope. Saying \\\"It's time to defeat you!\\\" is, because \\\"defeat\\\" is directly used in replacement of \\\"kill\\\". \\\"Smash you into pieces\\\" is used for specific wording emphasis. This is not a trope for every single examples where a villain uses wording to do with something other than death when confronting the hero, or vice-versa.\\nIt should be noted also, that this isn't for examples in which a show has a character being \\\"taken away\\\" instead of killed. If the character really was taken away, then it's not an example of this trope. If the character was obviously killed but instead they refer to their death with \\\"they were taken away\\\", of if a certain version of something changes a character's death scene so they never died, then it is an example.\\nThis isn't for complaining about scenes where a character was \\\"killed off the show\\\" in a way other than death.\\nPlease note as well, that this also isn't for complaining about examples where a disaster of some kind resulted in no deaths. If said disaster is something where it's insane to think that no one got injured at all, then it's an example. If it's a disaster in which no one getting killed isn't an unreasonable occurrence, then it is not.\\nThis is sometimes Played for Laughs when what seems to be a euphemism is in fact a Literal Metaphor \\u2014 \\\"Grandma's gone to a better place; I hope she enjoys her Caribbean cruise\\\" \\u2014 causing people to mistakenly believe the person died; in those cases they're No Longer with Us.\\nUsually a form of Executive Meddling. Compare with: Gosh Dang It to Heck!, Unusual Euphemism, Frothy Mugs of Water, The Disease That Shall Not Be Named and No Endor Holocaust. Coming closer and closer to becoming a Discredited Trope. When used as an actual in-world element, it's Double Speak or a Deadly Euphemism. Contrast Try Not to Die. Often, but not always, foisted on the Badbutt, who will instead use words like \\\"toast\\\" or \\\"beat.\\\" If they're allowed to say \\\"kill\\\" and \\\"die\\\" but aren't allowed to actually kill characters, then it's Nobody Can Die. If you're looking for a character who never says die \\u2014 who never quits and won't back down even in the face of death \\u2014 then it's Determinator.\\nBut please note as well that just because 'defeated' or 'eliminated' is used in replace of \\\"killed\\\", or \\\"they were...taken from us...\\\" is used instead of \\\"they were...killed\\\", it doesn't make it an example of this trope either. Sometimes alternatives are used because they sound flashier, have a better impact, or because the enemies really do just get \\\"defeated\\\" and fade away. After all, the creators often don't want their characters coming off as cold-blooded killers. This is for examples in which it is obviously censors due to the fact that they don't want to mention death. Any other form of replacing death with anything else does NOT count as this trope.\\nIf you're looking for the album Never Say Die, go here."
    },
    "name": "Never Say \\\"Die\\\"",
    "rdf_element": "NeverSayDie/int_22133ffc",
    "short_name": "NeverSayDie",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/NeverSayDie"
  },
  {
    "categories": [
      "FriendshipTropes"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies: Chunk befriends Sloth with a Baby Ruth.",
      "general": "Two characters who come from very different places meet for the first time. They don't speak the same language? They have totally different backgrounds? No matter how different their culture and origins, they will always become friends if they go through an almost ritual exchange of food the first time they meet - doubly so if the food is chocolate based.\\nTruth in Television: it's considered good manners in many cultures to offer food to people when you meet them, and sharing bread or salt created a real bond between people in the olden days. Several languages even have words for \\\"friend\\\" based around the concept of sharing bread. There's actually scientific evidence to back this cultural practice up, as the part of the brain that responds to food is the same part that responds to social interaction.\\nThe trope generally occurs when the hero is in a Fish out of Water situation, and very often when they meet a character whose language they can't understand. After sharing food, the character helps them become familiar with their surroundings."
    },
    "name": "Tastes Like Friendship",
    "rdf_element": "TastesLikeFriendship/int_22133ffc",
    "short_name": "TastesLikeFriendship",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TastesLikeFriendship"
  },
  {
    "categories": [
      "CharactersAsDevice"
    ],
    "descriptions": {
      "TheGoonies": "Mikey (and his friends) is this to Brand in The Goonies. Their mother charges Brand with keeping an eye on Mikey during the day, which he's none too thrilled about. Mikey and co. escape by tying Brand to a chair and then he has to track them down. Mikey also accidentally steals Andi's First Kiss from Brand. A bit of a subversion as Mikey is the protagonist.",
      "general": "The Annoying Younger Sibling is often used by writers as a balance to the \\\"coolness\\\" of the main protagonist. Typically the opposite sex of the main character.\\nLittle brothers tend to be: dirty, good at sports, noisy, foul-mouthed, always get in trouble with authority, perverted, and just about always grabby when they see something their older sibling has that they don't, who will probably shriek \\\"gimme gimme\\\" and break it if they get their mitts on said object. Usually a Bratty Half-Pint.\\nYounger sisters are usually: whiny, cry to get what they want, too curious, go headlong into real danger, ALWAYS have tea parties with dolls and one \\\"real\\\" participant, cheeky, nosy. Likely to be a Bratty Teenage Daughter if older than the standard.\\nAlternatively, it may be that the younger sibling in question has none of the above attributes, but incurs the wrath of the main characters in equal measure by being cleverer than they are, or by getting a disproportionate amount of (inevitably positive) attention.\\nAnnoying younger siblings of both genders tend to be tag-alongs, especially when they're not wanted. Typically, there will be something of an age gap between the protagonist and the annoying younger sibling, about three to six years in general. Too much of a gap and the sibling will lack the resources to be annoying enough. Too close and you're into Sibling Rivalry territory instead.\\nNote that this trope is for younger siblings who are annoying to the other characters, not to the audience.\\nTruth in Television, obviously.\\n\\nExamples"
    },
    "name": "Annoying Younger Sibling",
    "rdf_element": "AnnoyingYoungerSibling/int_22133ffc",
    "short_name": "AnnoyingYoungerSibling",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/AnnoyingYoungerSibling"
  },
  {
    "categories": [
      "HealingAndCuringTropes"
    ],
    "descriptions": {
      "TheGoonies": "Mikey from The Goonies throws away his inhaler at the end, having apparently defeated asthma through life experience.",
      "general": "A character who has been disabled for an extended period, often physically or visually, suddenly regains the use of their disabled organ.\\nExplanations for this tend to fall into five varieties:\\n 1. The character can override the disability through Heroic Willpower. This is most believable if it's a short-lived emergency override of a disability that makes normal physical activity very painful and difficult, but not outright impossible.\\n 1a. The disability was psychosomatic in the first place, so Heroic Willpower was all that was ever needed to cure it.\\n 2. The disability was temporary, and rest and/or medical treatment have healed it in time for the plot-relevant moment.\\n 3. The character was only feigning the disability in the first place.\\n 4. The otherwise incurable disability was miraculously cured through Divine Intervention or by Applied Phlebotinum.\\n 5. The disability could just disappear for no reason at all, possibly as a Retcon or as Canon Discontinuity.\\nSee also Artificial Limbs, Beautiful All Along."
    },
    "name": "Throwing Off the Disability",
    "rdf_element": "ThrowingOffTheDisability/int_22133ffc",
    "short_name": "ThrowingOffTheDisability",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ThrowingOffTheDisability"
  },
  {
    "categories": [
      "TelevisionIsTryingToKillUs"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies: After Mikey sees Sloth in the Fratellis' restaurant and runs upstairs, an angry Brandon picks him up and carries him outside over his shoulder.",
      "general": "Over-the-shoulder carrying (abbreviated OTS) is a method to transport another person. The person is laid face down over one's shoulder with their upper body to the rear. The person's legs are held at the hollow of the knees to secure them. This position allows for relatively easy transportation, even if they are the same weight as oneself. It can be a humiliating pose for the person being carried, since they're turned into a passive object, with their face down and buttocks pointing up and to the front.\\nWhen this happens in fiction, usually (but not always), it involves an antagonist carrying a Damsel in Distress or other captive that he/she has caught or subdued. Contrast Bridal Carry, which is more romanticized and typically involves The Hero saving someone instead of capturing them. Compare Neck Lift and Hoist Hero Over Head, which are other ways a villain shows of their strength by lifting up a victim.\\nSometimes called the Fireman's carry, although this is actually the name for another position where weight is supported on both shoulders and the carried person is held by both legs and whichever arm is draped over the carrier's shoulder.\\nNote that this position (as well as the Fireman's Carry) is often recommended against - it tends to worsen any spinal injuries sustained, and can asphyxiate people in a burning building."
    },
    "name": "Over-the-Shoulder Carry",
    "rdf_element": "OverTheShoulderCarry/int_22133ffc",
    "short_name": "OverTheShoulderCarry",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/OverTheShoulderCarry"
  },
  {
    "categories": [
      "Dialogue"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies had Chunk get away from the Fratelli's and find a phone. Unfortunately, he's cried wolf before.",
      "general": "Say a character finds out about a paranormal phenomenon, or a sinister conspiracy. There wouldn't be much of a plot left if they could just call the police and let them take care of it.\\nIn these cases, heroes will simply talk like stereotypical portrayals of paranoid schizophrenics.\\n They will continually repeat a bizarre claim in a panicked voice.\\n They will avoid mentioning what led them to believe it in the first place.\\n They will never consider sticking to the provable parts of the story for the time being.\\n Most important, they will be stunned and angry that anyone would find their claim implausible, regardless of how implausible it would be even if they weren't completely flushing any credibility they might otherwise have down the toilet in their method of persuasion.\\n In extreme cases, they may respond to skepticism by wondering out loud if the disbeliever is \\\"in on it.\\\" And if anyone tries to calm them down, rather than taking a few deep breaths, sitting down for a moment, and coming back to the problem in a calmer fashion, they will immediately violently lash out, thus prompting the immediate summoning of the nearest security guards to have them ejected from the premises.\\nAnd then they wonder why no one believes them.\\nWhat's more, this will give the heroes a reputation for Crying Wolf or being Windmill Crusaders, making it even harder for them to get anyone to believe that the threat is real. Of course, the senseless deaths of the skeptics is often seen as a karmic comeuppance in favor of the hero, even if it was the heroes' fault they aren't believed in the first place.\\nThe other side of this trope is that, if the person making the claim sounds crazy, the listener will dismiss them to the point of going out of their way to dismiss them, no matter how simple it would be to investigate. When someone is screaming \\\"THERE IS AN ALIEN DIRECTLY BEHIND YOU WHICH IS ABOUT TO EAT YOU YOU'VE GOT TO BELIEVE ME I TELL YOU!\\\", you can be assured that the listener will not turn around; they will, in fact, stubbornly and strenuously refuse to turn around.\\nA possible cause of any disbelief towards the explanation of \\\"aliens did it\\\" in a continuity where aliens and alien invasion are not only known and documented, but semi-regular eventsnote\\u00A0After all, in Real Life, terrorist attacks are definitely known to occur, but that doesn't mean you'd believe some random wack-job off the street who's ranting about a secret society that's planning to bomb the White House within the hour. (Of course, this may be because some people are just stubbornly, willfully stupid, but hey.)\\nA subversion occurs when a normal person pulls this trope on a Conspiracy Theorist. Not only will he believe you, he'll also try to convince you that the situation is much MUCH worse than you think, and he will often already have plans in motion to do something about it.\\nA kind of Poor Communication Kills. See It Was Here, I Swear, Cassandra Truth, Ignored Expert, Properly Paranoid, Not Helping Your Case, and You Can See That, Right? Anyone invoking the trope is often dismissed as a Windmill Crusader or Cloud Cuckoo Lander \\u2014 at least until the threat turns out to be No Mere Windmill, thus proving that The Cuckoolander Was Right. Sometimes, this overlaps with Clap Your Hands If You Believe \\u2014 the character must convince someone to believe because belief itself is necessary to save the day."
    },
    "name": "You Have to Believe Me",
    "rdf_element": "YouHaveToBelieveMe/int_22133ffc",
    "short_name": "YouHaveToBelieveMe",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/YouHaveToBelieveMe"
  },
  {
    "categories": [
      "DiscordTropes"
    ],
    "descriptions": {
      "TheGoonies": "In The Goonies, there is a deleted scene where the bully Troy is going to punch Mikey when Brand stops him, saying, \\\"Nobody hits my brother except me.\\\"",
      "general": "A subtrope of Aww, Look! They Really Do Love Each Other, and/or Friendship Moment, in which a character who frequently bullies or teases another is the first to stand up for them if they get the same treatment from anyone else.\\nFor example, Alice and Bob are going out, and Alice never misses a chance to call Bob a jackass. Then, one day, Bob screws up big time in front of Charlie, who calls Bob a jackass. Cue Unstoppable Rage from Alice.\\nMay include an impassioned speech on what Alice will do to Charlie if he ever dares disrespect Bob again... before the payoff that it's not because she doesn't want Bob to be abused, it's because doing so is her job, dammit!\\nThis dynamic can exist in all sorts of relationships, from couples to friends to, perhaps most commonly, siblings (combining Sibling Rivalry with Big Brother Instinct), or the unpopular but tolerated member of a group.\\nFrequently a sign of Belligerent Sexual Tension, Vitriolic Best Buds, or Tsundere. Often a Jerk with a Heart of Gold trait. Compare The Only One Allowed to Defeat You, where a character's enemy will come to his or her defense if anyone else attacks him/her.\\n\\nExamples"
    },
    "name": "Hypocritical Heartwarming",
    "rdf_element": "HypocriticalHeartwarming/int_22133ffc",
    "short_name": "HypocriticalHeartwarming",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/HypocriticalHeartwarming"
  },
  {
    "categories": [
      "StockPhrases"
    ],
    "descriptions": {
      "TheGoonies": "Troy, one of the minor antagonists in The Goonies, uses this phrase when he sends Brand flying off the road at high speed.",
      "general": "This time it sure looks like it's over: the heroes have been captured by the Big Bad, who is gloating and enumerating the ways he's going to kill them. But wait! Someone (or something) suddenly shows up, a defector reveals himself or the heroes put their plan into action, giving them the chance they need to escape and leaving the foe staring at them as they run off while delivering a final taunt: \\\"So long, sucker!\\\"\\nSubversions may or may not ensue, depending on whether the character performing the So Long Suckers is a hero or a villain (it's way more likely in the latter case).\\nFor when this trope backfires, see Crossing the Burnt Bridge.\\nCompare We Will Meet Again. High Dive Escape is a sub-trope."
    },
    "name": "So Long, Suckers!",
    "rdf_element": "SoLongSuckers/int_22133ffc",
    "short_name": "SoLongSuckers",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SoLongSuckers"
  },
  {
    "categories": [
      "BadWritingIndex"
    ],
    "descriptions": {
      "TheGoonies": "Their parody of The Goonies made fun of the kids for being nothing but stereotypes, claiming that Chunk was a \\\"lying jew\\\" and making fun of Data's stereotypical Asian accent. However Chunk and Data were written as the stereotypical fat kid and smart kid, Data's actor really did have that accent and Chunk's actor really was Jewish (he only makes two references to it in the movie anyways and they were both improvised by the kid.)",
      "general": "Simply put, this trope is what happens when The Parody is created by people who didn't research what they were parodying. Instead, they watched the trailer (or the commercials or just absorbed it through Popcultural Osmosis) and then wrote the parody from that. Close enough, they decide.\\nTherefore, the \\\"parody\\\" will only bear a superficial resemblance to what is supposedly being parodied. Just grab an Iconic Outfit, a Catch Phrase (whether or not it's authentic), and an Iconic Item if you're lucky, and you're good to go. Expect the parody to coast on Parody Names, Stock Parodies and Vulgar Humor. Also, all too often the spoof will be smug and sneeringly superior, as if simply being familiar with the source material and not liking it properly equips one to satire it.\\nMore egregious cases will often ignore elements that justify the more ridiculous aspects of the work or mock the original for things the original doesn't even have.\\nNote this is sometimes unavoidable. For example, if you're parodying a film that hasn't come out yet, the trailer may be all you have to go on (although parodying something that has not yet branded itself into the public's consciousness would seem a little pointless). Occasionally, the parodists may make good guesses and succeed anyway. However, if you're making a parody of Citizen Kane and all you know is the \\\"Rosebud\\\" scene... well, there really is no excuse.\\nAlso note that this trope does not encompass all bad parodies. Just knowing what you're parodying does not automatically make your parody funny... but it's at least a start.\\nHowever, Tropes Are Not Bad. Sometimes these parodies can be understood as effective parodies of trailers, of basic premises, or as exaggerations of elements in The Theme Park Version of said subject matter. For many people a Shallow Parody can be funnier than an overdone Affectionate Parody because of the lack of obscure inside jokes. Still, people who are actually fans of the subject of the parody will, more often than not, laugh at said parodies rather than with them (at best). It's notable that some of the below examples are intentional shallow parodies and derive humor from getting things wrong.\\nRelated: Narrow Parody, in which the target is something relatively recent due to the assumption the target audience won't recognize something older even if it's riper for spoofing; and Redundant Parody, where the parody writers actually do what the piece's real creators would do, but think themselves as writing a clever spoof. Also related to Fountain of Expies. Has been known to overlap with Complaining about Shows You Don't Watch.\\nSubtrope of Outside Joke, a kind of humour that relies on the audience's unfamiliarity with the subject. See also Dead Unicorn Trope for a similar concept applied to tropes. Can also overlap with Cowboy Bebop at His Computer if the parodists are really on the ball with this."
    },
    "name": "This is based on opinion. Please don't list it on a work's trope example list.\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\n\\t\\t\\n\\t\\tShallow Parody",
    "rdf_element": "ShallowParody/int_22133ffc",
    "short_name": "ShallowParody",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ShallowParody"
  },
  {
    "categories": [
      "ArchetypalCharacter"
    ],
    "descriptions": {
      "TheGoonies": "Sloth in The Goonies is deformed, dimwitted, very strong, and kept as a Bertha In The Attic by his family. Once he makes friends with Chunk, however, it's clear he's a good guy.",
      "general": "A character that induces both fear and pity in viewers because his deformities belie a perfectly normal, if not noble, personality. The pathos associated with The Grotesque is the implication that he could easily have become a well-adjusted member of society if not for the hideousness that he is powerless to remedy.\\nHe is very rarely presented as the villain and frequently overlaps with the Reluctant Monster and Tragic Hero. The defining trait of The Grotesque is that his hideous appearance belies a gentle personality that is doomed to mistreatment because of society's shallowness. We, the viewers, are left feeling like the only ones who can see him for who he truly is, and want to comfort him with the knowledge that he's not alone in his quiet suffering.\\nThe Grotesque does not necessarily have to be physically deformed; he can be mentally or socially deformed, so long as we continue to see the good within and wish that it can somehow overcome the badness masking it.\\nDon't expect any of that to allow someone this ugly to get a happy ending, especially if they're female. Grotesques are universally tragic characters.\\nContrast Red Right Hand, where the outer deformity is symbolic of an inner corruption. Not to be confused with the kind of \\\"grotesque\\\" that adorns old gothic rooftops \\u2014 see Our Gargoyles Rock. Compare Gentle Giant. May result from a Power-Upgrading Deformation.\\nNot to be confused with mindless violence film Grotesque."
    },
    "name": "The Grotesque",
    "rdf_element": "TheGrotesque/int_22133ffc",
    "short_name": "TheGrotesque",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TheGrotesque"
  },
  {
    "categories": [
      "TheseTropesLoveToBrag"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies: After getting tied to a chair, Brand threatens Mikey and the other kids this way:",
      "general": "Stock Phrase for threatening to hit someone so hard, the damage will spread to his friend, his mom, his hair or even an abstract concept. A frequent variant is \\\"I will hurt you so bad that X\\\"\\nOften used in tandem with If You Ever Hurt Her, Badass Boast, To the Pain or Cut His Heart Out with a Spoon. Sometimes used as a Pre Ass Kicking One Liner. Can be literal if there's a Psychic Link involved (doubly so for Twin Telepathy).\\nIf the harm is financial rather than physical\\u2014say, Alice is threatening to sue Bob\\u2014it may be a more realistic threat like \\\"I'll sue you so hard your grandkids will be in debt.\\\"\\nNot to be confused with Hit So Hard the Calendar Felt It."
    },
    "name": "Hit You So Hard Your X Will Feel It",
    "rdf_element": "HitYouSoHardYourXWillFeelIt/int_22133ffc",
    "short_name": "HitYouSoHardYourXWillFeelIt",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/HitYouSoHardYourXWillFeelIt"
  },
  {
    "categories": [
      "IndexOfExactTropeTitles"
    ],
    "descriptions": {
      "TheGoonies": "Mama Fratelli makes Andi walk the plank off the pirate ship in The Goonies.",
      "general": "Standard Pirate punishment: extending a wooden board or similar object over the side of a ship, and forcing the intended victim to step off the far end and presumably drown or be eaten.\\nThis is a good scene for building suspense, if taken slowly. It is also an excellent opportunity for last-ditch-bravado and summing up antagonistic relationships. The plankee often tells the villain exactly what he thinks of him, and vice versa.\\nThe victim is usually bound. An occasional twist is for an unbound victim to grab the plank on the way down or otherwise use it as a springboard into combat.\\nReal Life pirates executed people this way, but only rarely. (Why bother with a plank at all, when you can just toss the guy overboard?) There are, sadly, no surviving records of them making people walk exactly 1.6 x 10-33 centimeters, although it is a given that most victims walked at least that far.\\nSince Space Is an Ocean, Space Pirates have a parallel punishment with a similar dramatic role: the victims are Thrown Out the Airlock. Sky Pirates seem to prefer the more old-fashioned plank\\u2014not surprising, since the airship's altitude would make it especially dangerous to the hero.\\n\\nExamples"
    },
    "name": "Walk the Plank",
    "rdf_element": "WalkThePlank/int_22133ffc",
    "short_name": "WalkThePlank",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/WalkThePlank"
  },
  {
    "categories": [
      "Trivia"
    ],
    "descriptions": {
      "TheGoonies": "In the end of The Goonies, Data has a line about the Giant Octopus, which was cut from the film. It was included in the Disney version, however.",
      "general": "An Orphaned Reference is a scene or line that refers to something that has been cut from the final version. In milder cases, this only means that what was supposed to be a Meaningful Echo loses its additional meaning; in more severe cases, the lost background information can cause apparent Noodle Incidents, Plot Holes or Ass Pulls.\\nCompare The Artifact. See also Dub Induced Plothole and Adaptation Induced Plothole; all adaptation and dub examples go there. Some video game examples may overlap with Dummied Out."
    },
    "name": "This entry is trivia, which is cool and all, but not a trope. On a work, it goes on the Trivia tab.\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\n\\t\\t\\n\\t\\tOrphaned Reference",
    "rdf_element": "OrphanedReference/int_22133ffc",
    "short_name": "OrphanedReference",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/OrphanedReference"
  },
  {
    "categories": [
      "ComedyTropes"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies. Data's \\\"Slick Shoes\\\" lead to some nut-crunching acrobatics by the Fratelli brothers.",
      "general": "Something slick like oil, or slippery like a jar of marbles, is poured out on to a floor, and a targeted character or vehicle slips, skids and falls/crashes, typically backwards.\\nSeen often in broad physical comedy, as well as vehicular action sequences. In chase scenes, it is guaranteed that when small spherical objects are scattered, the enemy in chase will step on them and immediately fall down, giving the hero ample time to escape.\\nA standard cause of The Pratfall. In more cartoonish variations it's accompanied by a common Stock Sound Effect.\\nBanana Peel is a subtrope of this. When done from a car against another car, it's usually an Oil Slick."
    },
    "name": "Slippery Skid",
    "rdf_element": "SlipperySkid/int_22133ffc",
    "short_name": "SlipperySkid",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SlipperySkid"
  },
  {
    "categories": [
      "OlderThanRadio"
    ],
    "descriptions": {
      "TheGoonies": "One-Eyed Willy's treasure in the movie The Goonies. Most of the treasure is lost completely, but the handful of gems that Mikey manages to hold onto is enough to save the kids' neighborhood from being turned into a country club.",
      "general": "A MacGuffin of great monetary value (though normally never specifically stated), so great that it could make anyone or any community rich and prosperous, and will never go hungry again. Naturally, it's almost always destroyed, lost, or otherwise gotten rid of at the end of the plot.\\nNot to be confused with Ridiculous Exchange Rates.\\nCompare Impossibly Cool Wealth. In the future, such a bill would be worth nothing thanks to Ridiculous Future Inflation. An example of Artistic License - Economics on the few occasions it can actually be used in the story, as it would immediately destroy any economy it was introduced to in a realistic setting\\u2014if anyone would actually take it, which smarter writers will often use as a plot point. Compare to A MacGuffin Full of Money."
    },
    "name": "Zillion-Dollar Bill",
    "rdf_element": "ZillionDollarBill/int_22133ffc",
    "short_name": "ZillionDollarBill",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ZillionDollarBill"
  },
  {
    "categories": [
      "Plots"
    ],
    "descriptions": {
      "TheGoonies": "Chunk has this problem in The Goonies. None of his friends believe him when he starts a story with \\\"I just saw the most amazing thing in my entire life.\\\" More importantly, the friendly sheriff doesn't believe him when he says he's in trouble because the last time several times he called it was a prank.",
      "general": "You know the story. A little shepherd boy cries wolf to get people to come running, because he's bored out of his skull (or whatever). They fall for it. He does it again. They fall for it again. Then, an actual wolf comes along, and the little boy screams his little lungs out (crying \\\"You Have to Believe Me!\\\") but this time nobody comes, since they think he's just playing that stupid prank again. Grimmer versions will end with the wolf eating the boy. Or the sheep. Or everyone.\\nSome have the variant plot of the hero kid getting caught in a relatively minor lie, or at least they thought they have, and then the kid alone spots something truly serious and no-one believes him. Fortunately, the kid is either able to find witnesses to support him or is able to prove his claim, even if he has to save the day on his own. Eventually, the kid's reputation is restored either by the authorities being impressed by his heroism or the people he helped coming forward to praise his character.\\nMoral of the story: nobody believes a liar, even when he's telling the truth. This can be taken two ways: \\\"Don't be a liar\\\" or \\\"Don't assume liars are always lying.\\\" Less traditional possibilities are \\\"Never tell the same lie twice\\\" and \\\"Don't leave a known liar on watch.\\\"\\nThere is also a more innocent variant when a hero, like a detective, makes a conclusion and decides that he has to take immediate action with something, only to find he was mistaken to his embarrassment. This kills his credibility with others, which makes his next move upon learning the real situation all the more difficult.\\nOlder Than Feudalism, the Trope Namer being from Aesops Fables. Which also makes it one of The Oldest Ones in the Book.\\nA frequently subverted Undead Horse Trope.\\nNot to be confused with the Metal Gear Solid 4 boss, Crying Beauty / Wolf.\\nSee also: This Is Not a Drill, Cassandra Truth, Not-So-Imaginary Friend, No Mere Windmill, Mistaken for an Imposter, Not Now, Kiddo. Contrast While Rome Burns, when things are actually going horribly wrong but everyone is in denial of it. In situations like that, if the character crying wolf turns out to be right, and people still refuse to believe him, then he is either an Ignored Expert or The Cassandra."
    },
    "name": "Crying Wolf",
    "rdf_element": "CryingWolf/int_22133ffc",
    "short_name": "CryingWolf",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/CryingWolf"
  },
  {
    "categories": [
      "ComedyTropes"
    ],
    "descriptions": {
      "TheGoonies": "The automatic gate opener at Mikey's house in The Goonies was one of these.\\n Not to mention all the \\\"booty traps\\\" they encounter...",
      "general": "One small thing happens, causing something else to happen, causing something else to happen, causing something else to happen, and so on until after all of that, something (usually quite trivial, like turning on a shower) happens. The joke is that it would have been easier to just turn on the shower than set it all up. Essentially it's a Zany Scheme performed by a machine.\\nThe name is taken from the drawings by American cartoonist Rube Goldberg, which had a ridiculously complicated sequence of events to do something as trivial as giving someone a back scrub. Obviously, this is different from a traditional invention in that it gives a complicated solution to a simple problem, not the other way around. This device is also known as a Heath Robinson contraption in Britain (after cartoonist William Heath Robinson whose ideas came before Goldberg), or a Pythagoras switch (\\u30D4\\u30BF\\u30B4\\u30E9\\u30B9\\u30A4\\u30C3\\u30C1) in Japan, among other terms used around the world.\\nAs with the Unspoken Plan Guarantee, the efficacy of a planned contraption is generally inversely proportional to the amount of its workings known to the audience.\\nNecro Non Sequitur is often an example of this. Compare Disaster Dominoes, and Butterfly of Doom. The Chessmaster is often responsible for these, either for fun or as part of the plot. Gambit Roulette is the using the same principle when compared to plans of some kind. If the contraption is lethal, then it's safe to say that Rube Goldberg Hates Your Guts.\\nAwesome but Impractical is in full play here since many things they do are easily done by hand but They look damn cool!\\nYou can read more under Rube-Goldberg Machine on The Other Wiki."
    },
    "name": "Rube Goldberg Device",
    "rdf_element": "RubeGoldbergDevice/int_22133ffc",
    "short_name": "RubeGoldbergDevice",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/RubeGoldbergDevice"
  },
  {
    "categories": [
      "ActionAdventureTropes"
    ],
    "descriptions": {
      "TheGoonies": "In The Goonies, the characters run across the long-dead body of treasure hunter Chester Copperpot in their search for One-Eyed Willy's ship. Some of them want to turn back, but Mikey convinces them that this is a good sign, because it means that they're on the right track, and they have already got farther than a professional treasure hunter.",
      "general": "Our adventurer is working his way through the dark tomb of King Nohatsuput, but he is not worried about the \\\"curse\\\", nor the many Death Traps, nor Nohatsuput's Mummy rising again to strangle him. Nope, no worries at all because he bought a special talisman from the local villagers. But wait...the bones of many previous adventurers all lie along this path...all with the same familiar talisman...\\nThis trope describes the instance when a character (or perhaps just the audience) realises this is a dangerous area, because many other people in the same circumstances have left evidence of their demise. To continue might be considered Schmuck Bait but we've got a story to tell.\\nIn several instances, this trope becomes a Deus ex Machina that helps the main character or hero get out of the incoming peril in some way. This can be simply the warning that the area is dangerous, but sometimes the hero may find useful items left by the victims."
    },
    "name": "This Way to Certain Death",
    "rdf_element": "ThisWayToCertainDeath/int_22133ffc",
    "short_name": "ThisWayToCertainDeath",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ThisWayToCertainDeath"
  },
  {
    "categories": [
      "ActionAdventureTropes"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies: Mikey suggests a plan to escape from the pursuing villains in based on a Hardy Boys story.",
      "general": "A group of characters is in some sort of fix or trouble. One character steps up and:"
    },
    "name": "Saw It in a Movie Once",
    "rdf_element": "SawItInAMovieOnce/int_22133ffc",
    "short_name": "SawItInAMovieOnce",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SawItInAMovieOnce"
  },
  {
    "categories": [
      "ShowBusiness"
    ],
    "descriptions": {
      "TheGoonies": "Jeff Cohen, who played Chunk in The Goonies, left the movie business after puberty, but reemerged on its business side. Goonies director Richard Donner helped Cohen get summer jobs at movie studios while he was attending Berkeley, which led him to pursue a law degree at UCLA. He's now a name partner in a Beverly Hills entertainment law boutique.note\\u00A0In legal circles, \\\"boutique\\\" refers to a firm, usually small to medium-sized, specializing in a relatively narrow area of law.",
      "general": "= Current Life Mess\\nProbably one of Hollywood's biggest Acceptable Targets, the Former Child Star is just what it sounds like: a star of TV or film whose career was at its peak in their formative years. Alas, such an unorthodox childhood can leave its mark on anyone (especially if they were Not Allowed to Grow Up), and it always does in fictional depictions of the Former Child Star. In adulthood, they may be a struggling actor who finds it hard to be taken seriously when everyone remembers them as \\\"that one kid from that one show\\\", if they're remembered at all. It doesn't help that puberty is a fickle beast and there is no guarantee that a cute and adorable kid will grow into an attractive adult. For every Emma Watson and Daniel Radcliffe, there are a half-dozen others whose adolescent years weren't nearly as kind.\\nAs for those who left showbiz, many wind up mourning their glory days in a dead-end job, or (dis)gracing the covers of tabloids after a run-in with the law. Sadly, a case of Truth in Television, as the troubled biographies of some real-life Former Child Stars will show. On the other hand, there are other child actors who grew up well, like Jodie Foster and Bill Mumy, because their parents took care to raise them up right under the circumstances.\\nWhile some kids idolize these stars and want to be like\\u2014or be\\u2014them because of how \\\"glamorous\\\" their lives are, what they don't see behind the scenes is that their careers pretty much rob them of a normal childhood, and a disturbingly high number of Former Child Stars have unscrupulous, financially exploitative parents. Can you say Blessed with Suck?\\nNo doubt Growing Up Sucks for them...especially if they're treated as though they never did.\\nCompare White-Dwarf Starlet, an older version of this trope. For other grown-up kids, see School Yard Bully All Grown Up and Kid Hero All Grown Up."
    },
    "name": "Former Child Star",
    "rdf_element": "FormerChildStar/int_22133ffc",
    "short_name": "FormerChildStar",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/FormerChildStar"
  },
  {
    "categories": [
      "DuoTropes"
    ],
    "descriptions": {
      "TheGoonies": "Chunk and Sloth make a weird sort of comic/heroic pair in The Goonies. Chunk isn't exactly brainy, but he is when compared to Sloth, and he does lead them to the rest of the Goonies. Along the way Sloth demonstrates his incredible strength, for better or worse.",
      "general": "Teaming up The Smart Guy with The Big Guy (or The Evil Genius with The Brute). Sometimes, Brains and Brawn serve as heroes, but other times they're villains (forming an Evil Duo, often the Quirky Miniboss Squad or part of a Terrible Trio, and very frequently Those Two Bad Guys). Either way, there tends to be some element of comedy inherent in their natures. If the Brain is ever condescending or mean to Brawn, it's because Dumb Is Good.\\nUsually, in such a pair like this, The Smart Guy would usually communicate vital information to The Big Guy, so that The Big Guy would utilize this information to his advantage. Other times, The Smart Guy would provide items and equipment for The Big Guy to utilize. Regardless, while The Smart Guy provides resources and information, The Big Guy must protect The Smart Guy with his life, so that he could gain more information and resources from The Smart Guy.\\nWhen you have one character with both Brains and Brawn, you've got yourself a Genius Bruiser or a Badass Bookworm, depending on which element is dominant. Sometimes both characters form this dynamic.\\nIf combined with Big Guy, Little Guy, the Little Guy is almost always the Brains and the Big Guy the Brawn. See also, Beauty, Brains and Brawn, a feminine variation of the Trope with a third member - a Beauty - added.\\nBe sure, when adding examples, that the non-brainy one does have great strength. If he's not superior when it comes to physical activity then they're not an example."
    },
    "name": "Brains and Brawn",
    "rdf_element": "BrainsAndBrawn/int_22133ffc",
    "short_name": "BrainsAndBrawn",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/BrainsAndBrawn"
  },
  {
    "categories": [
      "SpeculativeFictionTropes"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies: A group of teenagers seek the treasure of One-Eyed Willy in order to save their town.",
      "general": "The defining High Fantasy storyline. The quest means business.\\nQuests feature The Hero and a bunch of supporting cast members traveling across the world with a firm goal in mind: to recover a McGuffin, collect all the Plot Coupons, Save the Princess, defeat the Big Bad, locate a loved one or all of the above. Quite possibly an Impossible Task, to get rid of him. Will usually involve lots of incidental minor adventures, running into oracles and wise men, fantastic creatures and damsels dispensing items that may help you on your quest. A great device, because it allows the writer to do character interaction and showcase exotic locations, and give The Hero a good reason to Walk the Earth. Used mostly in a fantasy world, but can also take place in a modern or mundane setting with enough work-around.\\nOlder versions just set the character off on his quest in the wilderness about them.\\nOften undertaken by Hitchhiker Heroes or people on The Homeward Journey.\\nThe problem with such a story from a modern perspective is that they can actually tail off too much into the various side-stories and forget the main goal that the characters originally started out on. This was less of a problem before, as Medieval writers often deliberately wrote a network of plots, subplots, and sub-subplots branching out like a tree. Examples of this are Spenser's Fairy Queen, Arabian Nights, and Romance of the Three Kingdoms.\\nChristopher Booker's The Seven Basic Plots separates The Quest from Overcoming the Monster. While both involve a journey, the Overcoming the Monster plot is far more focused on heading straight for the Monster (with perhaps a side quest for magic weapons), while The Quest concentrates on a variety of obstacles including Monsters, Temptations, Deadly Opposites, and a Journey to The Underworld. (This probably indicates that if the heroes don't realize there's a Big Bad to fight until after the halfway point, it's following The Quest plot.) Also, The Quest is the plot most likely to include companions (a small group, or just one companion - or, as with The Odyssey, a Red Shirt Army).\\nCompare The Hero's Journey. Though separate and distinct tropes, the two don't just overlap, they have adjoining apartments and raid each other's refrigerators Kramer-style. The main difference is that a quest has a stated goal, and the focus is mainly on the adventures had along the way to that goal; a hero's journey tends to be undertaken in response to events thrust upon the hero(es), and focuses on the personal growth of the characters as they find (or overcome)their destiny.\\n\\nExamples"
    },
    "name": "The Quest",
    "rdf_element": "TheQuest/int_22133ffc",
    "short_name": "TheQuest",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TheQuest"
  },
  {
    "categories": [
      "ItsNotPornItsAnIndex"
    ],
    "descriptions": {
      "TheGoonies": "Mouth plays this role in The Goonies. When they find an old Treasure Map annotated in Spanish, Mouth is there to provide a Conveniently Precise Translation.",
      "general": "The Squad or the Command Roster don't always have the luxury of operating in countries or planets where everyone conveniently speaks English, so it falls to the Cunning Linguist to be the interpreter with the locals, decode enemy transmissions, help them pass themselves off as enemy soldiers, and help interrogate captured POW's.\\nIn The Squad, the Cunning Linguist is often a white collar officer who has been \\\"just transferred\\\" into the squad, rubs everyone the wrong way, and worse, is completely and hopelessly lost in an actual battlefield. In the Command Roster, they fit in better. Subplots involving the Linguist usually have them grow a spine. Other times the linguist was always a part of the squad, but has been hiding their talents out of fear their friends will think the linguist is like their enemy, or unapproachably intellectual.\\nMay overlap with other squad archetypes. If their skill with languages is overplayed, they may become an Omniglot. It is also not uncommon for this character to be a Gentleman and a Scholar. Compare The Smart Guy.\\nA common subversion of this trope is to land the Cunning Linguist in a situation where he/she doesn't speak the language\\u2014often a ridiculously common one, like Spanish or French. Such people tend to have worked in intelligence, where the language skills required are generally more exotic. Another is to simply depict them as being bad at a given language they claim to speak well. See Informed Ability.\\nCan easily overlap with the Communications Officer.\\nThis trope is named for the cunning most linguists display throughout a given movie, always saving the squad's collective asses with only their quick wit and quicker language skills, and is not at all a pun on the word \\\"cunnilingus\\\" (that we took from James Bond).\\n\\nExamples"
    },
    "name": "Cunning Linguist",
    "rdf_element": "CunningLinguist/int_22133ffc",
    "short_name": "CunningLinguist",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/CunningLinguist"
  },
  {
    "categories": [
      "UnisexTropes"
    ],
    "descriptions": {
      "TheGoonies": "Sloth from The Goonies. A sympathetic example of Type 1.",
      "general": "This is when a character with mental problems, and often some physical deformity, is locked away because s/he will never fit into society, usually either in the attic or in the basement, and often by a Corrupt Hick. The more of a Big Fancy House, the better; in fact, the smarter ones will sometimes have a secret system of peepholes and secret passages so they can move around as they please. They also tend to be inbred.\\nThere are two basic plotlines for this type of character:\\n The protagonist is an outsider, wondering what kind of bizarre secret the Corrupt Hicks are keeping. The Madwoman will then either tend to be Dragon-type enemies with little personality of their own, or they're The Grotesque, sympathetic victims. When done well, this can be an effective scare because it so aptly encapsulates the frightening insularity of the Town with a Dark Secret.\\n The main characters have just moved into a new house, and unbeknownst to them, are being watched by one of these whose caretakers have died some time ago. These are scary because of how they personify the fears of buying a new house: that your house has some hideous aspect that you haven't seen, but can see you.\\nThis trope is named for the landmark work of feminist literary criticism by Sandra Gilbert and Susan Gubar, referring to Mr. Rochester's wife in Charlotte Bront\\u00EB's Jane Eyre. The analysis indicates that this trope first popularly appeared, in all places, in Victorian women's literature, where depicting some women as crazy people was an easy way to make female villains with whom readers would be unlikely to sympathize. Obviously, this plan was not a complete success.\\nOf course, it can be the case that there was a very good reason this person was locked away in the first place. Maybe they're Axe Crazy, maybe they suffer from an extremely contagious form of illness, or perhaps the person is being hidden for their own safety to keep them from being kidnapped or murdered.\\nUsually either Ax-Crazy or The Grotesque. Compare Man in the Iron Mask.\\nNot to be confused with the company involved with the first season of Smash. Or the episode of The Sarah Jane Adventures which also borrows its name from the book (but isn't an example)."
    },
    "name": "Madwoman in the Attic",
    "rdf_element": "MadwomanInTheAttic/int_22133ffc",
    "short_name": "MadwomanInTheAttic",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/MadwomanInTheAttic"
  },
  {
    "categories": [
      "Plots"
    ],
    "descriptions": {
      "TheGoonies": "In The Goonies, Mikey finds a Treasure Map leading to the \\\"rich stuff\\\" of legendary pirate One-Eyed Willy.",
      "general": "In media the goal of every pirate is to plunder shipping for the large wooden chests overflowing with gold, jewels and other valuable trinkets invariably carried by every vessel on the high seas. Mundane cargoes carried in the ships' holds are completely ignored as cackling buccaneers make off with their ill-gotten riches, which they then buried or hid in a cave on a remote island, with only a Treasure Map to remind them of the location.\\nThe reality of piracy was a lot more pragmatic. Food, fresh water, weapons and ammunition, timber, ropes, and sails were all of more immediate value to the corsair than a chest full of gold (which, if they ever got any, would promptly be spent on food, fresh water, weapons and ammunition, timber, ropes, and sails, with what was left going to drinking and whoring before they got caught and hanged). These things kept their ships and crews operating outside the reach of the law. In addition, very few cargo vessels carried that kind of wealth. Those that did were warships sailing in groups with enhanced security to fend off any pirates that might attempt an attack. (Certain, more mundane-looking cargoes, mind, might be more valuable than we would think of today - fabrics, spices, and certain items made only in certain parts of the world.)\\nFurthermore, pirate ships probably didn't have space for huge chests: real pirate ships were often very small and fast, although a few of the more successful and grandiose pirate captains got quite big ships.\\nPirates sustained themselves and their vessels by using supplies and cargoes plundered from their victims and selling what they had no use for. This provided the coin for obtaining things they couldn't steal, paying their crews and spending a raucous night enjoying the pleasures of a seedy port.\\nBut as they say, behind every story is a grain of truth. The idea of pirate gold most likely arose from the \\\"Treasure Fleets\\\" used by Spain to transport large amounts of gold and silver, among other goods, plundered from Mexico and South America. Even today, sunken treasure ships are highly sought after by modern treasure hunters. Additionally, the passengers on ships typically carried money in the form of gold or silver, in small quantities.\\nThe greatest amount of pirate treasure is said to be on the Swedish island Gotland in the Baltic Sea. Though obviously not the Caribbean type of pirates, generations of vikings buried treasure from their raids to eastern Europe and the Black Sea there.\\nSee also Inexplicable Treasure Chests what be buried on a Desert Island in The Spanish Main."
    },
    "name": "Pirate Booty",
    "rdf_element": "PirateBooty/int_22133ffc",
    "short_name": "PirateBooty",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/PirateBooty"
  },
  {
    "categories": [
      "HorrorTropes"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies has such a scene.",
      "general": "It's dark. The guy we're watching is running out of light. The match is burning down. The candle's nearly done. His flashlight's flickering. In any case, darkness is imminent. These are scenes often played for dramatic tension. Directors use them in horror movies. Other times the lack of reliable lighting might be an inconvenience for the protagonist in a slapstick comedy for whom everything goes wrong.\\nIn video games, may often result from a Ten-Second Flashlight.\\nContrast with Blackout Basement. See also Down To The Last Match."
    },
    "name": "Tentative Light",
    "rdf_element": "TentativeLight/int_22133ffc",
    "short_name": "TentativeLight",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TentativeLight"
  },
  {
    "categories": [
      "WeaponsAndWieldingTropes"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies: Data and his Slick Shoes.",
      "general": "What's amazing with shoes is the stuff you can put on and in them. Included are retractable and attachable items. Alternatively, they can be magical or run on Applied Phlebotinum.\\nCan overlap with Nice Shoes (if the shoes are pimped out enough), Shoe Phone (if the item is actually a shoe).\\nCompare Jet Pack (which covers Rocket Boots), Tricked-Out Gloves, Armed Legs, Shoe Slap. See also Magical Accessory."
    },
    "name": "Tricked-Out Shoes",
    "rdf_element": "TrickedOutShoes/int_22133ffc",
    "short_name": "TrickedOutShoes",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TrickedOutShoes"
  },
  {
    "categories": [
      "ActionAdventureTropes"
    ],
    "descriptions": {
      "TheGoonies": "In The Goonies, One-Eyed Willie's 350-year-old pirate ship actually sails out onto the open seas at the end. While the ship is not submerged, it has been sitting in water for three centuries in a wet, brackish cavern with lots of moisture dripping from stalactites. Aside from the skeleton of Willie, the ship and even its sails appear to be in fairly good condition.",
      "general": "So you're looking for a lost treasure ship on the bottom of the ocean. Good thing that the ocean is a perfect preservative. Oh, it might have some barnacles and coral here and there, maybe some parts have collapsed, but that may have happened when it was sunk. Heck, it probably still has tattered sails! It'll be sitting slightly to one side, but still mostly upright.\\nNot so in the real world. In the real world, water, particularly salt water, and especially warm salt water as seen in most pirate-frequented areas, wreaks havoc on anything immersed in it for too long. Just look at the continued decay of the Titanic or ships sunk during World War II. A wooden ship in salt water would be shipworm bait in no time flat.\\nOften an excuse for a Gangplank Galleon; ubiquitous in the Derelict Graveyard. Can also be a Ghost Ship."
    },
    "name": "Shipshape Shipwreck",
    "rdf_element": "ShipShapeShipwreck/int_22133ffc",
    "short_name": "ShipShapeShipwreck",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ShipShapeShipwreck"
  },
  {
    "categories": [
      "ShowBusiness"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies",
      "general": "The air that every Geek breathes, a Cult Classic is a film or other work which has a devoted, even if sometimes small, fanbase. Some Cult Classics are obscure commercial failures at the time of their premiere which have since then successfully attracted a fanbase, even to the extent of becoming moneyspinners. Although this is the common public perception to a Cult Classic, some Cult movies were in fact box-office successes at the time but maintained a cult following long after public interest has moved onto the next flavour of the month. It's probably for this reason that some films with a strong cult following (eg The Blues Brothers) are sometimes wrongly assumed to have been unsuccessful at their time of release.\\nCult classics have an unusual shelf life, and seemingly avert the Popularity Polynomial completely. Rather than receiving a short but large burst of popularity before ultimately fading completely into obscurity, cult classics receive a marginal amount of attention almost indefinitely. It's a good bet that a show or movie considered a cult classic 30 years ago will still be such today.\\nThough some movie studios have intentionally tried to position releases as Cult-Classics-To-Be (like MirrorMask and Snakes on a Plane), perhaps hiring a bunch of cult actors and funky music, it is not usually successful. A true Cult Classic is as rare as capturing lightning in a bottle.\\nNote that not all cult classics are actually good. Although many of them are, or at least, are remembered as such. In fact, many cult classics are hilariously bad \\u2014 which is why their fans adore them. These are sometimes called \\\"Camp Classics\\\".\\nSee also Critical Dissonance when the critics hate it, and Critic Proof when...the critics hate it, also. If it's a critical darling on the art-house circuit, but has no following beyond that, that's the other kind of Critical Dissonance. Contrast Quality By Popular Vote, which is the inverse trope. Compare Stoner Flick and/or B-Movienote\\u00A0Not all B Movies have a cult following; see page quote. Stoner Flicks are usually considered cult, however.\\nOften the term \\\"cult\\\" is (perhaps) inaccurately applied to anything that is both old and has a devoted fan following, even if it was popular at the time. If the devoted fan following is rooted in it being both old and critically-acclaimed, and thus popular with fans of classic works in general (e.g. The Marx Brothers), it probably doesn't count.\\nAlso note that \\\"cult classic\\\" is an affectionate English expression for a work of this type, and does not mean that it's a \\\"classic\\\" in the same sense of, say, a \\\"classic novel\\\" or \\\"essential work\\\". Unless the fandom are surrounded by a sea of indifference, such usage is too broad to be meaningful, so works such as Star Wars don't count. Otherwise, the phrase would be meaningless, as Roger Ebert has noted in lamenting its misuse, since it does carry certain genre-specific connotations.\\nThe word \\\"classic\\\" may also be seen as an intensifier of sorts, implying works that have become seen as cult over the years, similar to a Sleeper Hit \\u2014 due to factors such as Audience Participation, Notable Quotables, or other engrossing aspects that attract a select audience who proselytize fervently and disdain non-believers.\\nOne good measurement to use when in doubt, is critical consensus. If a work is commonly described by critics as quirky, fringe, bizarre or off-putting to newcomers, and therefore \\\"cult\\\", then that meets the definition of the trope. If this is actually used as a selling point, then that is a good sign. An even better sign is if critics debate whether or not it's still cult.\\nOn The Other Wiki, \\\"something of a cult classic\\\" (exact words, always; see for yourself) is a well-worn Justifying Edit.\\nNote that most of these cult classics have their own pages already. Yes, we are collectively that geeky.\\nWhen a cult classic actually does become popular, expect geeks to complain It's Popular, Now It Sucks.\\nA standard guide in the cult film genre is Danny Peary Cult Movies List.\\nWhen listing works by the same author, please don't list, say, the entire filmography of a director with a cult reputation. A cult classic should have a small but devout following in the absence of widespread current popular acclaim, in addition to the work itself meeting the definition of the trope. Only list those works by a given author for which the label is justified.\\n\\nExamples"
    },
    "name": "Cult Classic",
    "rdf_element": "CultClassic/int_22133ffc",
    "short_name": "CultClassic",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/CultClassic"
  },
  {
    "categories": [
      "StockPhrases"
    ],
    "descriptions": {
      "TheGoonies": "A particularly lovely moment in The Goonies where Data's dad, an inventor like his son, tries to take a picture with a spring-loaded camera though it fails. Data tells his father that it's alright, since he cannot hug a photo. His dad responds with \\\"You are my greatest invention.\\\"",
      "general": "Our young hero has accomplished! Perhaps they have triumphed, perhaps they have decided to undertake a Heroic Sacrifice, perhaps they have proven worthy to respond to the Call.\\nHow can this be fittingly celebrated? Why, have them be told how proud people are of them!\\nNormally this is said only by people who have reason to be proud: their parents, a Parental Substitute, their mentor, the Team Dad, A Father to His Men, etc. This is usually done for a young hero, whose skills might have been in doubt, and had unquestionably been formed by the person saying it. It may happen very early in the story, as proof that they are ready for the call, but is more common at the end to validate their Character Development.\\nMay also be a form of encouragement after The Hero has progressed a certain amount but is feeling discouraged.\\nThere is the form \\\"I'm so proud of you.\\\" Or \\\"We are so proud of you,\\\" if one can speak for more than one (a mother or father for both parents).\\nThen there is the form \\\"Your father would have been so proud of you.\\\" Normally addressed to fatherless heroes, though any Disappeared Dad may qualify them. May be spoken by the mother, or by any other mentor. They may not want, even in this moment, to have a Not So Stoic moment, and so distance themselves from the praise. They may be aware that the child craves his father's approval, and would value this. They may also not want to claim too much credit, since saying \\\"I am so proud of you,\\\" implies that they have a reason to be proud.\\nWhile \\\"father\\\" is the commonest, \\\"Your mother (or other figure) would be so proud of you,\\\" is also possible, in similar situations. \\\"You should be proud of yourself\\\" is another alternative, which ascribes even more of the credit to The Hero themselves.\\nThis is, in fact, what the \\\"Well Done, Son!\\\" Guy craves, but the hero has not usually been striving with their eye on it, and the speaker is willing to tell them, freely.\\nThis trope can also be Played for Laughs when the child does something despicable or even outright criminal, and the parent approves of their deviant behavior. Alternatively, the trope Don't Tell Mama exists because a crook wants to hear this and doesn't want their parents to be disappointed in them for taking up a life of crime.\\nContrast It Has Been an Honor, where the character is usually addressing someone he has not formed, though he may have led him. Powerful potential for a Crowning Moment of Heartwarming right here. Also contrast Disappointed In You.\\nSee Your Approval Fills Me with Shame for when they don't want this praise.\\nAlso see Like a Son to Me."
    },
    "name": "So Proud of You",
    "rdf_element": "SoProudOfYou/int_22133ffc",
    "short_name": "SoProudOfYou",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SoProudOfYou"
  },
  {
    "categories": [
      "CharactersAsDevice"
    ],
    "descriptions": {
      "TheGoonies": "Chunk from The Goonies, who has to do his \\\"Truffle Shuffle\\\" to be allowed into the gang's house.",
      "general": "When it comes to children's media and the like, it seems that whenever there's a gang of lead characters there's always one person that's fatter than the rest of the cast.\\nThis person is usually male, and he or she'll almost always be the Butt Monkey/Chew Toy/Plucky Comic Relief - often, though not always, through their Big Eater and/or Gasshole tendencies.\\nKeep in mind that just because a character is both fat and a Butt Monkey, that does not mean they apply for this trope. Butt Monkeys can be played straight or for sympathy, in which case they are not seen as Acceptable Targets, and so do not qualify.\\nAdditionally, their fatness and their status as a Plucky Comic Relief or Butt Monkey must be related in some way. For example, a Butt Monkey who is picked on because he is fat would qualify (if Played for Laughs), but a Butt Monkey who is picked on for some unrelated reason (like for being a Nerd) without consideration for his weight would not.\\nThese are usually found in comedies, often children's media and sitcoms.\\nClosely related to Fat Girl. A Sister Trope to Fat Idiot. You'll often find these kids gobbling up the ammo of a Food Fight. Can sometimes be Obsessed with Food. If the series takes place in school, expect them to be the most frequent target of The Bully. See also Big Fun."
    },
    "name": "Fat Comic Relief",
    "rdf_element": "FatComicRelief/int_22133ffc",
    "short_name": "FatComicRelief",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/FatComicRelief"
  },
  {
    "categories": [
      "VideogameSettings"
    ],
    "descriptions": {
      "TheGoonies": "In The Goonies, the entrance to the cave system is underneath a lighthouse.",
      "general": "Lighthouses have been around for a long time. At one time they were invaluable to the shipping industry, making sure boats get into harbor without crashing into reefs or the shore. Advances in technology have made lighthouses mostly obsolete though, GPS and LORAN killed off the use of lighthouses in commercial shipping due to being much more accurate and cheaper to use and operate. Nowadays lighthouses are left alone for historical sites and tourist traps. The only places left where lighthouses have any serious use are where radio might not work, where the sea conditions change radically, or in places like harbors with narrow entrances or seamounts surrounded by barely submerged ridges where it is vital that the pilot of a ship have a blatantly obvious marker of where not to steer in the event of an electronics failure or disorienting weather conditions.\\nDespite their current uselessness, lighthouses have been used as settings in modern and old stories, often in a scary capacity. It could be because the small number of people needed to staff a lighthouse lead to stories about recluses working the lighthouse. Or it could be that due to lighthouses being usually located on a lone island or a distant cliff makes them isolated and creepy. Add some Ominous Fog rolling in off the coast for extra atmosphere. The height also makes a lighthouse an ideal setting for a Climbing Climax, and relighting a lighthouse is a common quest for heroes.\\nOf course, it can just as easily be a Subverted Trope. The protagonists could stumble upon a lighthouse that initially appears abandoned but is actually inhabited and well maintained.\\nLighthouses do not necessarily have to be haunted to be good for a setting; they can be just as atmospheric on their own. But the characters have to interact with it in some way."
    },
    "name": "Lighthouse Point",
    "rdf_element": "LighthousePoint/int_22133ffc",
    "short_name": "LighthousePoint",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/LighthousePoint"
  },
  {
    "categories": [
      "DiscreditedTrope"
    ],
    "descriptions": {
      "TheGoonies": "One-Eyed Willy in The Goonies.",
      "general": "An alliterative name is a name in which the first and last names begin with the same sound. In more extreme cases, this can also include the middle name.\\nGiving a character an alliterative name is one of many ways a writer can make a name more interesting and catchy, which in turn makes the character more memorable to the audience. This is especially important in works with Loads and Loads of Characters, where extra help is needed to differentiate between them.\\nIn comic books, this is especially true of the names of Super Heroes or their close hangers-on. It was a favorite tool of Stan Lee's, since, swarmed with projects, he often had trouble remembering the characters' names, and the alliteration worked as a mnemonic device. (Though it didn't always work perfectly \\u2014 Lee occasionally referred to \\\"Peter Palmer\\\" and \\\"Bob Banner\\\".)\\nOf note to writers: Overusing this trope dilutes its effect, particularly if multiple characters have the same starting sounds in their names.\\nIn comic books, the Alliterative Name is often also Two First Names. In cartoons, it goes hand-in-hand with Species Surname.\\nSee Added Alliterative Appeal, for trope titles that do this. See Alliterative Family, for when this is done across an entire family. See Alliterative Title, for work titles that do this.\\nPlease note that Japanese names, though many may seem alliterative to an English-speaking audience, may not convey the same \\\"alliterative power\\\" in their original setting; syllables (and vowel sounds) matter more than letters in Japanese."
    },
    "name": "Alliterative Name",
    "rdf_element": "AlliterativeName/int_22133ffc",
    "short_name": "AlliterativeName",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/AlliterativeName"
  },
  {
    "categories": [
      "StockPhrases"
    ],
    "descriptions": {
      "TheGoonies": "In The Goonies Mikey does this when his brother Brandon (AKA: Brand) calls him an \\\"adopted wuss\\\".",
      "general": "Someone threatens to kill someone else, often by yelling it at the top of their lungs or by simply saying it calmly. Or variations on this theme, most notably with the F-Bomb or with an accent such as \\\"I keel yew!\\\" Hilarity Ensues, especially if the threatened person replies with \\\"Is That a Threat?\\\". If there's no realistic chance of it being carried out, this is also quite a straightforward example of Ineffectual Death Threats. Unless said target dies, in which case they'll be near the top of the suspect list.\\nNote that this is a stock phrase and must be a variation on \\\"I'll Kill You\\\" and not just a threat on a person's life.\\nContrast You Will Be Spared and I Kiss Your Foot."
    },
    "name": "I'll Kill You!",
    "rdf_element": "ILLKILLYOU/int_22133ffc",
    "short_name": "ILLKILLYOU",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ILLKILLYOU"
  },
  {
    "categories": [
      "IndexOfExactTropeTitles"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies. Data's \\\"Slick Shoes\\\" invention is essentially the vehicular version in a shoe-sized package. He successfully applies it to a log that crosses a river while being chased by the villains.",
      "general": "One of the standard tools to try to lose someone when driving.\\nWhen in a vehicle, simply push a button and the car somehow spills out oil behind, designed to make the person behind slip out of control.\\nSubtrope of Weaponized Car. See also Slippery Skid. Not to be confused with a certain Decepticon."
    },
    "name": "Oil Slick",
    "rdf_element": "OilSlick/int_22133ffc",
    "short_name": "OilSlick",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/OilSlick"
  },
  {
    "categories": [
      "DiscordTropes"
    ],
    "descriptions": {
      "TheGoonies": "Mama Fratellli, Francis Fratelli, and Jake Fratelli to Michael \\\"Mikey\\\" Walsh, Brandon \\\"Brand\\\" Walsh, Lawrence \\\"Chunk\\\" Cohen, Clark \\\"Mouth\\\" Devereaux, Andrea \\\"Andy\\\" Carmichael, Stephanie \\\"Stef\\\" Steinbrenner, Richard \\\"Data\\\" Wang, and Lotney \\\"Sloth\\\" Fratelli in The Goonies.",
      "general": "An Arch Enemy, archfoe, archnemesis, or simply nemesis is some character's designated and most important enemy.\\nThe Arch Enemy can be the Big Bad, The Dragon, The Rival, an Evil Counterpart, or even a Harmless Villain. The essential element is that, with them, It's Personal. Most typically, the Arch Enemy is a foil of some sort. For example, the Arch Enemy of the physically strong could be very smart. If the villain is the Bigger Bad, his Arch Enemy commonly is the Big Good.\\nThe Arch Enemy will stand out from the Super Hero's Rogues Gallery \\u2014 there will be one opponent where the relationship to the hero and the motivations for battling them are more potent. These feelings may be one-sided, felt more by the villain than the hero, or occasionally vice-versa.\\nA hero's Arch Enemy is not necessarily the biggest threat to them. Lex Luthor is considered Superman's Arch Enemy; Brainiac is smarter and Darkseid is vastly more powerful and dangerous, but for Lex - and, to a lesser extent, for Superman - it's personal between them.\\nSometimes, the hero could have made the same choices as the Arch Enemy: the Arch Enemy is showing us what he could have become, as in the case of Batman and the Joker.\\nA hero may possess more than one Arch Enemy if more than one villain from his Rogues Gallery stand out, or if a former Arch Enemy dies and new one comes in to the picture. As an example, consider Spider-Man: the Green Goblin, Doctor Octopus, and Venom have all established themselves as recurring and iconic foes of Spider-Man, each of whom has been considered the wallcrawler's Arch Enemy at different points in time.\\nLastly, remember that this generally refers to the enemy the hero considers to be his Arch Enemy, and ideally, it should be personal on both sides (though there are plenty of good \\\"But for Me, It Was Tuesday\\\"-type Arch Foes out there). Especially in the case of a Rogues Gallery, the hero is usually considered an Arch Enemy to all of his villains, but he doesn't treat all of them as such. Electro, Rhino, Scorpion, and others all consider Spider-Man their most hated foe, but compared to the Goblin, Venom, or Doc Ock, Spidey regards these guys more like superpowered nuisances. Also, remember that being the Big Bad does not automatically make a villain the hero's arch enemy.\\nBeware of letting an Arch Enemy fall victim to Villain Decay.\\nSee also Breakout Villain, for those instances when a run-of-the-mill villain ascends to Arch Enemy status.\\nNot to be confused with various works known as Nemesis. Also not to be confused with the Swedish melodic death metal band. Technically, the word \\\"nemesis\\\" originally referred to an agent of divine justice or retribution for egotistical thinking; thus Batman could be described as Joker's nemesis, but not vice versa.\\nThe Arch Enemy is more prone to certain tropes than the common villain:\\n\\n Animal Nemesis\\n Antagonist in Mourning\\n Break Them by Talking\\n Cain and Abel\\n Chronic Villainy\\n Classic Villain\\n Create Your Own Villain\\n Driven by Envy\\n Enemy Mine\\n Evil Counterpart\\n Evil Former Friend\\n Evil Versus Evil\\n Friendly Enemy\\n It's Personal with the Dragon: When The Dragon rather than the Big Bad is the arch enemy in question.\\n Joker Immunity\\n Not So Different\\n The Only One Allowed to Defeat You\\n Pick on Someone Your Own Size\\n The Resenter\\n Rival Turned Evil\\n Supervillain\\n Unknown Rival\\n Villain Takes an Interest\\n Worthy Opponent"
    },
    "name": "Arch-Enemy",
    "rdf_element": "ArchEnemy/int_22133ffc",
    "short_name": "ArchEnemy",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ArchEnemy"
  },
  {
    "categories": [
      "CharactersAsDevice"
    ],
    "descriptions": {
      "TheGoonies": "Brand in The Goonies. He spends the first act of the film trying to keep his little brother and his friends in line, but he eventually gets swept up in the adventure as much as the rest of them.",
      "general": "Typically, a main or recurring character who regularly interacts with characters noticeably younger, usually resulting in their maturity level regressing to roughly the same level (if not even lower). They're still capable of acting their age... they just usually don't.\\nThis character shows up most often in anything aimed at younger audiences, where they are Played Straight so as to be more appealing to kids. When Played for Laughs, it's to show an immature or silly character.\\nWhen examples of this trope show up in shows where they are above the Competence Zone of the rest of the cast, they tend to be teachers, which often yields Sensei-chan.\\nContrast with Wise Beyond Their Years, as One of the Kids is rarely treated as any kind of authority, because of their casualness they often do not even earn special respect.\\nRelated to, but not to be confused with, Man Child."
    },
    "name": "One of the Kids",
    "rdf_element": "OneOfTheKids/int_22133ffc",
    "short_name": "OneOfTheKids",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/OneOfTheKids"
  },
  {
    "categories": [
      "DeathTropes"
    ],
    "descriptions": {
      "TheGoonies": "Averted in The Goonies when Sloth remains behind to hold up the boulder so the kids can escape, but then later makes it out (with his Ma, like a good son, even though she had been bad).",
      "general": "A specification of the Heroic Sacrifice. Things are going really well for our heroic party: the infiltration in the Big Bad's evil fortress of doom is advancing steadily and without a problem. Then, suddenly, things take a turn for the worst: the villain turns some phlebotinum-powered device on the heroes, or a dangerous foe long thought dead has reappeared and is endangering not only the quest of our heroes but their very survival. What happens then? \\\"Not to worry, you go ahead, I\\u00B4ll deal with this inconvenience!\\\" Famous words... and usually the last. For reasons unknown, the largest man of the crew will usually be the one who does the sacrificing.\\nWhenever there are characters in a show, book, etc., the biggest/ strongest/ most massive one will be, against common sense, the first to die, usually saving the rest of the crew so they can go on and finish their epic quest.\\nSimilar to The Worf Effect, only in that trope a) it's the tough one who's affected (often The Lancer or a Sixth Ranger instead of The Big Guy), b) he usually survives, and c) the Big Guy Fatality Syndrome normally goes at the end of a book, series, whatever, while The Worf Effect goes at the beginning. If they're The Big Guy in the Five-Man Band, or female, or both, they're less likely to die. When this happens to a Husky Russkie, it is a clear indication of Russian Guy Suffers Most at work. Also can overlap with Black Dude Dies First if the big guy is a Scary Black Man.\\nSee also Vasquez Always Dies, a related Always Female trope where the more badass of two leading female characters will always be the first to go. Since strength is associated with masculinity, see Men Are the Expendable Gender.\\nOften an early step in a Dwindling Party situation.\\nAs a Death Trope, all Spoilers will be unmarked ahead. Beware."
    },
    "name": "Big Guy Fatality Syndrome",
    "rdf_element": "BigGuyFatalitySyndrome/int_22133ffc",
    "short_name": "BigGuyFatalitySyndrome",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/BigGuyFatalitySyndrome"
  },
  {
    "categories": [
      "MadnessTropes"
    ],
    "descriptions": {
      "TheGoonies": "Andy of The Goonies flips her shit and begins babbling nonsense about \\\"having a beautiful body\\\" shortly before the group encounters the corpse of Chester Copperpot... which doesn't help the situation.",
      "general": "In Real Life mental illness is rarely pretty but in fiction, there's just something about a lovely young woman, often with long, disheveled hair, running around babbling lyrically about the strange visions flashing through her deranged mind, singing creepy little rhymes, scattering flowers and occasionally bashing people's heads in.\\nMaybe this particular cutie was just broken particularly hard, maybe it was an illness or maybe she was born that way, but the result is the same, a tragically beautiful, ethereal waif who's mad as a box of frogs. Her beauty is an important point here, underlining her fragility and the sadness of her fate. She usually talks in riddles and rhymes, can be sad or joyfully happy (or switch between these states). Her mind may be so far gone that she's likely to murder people, but she'll always have clear skin while doing it. Sometimes, too, she has important knowledge the sane may lack, in which case she'll often have terrible trouble getting anyone to listen (a classical example of Mad Oracle). The original Cassandra from The Iliad was often depicted as a bit of an Ophelia.\\nIt's difficult to pin down the appeal of this trope. Perhaps a strange young maiden communing with nature harkens back to earlier figures like nymphs or pagan witches. Perhaps there is an underlying Fetish Fuel at the thought that a crazy girl might be crazy amazing in the sack. Or perhaps there's something endearing to men about cradling a girl in your arms and protecting her from the demons in her own head.\\nThere's often a surprisingly artistic bent to The Ophelia's madness; she may sing, dance wildly, or try to paint her delusions. She may be a Woman in White, and look extra ghostly and wraithlike. The Ophelia is often tied to nature (including walking around barefoot, wearing flowers, etc.), particularly water, probably as a nod to the original Ophelia (in William Shakespeare's Hamlet) who winds flowers in her hair before drowning herself. That last bit can overlap with Instant Oracle, Just Add Water if she's also a Waif Prophet and/or a Mad Oracle.\\nThe Victorians fell crazy (so to speak) in love with this trope and Ophelias in the form of wronged maidens and deranged brides go pirouetting and flower-strewing through art, poetry and literature of the period while the \\\"mad scene\\\" for the soprano heroine became a staple of opera. Insanity was linked to female sexuality and desire for independence. (Not coincidentally, the vibrator was invented in this same period as a treatment for hysteria in women.) In fact, psychiatrists at that time used to encourage female patients in madhouses \\u2014 especially if they were youthful and pretty \\u2014 to dress the part and carry sheaves of flowers.\\nIf a male character is shown the same way, odds are good he's very feminine and delicate-looking anyway.\\nCompare/contrast with Nightmare Fuel Station Attendant, Cloudcuckoolander, Fainting Seer, Axe Crazy, Mysterious Waif, Waif Prophet, Hysterical Woman. For the (usually) \\\"harmlessly kooky\\\" variant see Manic Pixie Dream Girl and Perky Goth. See Cute But Psycho when mental issues are not part of the appeal.\\n\\nExamples"
    },
    "name": "The Ophelia",
    "rdf_element": "TheOphelia/int_22133ffc",
    "short_name": "TheOphelia",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TheOphelia"
  },
  {
    "categories": [
      "Plots"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies. Mikey leads the Goonies with the centuries-old map hoping it still leads to Pirate Booty.",
      "general": "Follow the map, dig up the treasure, get rich \\u2014 A Simple Plan which seldom works.\\nFirst, the heroes have to find the map. If they're lucky, someone will conveniently drop dead at their feet with the map on them; if they're less lucky it will have been hidden in some old heirloom. If they're really unlucky, it'll have been cut up into pieces, each held by a different group of treasure hunters; the heroes will have to collect all the pieces before they can even start looking for the treasure.\\nNext, they'll need to find the starting point, the right tropical isle or hidden cave. Getting there may be an adventure in itself. Once there, the heroes have to find the actual location of the treasure. This can be as simple as \\\"X marks the spot\\\", or \\\"fifteen paces south of the dead pine\\\" (though might find that fifteen paces for one of their group doesn't cover the same distance for another) upto having to navigate a Bamboo Technology Death Course, with only cryptic comments scrawled on the map to help them find the safe route through. If Status Quo Is God either the treasure will turn out to be worthless or the heroes will have to abandon it for the greater good.\\nExpect at least one group of antagonists to be on the heroes' heels throughout all this.\\nThe treasure can range from criminal loot and pirate gold to ancient temples and powerful MacGuffins. The heroes will never think about handing it over to the authorities.\\nThe Adventurer Archaeologist will often come across treasure maps. This trope is also a form of A Macguffin Full Of Money.\\nA Treasure Map does not always have to be a literal map, as in topographical chart. Encrypted messages often form an essential part of a Treasure Map, and sometimes an encrypted message is the map.\\nIf it turns out that the map isn't real, it's a Fool's Map. In a series that doesn't usually feature this plot, see the Sub-Trope Treasure Hunt Episode.\\nSee also Never Win the Lottery.\\n\\nExamples"
    },
    "name": "Treasure Map",
    "rdf_element": "TreasureMap/int_22133ffc",
    "short_name": "TreasureMap",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TreasureMap"
  },
  {
    "categories": [
      "CharactersAndCasting"
    ],
    "descriptions": {
      "TheGoonies": "Actress Lupe Ontiveros estimates she's played over 150 maids in her acting career (including Rosalita in The Goonies). Ontiveros is a graduate of Texas Women's University, with majors in psychology and social work. She narrated a documentary called Maid in America.",
      "general": "Throughout history, there have been stereotypes that certain ethnicities are more prevalent in menial labor such as maids and farmhands. This stereotype is often an exaggerated case of the truth: Certain minority groups have indeed been over-represented in menial jobs due to a variety of factors. In Politically Correct History this will be carefully sidestepped, but in accurate or exaggerated Period Pieces and Historical Fiction, the older versions of this trope can still be found.\\nIn modern incarnations, the ethnic group is often a kind of Acceptable Target.\\nIn the United States\\nThe Irish Laborer\\nIrish immigrants to the United States were often considered \\\"backwards\\\" and only fit for menial labor. This led to many of them having no choice but to accept such jobs. Female immigrants often worked as washerwomen or maids; the term \\\"bridie\\\" or \\\"bridget\\\" meaning \\\"maid\\\" stems from their prevalence in that field. Males worked on farms, on the railroads, and at similar, back-breaking tasks. They continued this role far into the next period, working alongside the Black slave and later Black Laborer. (In the ante-bellum Deep South, they were hired slave overseers.) They often did jobs considered too dangerous for slaves\\u2014after all, once the slave trade was abolished and the only way to get more was to breed them, a slave became a valuable investment, while Irishmen were dime-a-dozen, and more were coming over all the time.\\nIt wasn't until the early part of the 20th century that the Irish were finally seen as \\\"white\\\" (for centuries they were seen as a completely different race from the English) and thus finally began to cast off a lot of the explicit racism held against them (many businesses had so-called NINA rules, an acronym for No Irish Need Apply). Like many previously discriminated communities facing a new level of upward mobility, the Irish joined the police force in record numbers in the hopes of improving their reputation in the community \\u2014 Officer O'Hara is a subtrope of this; it's also the reason older media refer to police cars as \\\"Paddy Wagons.\\\"\\nIn Britain, a similar stereotype for the male Irish workman emerged, as most of England's canal network in the Industrial revolution was made by Irish labour teams (as it was cheaper). The slur \\\"Navvie\\\" refers to this stereotype and is highly insulting to many Irishmen today.\\nOnly very old media covered this trope at the time, although you can still find it in Historical Fiction and Period Pieces that are trying for historical accuracy.\\nThe Chinese Laborer\\nDiscrimination relegated most Chinese immigrants to menial labor after they entered the United States. This trend was mostly contemporary with the Irish Laborer. The Chinese suffered especially hard in the 1870s, when legislation denied them the basic rights of citizenship based on their ethnic origin.\\nSome of this can still be found to this day with the Chinese Launderer. The most commonly seen historical figure is the Chinese Railroad Worker, although the girl illegally imported and sold into prostitution can be seen in media representing the early 20th century, as well.\\nThe Black Laborer\\nBlack Americans released from slavery often had to accept positions as menial laborers. The reasons for this were both a lack of training and deep-seated prejudice that kept them from rising higher in society. This would continue until after the Civil Rights Movement.\\nLiterature from this period will often evoke this trope.\\nOne recurring figure from this period is the Mammy, a nursemaid who would continue to provide an important mothering role well into adulthood. The Black Maid, Black Farmhand and Black Railroad Worker are also common. There are a lot of parallels between Mammy types and Magical Negroes.\\nThe Hispanic Laborer\\nA combination of political correctness and a movement toward this ethnic group genuinely become overrepresented in menial labor has shifted modern media to the Hispanic Laborer. Latin immigrants to the United States tend to be poorer than most, and thus rarely have the education necessary for jobs above the service industry. For illegal immigrants, their choices are even narrower: They must take jobs that can be paid under the table. This has led to a disproportionate number of Hispanics in jobs involving manual labor, especially in states bordering Mexico. Since California is where most of those movies and TV shows are made, this trend is carried over into modern media, though good luck finding any Latin characters even in shows that are set in L.A., a city that now is more than 50% Hispanic.\\nHispanic Laborers will always have a thick Mexican accent and will be prone to sprinkle their (sometimes unusually precise) English speech with Spanish words or sentences. Alternatively, they will not speak English at all. Latino Is Brown is likely to be played straight. The most common variant is the Hispanic Maid. Also often seen are the Hispanic Pool Boy, Hispanic Farm/Ranch Hand, Hispanic Busboy/Dishwasher and Hispanic Gardener.\\nNote that if the employer is Hispanic, the laborer will be of any ethnicity but Hispanic.\\nIn Europe\\nEastern European Laborer\\nBritain, by virtue of having one of the most open policy toward immigration from the 2004 EU entries (second only to Ireland and Sweden), also has a lot of manual labourers and tradesmen from Eastern Europe, mostly Poland but with a sizable minority from Lithuania and Slovakia. Contrary to popular belief, most are expatriates rather than immigrants, arriving in the country with the intention of working for a few months and then returning home. At one point there were believed to be more than a million migrant workers in the United Kingdom; there are fewer nowadays as the source countries have become more prosperous, making it less profitable to work here. They show up or are referenced in quite a few works set in post-2004 Britain; fictional examples are almost invariably Polish.\\nThis stereotype can also be seen in the United States with the au pair nanny, who is not menial in reality, but is often treated so in fiction. She is a young European girl, usually Swedish, Norwegian, or Finnish, for some reason. Occasionally she'll be German or French (or some flavor of Caribbean). Germans and French were more common in the post-World War II period through the 1970s, as those countries were still rebuilding their ruined economies and a trip to America was a good way to get ahead.\\nNorth African Laborer\\nBy virtue of the proximity of Spain, France, and Italy to North Africa, and the colonial links between them (Algeria and Tunisia were French colonies, Morocco was a joint French and Spanish colony, and Libya was an Italian colony), the stereotypical immigrant laborer in these countries is an Arabic-speaking North African. Many of them are illegal immigrants, but most are in the country legally; many are there on temporary work visas and intend to return home rather than stay permanently. Stereotypes of these are a peculiar mix of what Americans think of menial black labor and general Arab/Muslim stereotypes (i.e. covered women, bearded men, and general religious fanaticism), although the latter bit is only true of a small segment of the population.\\nContrast Meido, a maid who is invariably the same race as her employers (or at the very least some flavor of Japanese)."
    },
    "name": "Ethnic Menial Labor",
    "rdf_element": "EthnicMenialLabor/int_22133ffc",
    "short_name": "EthnicMenialLabor",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/EthnicMenialLabor"
  },
  {
    "categories": [
      "ILikeSwords"
    ],
    "descriptions": {
      "TheGoonies": "Joey Pants' character pulls one on The Goonies when confronting them at the waterfall. He doesn't even bother with any fancy opening tricks and simply unfolds it because, hey, pulling a knife on a bunch of kids is probably going to scare them anyway.",
      "general": "The butterfly knife, also known as a balisong, is a traditional Filipino knife. Its design, with two rotating handles, allow it to be flipped open and closed. It will usually appear in the hands of a Knife Nut, who will perform a complex, flashy and noisy flip. Anything beyond a simple and quick opening is Awesome but Impractical as the hand is vulnerable to a strike disarm throughout the manipulation. Less frequently, a character will flip one open without fanfare and use it to cut something.\\nThe most common and recognizable design is skeletonized: holes in a line along each handle. The holes reduce mass, control balance, and add grip. Traditional balisongs incorporate wood into their handles with brass accents.\\nNote that butterfly knives are illegal in many jurisdictions, although \\\"practice\\\" balisongs (i.e. with a blank piece of unsharpened metal instead of a blade) usually aren't.\\nNot to be confused with butterfly swords, which are single-edged short-swords that are dual-wielded and used in Chinese Kung Fu."
    },
    "name": "Butterfly Knife",
    "rdf_element": "ButterflyKnife/int_22133ffc",
    "short_name": "ButterflyKnife",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ButterflyKnife"
  },
  {
    "categories": [
      "LanguageTropes"
    ],
    "descriptions": {
      "TheGoonies": "Sloth from The Goonies. \\\"Sloth love Chunk!\\\"",
      "general": "This speak type for character has more muscle than brain.\\nThey substitute \\\"Me\\\" for \\\"I\\\", or else refer to themselves in third person. They put special emphasis on nouns and verbs, and most extra parts of the sentence are lost. If any name is too long, it gets substituted with a cruder name/description (often \\\"(Descriptive adjective)-man or -lady\\\"). They also skip any and all articles (\\\"a,\\\" \\\"an,\\\" and \\\"the\\\"). Favored words include \\\"Smash\\\", \\\"Puny\\\", and \\\"Blank-thing\\\" (e.g. \\\"HULK SMASH PUNY LIZARD THING!\\\" when fighting a velociraptor). Yes, the all-caps is necessary. The primary differences between Hulkspeak and Baby Talk are usually at least six feet and 300 pounds.note\\u00A0No, Baby Talk has nothing to do with octopi that recently won a lottery in Europe.\\nThe most important characteristic of Hulk Speak is its minimalism. The format is usually, \\\"Me, (the person speaking) (verb) (subject).\\\"\\nPrepositions, indefinite, and definite articles are almost completely stripped out; although given how redundant these usually are, (particularly the latter) in many cases the effect makes Hulk Speak easier to understand than plain English, at least when only a single subject is being discussed. In this sense, Hulk Speak could be considered a literal English translation of the Klingon language, which as you might expect, uses a very similar structure.\\nThis is a common trait of Frankenstein's Monster, especially in adaptations of Frankenstein \\u2014 although, in the original novel, the monster spoke perfect French. This is also typical of cavemen. (The Hulkspeak, not the perfect French.)\\nThere is also a version sometimes seen in Japanese works (albeit not quite as often as in those written in English), where a character (usually a Funny Foreigner or Raised by Wolves type) is shown to speak in a somewhat broken fashion. Although still retaining the use of pronouns, they will often miss words used to bridge sentences and come off as simple or uneducated. English translations (particularly those written by Trish Ledoux), have a tendency to render this \\\"broken Japanese\\\" as out and out Hulk Speak.\\nSometimes this dialect will spoof itself, with the character referring to complicated issues. (\\\"Mongo only pawn in game of life.\\\") Consistent with this, characters who use Hulk Speak often have surprising levels of intelligence and philosophical depth. In a sense, it could even be said that their form of speech is an intellectual advantage, as it allows them to simplify complex ideas.\\nAs with The Ditz, an easy way to derive humor from a character using Hulk Speak is to occasionally give them lines expressing more complicated concepts than their usual diction would imply they were capable of grasping. E.g. Thog's first line here and Draak's bit here.\\nThe trope's name is derived from the speech pattern of Marvel's Hulk.\\nContrast with Genius Bruiser and Spock Speak: the former is when a big tough guy is highly intelligent, the latter is when someone speaks with an excessively stiff, formal language. The Genius Bruiser will sometimes use Hulk Speak to hide his intelligence. You No Take Candle is when a foreign character, usually as a result of poor grasp of English, speaks like this. When trying to describe more complicated concepts, will often overlap with Buffy Speak. Compare Pok\\u00E9mon Speak where the only thing a character says is his or her name."
    },
    "name": "Hulkspeak",
    "rdf_element": "Hulkspeak/int_22133ffc",
    "short_name": "Hulkspeak",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/Hulkspeak"
  },
  {
    "categories": [
      "IndexOfGothicHorrorTropes"
    ],
    "descriptions": {
      "TheGoonies": "The Goonies, set in Astoria, Oregon",
      "general": "The Pacific Northwest of the United States and Canada. When people talk about the Rainforest, they invariably mean the tropical one in Brazil, but the Pacific temperate rainforest is the largest in the world by area, and stretches from northern California upwards to Alaska. There are also American tropical rainforests in Hawaii and Puerto Rico.\\nThis part of the Hollywood Atlas is home to magnificent forest scenery, Vancouver, mountain lions, a couple other lions, Bigfoot, log cabins, lumberjacks, and sad-eyed Native Americans delivering Green Aesops. Oh, and crazy people who live in shacks, write manifestos, and send letter bombs. Also expect to see Hippies. Alternatively, we may get a beautifully forested small town, which turns out to be a City of Adventure, usually for the local Kid Heroes, who may subjected to a Horrible Camping Trip. (Note the \\\"rain\\\" part of \\\"rainforest\\\".) This area may also be a Wild Wilderness with very little contact to the outside world because the only city in this region Hollywood seems to know about is Seattle, home of the Space Needle and Starbucks.\\nAs home to Microsoft and its founder Bill Gates, and with Nintendo of America down the block and to the left, the Seattle area is the 'cool' alternative location for tech people. Occasional recognition is given to Boeing. If Oregon ever gets a city, it will be Portland, which is often stereotyped as being populated by hipsters and Granola Girls. Funny thing is, despite Seattle being known as a tech city, Portland is a major center for computer manufacturing, with many Silicon Valley companies such as Intel moving their manufacturing north due to cheaper utilities, wages, and land prices. Another notable company in the area is Nike, whose world campus is in Beaverton, a suburb just west of Portland.\\nWhenever something is supposedly set in Washington, you can almost guarantee it is Vancouver Doubling. However, due to good union contracts it's becoming more common for it to be doubled in Oregon. This may change in the next few years as Washington State has recently passed tax breaks and other incentives for filmmakers, as well as the Canadian and American exchange rates and labor laws making the States an equally valid choice.\\nAlso, beyond the Cascade Mountains, vast stretches of Central and Eastern Oregon, Washington, and British Columbia are not in any way a rainforest (and the residents tend to be far more conservative politically.) Much of Eastern Oregon is desert or semi-arid, described by some as \\\"the closest you can get to the Wild West and still have cable\\\", while Eastern Washington is largely rolling plains similar to those in Idaho and the Midwest. The latter area is home to the majority of America's apple production, as well as the Grand Coulee Dam on the Columbia River, the largest dam in the United States (and at one point the largest dam in the world). Eastern Washington is home to the state's second-largest city, Spokane, whose suburb of Mead is home to Cyan, the developers behind Myst. Plutonium for the U.S. nuclear arsenal is produced on the Hanford Reservation (rather than Oak Ridge or Los Alamos). Eastern BC includes the Okanagan Valley, a major orchard and winery region, as well as a few different mountain ranges."
    },
    "name": "The Other Rainforest",
    "rdf_element": "TheOtherRainforest/int_22133ffc",
    "short_name": "TheOtherRainforest",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TheOtherRainforest"
  },
  {
    "categories": [
      "PersonalAppearanceTropes"
    ],
    "descriptions": {
      "TheGoonies": "One classic example of a particularly ugly Gonk is \\\"Sloth\\\" of The Goonies fame. His Gonk-ness was actually so striking, his initial appearance was enough to shock and initially terrify one of the protagonists, \\\"Chunk\\\", before he was later revealed to be a Gentle Giant.",
      "general": "Pretty much the only way in animation to make someone ugly or unusual looking is to do it deliberately and without subtlety. If a character is not attractive looking, they're usually absurdly ugly. The result can be extremely jarring if it deviates too much from the rest of the show's look, although it tends to be more tolerated in comedies and non-human characters.\\nThis is because of Generic Cuteness. Occasionally, Artistic Age means that Gonk has to be applied to make older characters seem downright decrepit in order to seem older than the generically young cast. Compare No Cartoon Fish and Nonstandard Character Design.\\nOf course, beauty is in the eye of the beholder, and some Gonks may be viewed as rather cute to certain viewers.\\nPlease note: While it is possible for characters to be \\\"Gonk-ified\\\" at some point, it's usually only temporary. Real Gonks look ugly by default.\\nNot to be confused with a popular 60s and 70s toy. They fall in a better category. Nor is this to be confused with the Gonk and Geefle from Sesame Street. Or the power droids from Star Wars. Or a piece of stock music that was best used in Dawn of the Dead."
    },
    "name": "Gonk",
    "rdf_element": "Gonk/int_22133ffc",
    "short_name": "Gonk",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/Gonk"
  },
  {
    "categories": [
      "IndexedAndNerdy"
    ],
    "descriptions": {
      "TheGoonies": "Mikey in The Goonies has one that he throws away at the end of the movie, insinuating that now he's had adventures he's less nerdy. This is probably justified due to the fact that he was misusing it before, and has realized it's time to stop focusing on his weaknesses if his life is going to move forward. Treating an inhaler like a security blanket leads to over-medication, and ultimately, worse asthma.",
      "general": "In fiction, having to use an inhaler at all immediately alerts the audience that this person is a nerd. It is rare or almost impossible to see anybody considered to be cool using one.\\nThis is usually not Truth in Television, because whether or not you need to use an inhaler has little to no bearing on your personality. However, if you have asthma or some other kind of breathing problem, it might prevent you from participating in strenuous sports, fitting with the nerdy stereotype. This probably accounts for the association.\\nBefore inhalers, some people with weak health/lung problems (notably Robert Louis Stevenson and H. G. Wells) turned bookworm to entertain themselves when confined to bed and ended up with literary careers. Improved technology (visual media and inhalers) now gives us this trope as visual shorthand.\\nA Sickly Neurotic Geek is also likely to use an inhaler. Compare Geek Physiques."
    },
    "name": "Nerdy Inhaler",
    "rdf_element": "NerdyInhaler/int_22133ffc",
    "short_name": "NerdyInhaler",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/NerdyInhaler"
  }
]