[
  {
    "categories": [
      "Trivia"
    ],
    "descriptions": {
      "TheMagnificentSeven": "The Magnificent Seven and The Good, the Bad and the Ugly have a Jewish American actor and a native New Yorker (Eli Wallach,) playing Latino characters in Wild West settings. He would play another Latino character, Max Lozoya, in the '71 Western Don't Turn the Other Cheek, and a Greek-Cherokee-Mexican bandit Cacopoulos in the '68 Western Ace High. He also played the Greek Stratos in The Moon Spinners. Not to mention Italian American Guido in The Misfits.",
      "general": "When an actor plays a native of a nationality or area other than their own. Not counting those actors who play an extraterrestrial, who are never from the same place as their character. Probably.\\nIsraeli and Arab actors tend to wind up playing each other quite frequently (though Israeli-for-Arab is more common than the other way around). Gung-ho movies made during World War II featured every kind of Asian except Japanese, since the Japanese-American actors were otherwise occupied. And very few Russian characters during the Cold War were played by native Russians. For foreign actors who are frequently employed to play foreign characters, see Plays Great Ethnics.\\nThe most common examples have their own tropes: Fake American, Fake Brit, Fake Irish, Fake Scot, Fake Russian, Yellowface, Brownface, and Fake Mixed Race. See also: Fauxreigner where the character is pretending to be a nationality they aren't (or acting more stereotypical than they actually usually do).\\nIf you are actually from the area in question, you may remember one or more of these examples as \\\"That foreigner with a strange accent. Where are they supposed to be from?\\\" On the other hand, some actors are really good at it. An added complication is that human appearance varies even within nationalities and ethnicities as a result when playing a historical character the foreigner might have been selected because s/he greatly resembled the original.\\nOften the result of the WTH, Casting Agency? or the desire for a director to have someone who speaks his or her language in the cast.\\nSee Pass Fail when, for whatever reason, the actor isn't convincing as another nationality."
    },
    "name": "This entry is trivia, which is cool and all, but not a trope. On a work, it goes on the Trivia tab.\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\n\\t\\t\\n\\t\\tFake Nationality",
    "rdf_element": "FakeNationality/int_40e0e908",
    "short_name": "FakeNationality",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/FakeNationality"
  },
  {
    "categories": [
      "DeathTropes"
    ],
    "descriptions": {
      "TheMagnificentSeven": "Lee's death in The Magnificent Seven",
      "general": "A classic way to show someone is dying. They have been shot, stabbed, poisoned, whatever, and then, recoiling from the wound, back into a wall and sink slowly to the ground. A smear of blood trailing down the wall is customary.\\nCan also be used to show a character is in shock or depressed (generally without the blood).\\nThis is commonly used in theatre, because it's a good visual cue for the audience. It's also a reasonably cool death, combining Slow Motion Fall and Rebel Relaxation.\\nAlso see Headdesk and Face Palm, two variations of the \\\"extremely frustrated\\\" version.\\nUnmarked Spoilers ahead, as this is a Death Trope."
    },
    "name": "Wall Slump",
    "rdf_element": "WallSlump/int_40e0e908",
    "short_name": "WallSlump",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/WallSlump"
  },
  {
    "categories": [
      "WeaponsAndWieldingTropes"
    ],
    "descriptions": {
      "TheMagnificentSeven": "The Magnificent Seven features Britt, a quiet man with a deadly fast, deadly accurate throwing arm. Challenged to a Duel to the Death by a Sore Loser of a speed contest, he effortlessly dispatches the gunslinger with a single lethal throw.\\n Subverted in the final battle. After running out of bullets Britt draws his knife, and is shot and killed before he can throw it.",
      "general": "You think that Never Bring a Knife to a Gun Fight always applies, right?\\nNot necessarily.\\nAt times, either the knife-wielder is just so good, or the gun-wielder is just so bad, that the knife-wielder actually has the upper hand here.\\nTruth in Television in certain circumstances; as the Real Life section notes.\\nSubtrope of Implausible Fencing Powers and Heroes Prefer Swords. Contrast Never Bring a Knife to a Gun Fight. Related to Guns Are Worthless."
    },
    "name": "Never Bring a Gun to a Knife Fight",
    "rdf_element": "NeverBringAGunToAKnifeFight/int_40e0e908",
    "short_name": "NeverBringAGunToAKnifeFight",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/NeverBringAGunToAKnifeFight"
  },
  {
    "categories": [
      "Trivia"
    ],
    "descriptions": {
      "TheMagnificentSeven": "In a slight inversion of this, the main characters of The Magnificent Seven included Steve McQueen, Charles Bronson, James Coburn, Eli Wallach and Robert Vaughn \\u2014 but at the time the film was made, only Yul Brynner was really an established star.",
      "general": "Any show, movie, etc., where the majority of the lead roles are played by big-name actors. They don't have to be A list. B, C, and even D will do, although in that case, relying on their talents is preferable to relying on their names. If the character list is really big, this can spill over into supporting roles as well.\\nIn the days of the studio system, this was easy to do, but once actors' salaries started rising, this practice gradually declined. Compare the casts at the beginning of the Disaster Movie Era with those at the end of it.\\nThese days, you'd either need a lot of money to pull this off, convince the actors that this is just a fun breather film or be willing to settle for loads of cameos. The exception is animated films, where stars are willing to get paid a lot less just to do voice work.\\nA good way of being able to tell if it is an all star cast is by an examination of the theatrical poster, if it has more than five names listed on it it is usually big names.\\nRoger Ebert referred to films with All-Star Casts as \\\"Box Pictures\\\" due to the tendency (at least in the '70s) to display headshots of the cast in little boxes on the poster.\\nCompare Massive Multiplayer Crossover, Celebrity Voice Actor, Dream Team. Contrast Amateur Cast.\\n\\nExamples"
    },
    "name": "This entry is trivia, which is cool and all, but not a trope. On a work, it goes on the Trivia tab.\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\n\\t\\t\\n\\t\\tAll-Star Cast",
    "rdf_element": "AllStarCast/int_40e0e908",
    "short_name": "AllStarCast",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/AllStarCast"
  },
  {
    "categories": [
      "Trivia"
    ],
    "descriptions": {
      "TheMagnificentSeven": "The Magnificent Seven became a TV series in 1998, thirty-eight years after the movie.",
      "general": "The unplanned version of the Pilot Movie, mirror image of The Movie. From time to time, someone in Hollywood will see a popular movie, and get the bright idea to turn it into a weekly series.\\nUnlike the Pilot Movie, no plan to do this existed at the time the original movie was made. As a result, Adaptation Decay runs rampant; in particular, it may be necessary to perform a substantial Retcon on the end of the film, as a self-contained film would generally tie up its concept in such a way that the premise of the series would be preempted. An alternative strategy would be to tell an altogether different story, set in The Verse of the movie. Of course, the more open-ended the film plot, the easier this is. Sometimes, the series will claim to be a prequel to the film, though this idea can run into trouble if the show goes on long enough that the two crash into each other. Especially common in recent years are series that borrow nothing more than the basic premise of the movie, and go from there.\\nExpect a substantial downgrade in visual effects. Also, a whole lot of Suspiciously Similar Substitutes or The Other Darrin, as the talent available for a big-budget Hollywood movie is a somewhat different pool from that for a weekly series.\\nAnimated Adaptations are common here, especially for movies created for adults but with significant kid-demographic overlap. Mind you, while there are plenty of cartoons for adults, these... won't be.\\nIf the movie has a sequel, it usually won't acknowledge the series; the reverse may or may not be true.\\nAs unlikely an idea as it sounds, there are a surprisingly large number of highly successful examples, some of which have even exceeded the original film in popularity. Unfortunately, those tend to dwindle next to the far larger number of shows that make you wonder what the heck \\\"someone in Hollywood\\\" was thinking (similar to the effect of watching an Animated Adaptation).\\nCompare or overlaps with Artifact Title."
    },
    "name": "This entry is trivia, which is cool and all, but not a trope. On a work, it goes on the Trivia tab.\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\n\\t\\t\\n\\t\\tRecycled: The Series",
    "rdf_element": "RecycledTheSeries/int_40e0e908",
    "short_name": "RecycledTheSeries",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/RecycledTheSeries"
  },
  {
    "categories": [
      "StockPhrases"
    ],
    "descriptions": {
      "TheMagnificentSeven": "The Magnificent Seven:",
      "general": "Someone does something that puts them, or the people around them in a bad or unpleasant situation. Hindsight reveals that although they had good intentions, their actions were not in their best interests.\\nIf questioned about why they did it, they'll often respond with the reason for everything that has ever been done by anyone at any time and any place: \\\"It seemed like a good idea at the time!\\\".\\nThis is also used sometimes as an explanation for Chaotic Neutral or Chaotic Stupid actions. Contrast I Did What I Had to Do, which does the same as in this case, but for Lawful Neutral or Lawful Stupid actions and their moral, rather than strategical, consequences. Often goes hand in hand with Alcohol-Induced Idiocy for obvious reasons. If the plan somehow still works \\u2014 and is stated or implied to work not despite but because of how ridiculous it seems \\u2014 that's Refuge in Audacity.\\nCompare the situational trope, Nice Job Breaking It, Hero, as well as Didn't Think This Through."
    },
    "name": "It Seemed Like a Good Idea at the Time",
    "rdf_element": "ItSeemedLikeAGoodIdeaAtTheTime/int_40e0e908",
    "short_name": "ItSeemedLikeAGoodIdeaAtTheTime",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ItSeemedLikeAGoodIdeaAtTheTime"
  },
  {
    "categories": [
      "DerivativeWorks"
    ],
    "descriptions": {
      "TheMagnificentSeven": "The Magnificent Seven was Seven Samurai IN THE OLD WEST! Then Roger Corman made Battle Beyond The Stars, which is The Magnificent Seven IN SPACE!! (It even has Robert Vaughn playing a character who's essentially and Expy of his character in the western version.)",
      "general": "Adaptations of old stories will frequently move them closer to the production in time and/or space, even if the original is only a couple of decades old, in a Derivative Works kind of Creator Provincialism.\\nDistinct from Recycled INSPACE in that the purpose is to make the story more familiar and accessible, whereas that trope is often based around transplanting a story into a less familiar setting. Also, by its nature, a Setting Update is typically made long after the original, whereas a Recycled Premise is usually a Me Too made to cash in on hot demand. Sometimes, especially with the more radical changes, it can be a genuinely clever analogy.\\nA Setting Update can still be described with IN SPACE! style, though, since that usually isn't all that's changed.\\nRelated to Comic-Book Time for long running series. Also related to Retcon."
    },
    "name": "Setting Update",
    "rdf_element": "SettingUpdate/int_40e0e908",
    "short_name": "SettingUpdate",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SettingUpdate"
  },
  {
    "categories": [
      "MediaAdaptationTropes"
    ],
    "descriptions": {
      "TheMagnificentSeven": "The Village Elder in The Magnificent Seven. Chico is a partial example, as he's a composite of two of the main characters of Seven Samurai: Kikuchiyo, who dies, and Katsushiro, who does not.",
      "general": "Both an adaptation trope and a death trope, Spared by the Adaptation refers to cases where a character who died in the source material does not die in the adaptation.\\nThe reasons behind these occurrences vary. Perhaps the Media Watchdogs, Executive Meddling, and/or the creator wanted to make it Lighter and Softer than the original. Maybe the character was a fan favorite and the crew wanted to appease the fan base. Maybe the death stood out as especially pointless, and people in charge took it as a given that life is cruel and unfair so they didn't need to kill a beloved character just to make that point to the audience yet again. Maybe the events where it happens are cut for other reasons. The sky's the limit as for why this happens, which probably explains why it happens so often.\\nLikely to occur during a Gecko Ending where the adaptation is made before the original is even finished.\\nCompare with Schr\\u00F6dinger's Cast where a character's fate is different from the source material, but the source material is still ongoing (which may create the need for the adaptors to do a drastic rewrite if the character in question, or their averted death, becomes important later on in the source material).\\nContrast with Death by Adaptation, where a character dies in the adaptation, but not in the source material.\\nWarning: This is a death (or lack thereof) trope and will contain unmarked spoilers. Read the examples at your own risk.\\n\\nExamples"
    },
    "name": "Spared by the Adaptation",
    "rdf_element": "SparedByTheAdaptation/int_40e0e908",
    "short_name": "SparedByTheAdaptation",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SparedByTheAdaptation"
  },
  {
    "categories": [
      "TheIndexTeam"
    ],
    "descriptions": {
      "TheMagnificentSeven": "The Magnificent Seven",
      "general": "A Badass Family, even if they're not related. This will turn up a lot when discussing the Superhero Team, The Squad, and the Five-Man Band. And a fair number of Sci-fi shows set aboard a ship, since normally, even the baddest hero can't run a whole Cool Ship on their own. This isn't a requirement though.\\nSome general conventions that apply to almost all Badass Crews are:\\n They must include at least two people for obvious reasons. Two badasses might be Back-to-Back Badasses.\\n A Crew typically has a recurring and more-or-less permanent roster; you can reasonably expect to see the same members over and over. Which is why this trope is a fixture of TV shows, comics, and other media which is made of recurring installments. You see this less in movie series, since they're often built around a central character who may have different supporters in each movie, e.g. Die Hard or James Bond. This is probably because it's easier to sign one actor for a film rather than three or five.\\n Most heroes have some sort of support or backup, but in a Badass Crew, everyone must be capable of a Moment of Awesome. In fact a given episode may involve the least badass character doing something so awesome the jaws of the others drop in unison.\\n There's usually one person who acts as The Leader of the bunch.\\n In actual combat, on the battlefield, their combined badassery is indispensable. Not so much in their day-to-day applications on the home front; in fact, since they may also deal with lower-level antagonists that don't directly affect the other crew members, it can be downright messy and embarrassing. This is why, when not on the battlefield, they have to really watch what they tell each other.\\n Most important: the crew must have a certain loyalty toward one another. Like a family. If one of them is hurt/kidnapped/killed the others will bring holy hell on those responsible, even (and especially) if it means violating orders. For this reason, all Badass Crews are a form of True Companions.\\nSince, unlike a Badass Family, none of the members were born into the Crew (though some of them might be blood relatives), some writers will use the story of the Badass Crew's formation as an interesting origin story. In most Action/Adventures and Sci-Fi/Fantasy stories, the badasses came together to foil a Big Bad and/or save the world.\\nThe members of the Crew may not have even liked each other at first or even been outright enemies, but they come together and join forces because a) none of them can defeat the Big Bad and his plot without total cooperation, b) they worked out their differences, c) they see the badassness in each other and recognize a kindred spirit, or d) all the above.\\nThe Badass Crew may be or have been a Ragtag Bunch of Misfits. Amazon Brigade is an all-female variation of this. The logical extension of this is the Badass Army where they are essentially a gigantic Badass Crew. Almost invariably a Caper Crew doubles as a Badass Crew.\\nAlso see Misfit Mobilization Moment, which is often an origin for the Badass Crew."
    },
    "name": "Badass Crew",
    "rdf_element": "BadassCrew/int_40e0e908",
    "short_name": "BadassCrew",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/BadassCrew"
  },
  {
    "categories": [
      "ShowBusiness"
    ],
    "descriptions": {
      "TheMagnificentSeven": "In America, the theme from The Magnificent Seven is always linked to Marlboro commercials (at least, back when cigarette commercials were legal in the U.S.).",
      "general": "A mostly-forgotten song gets used in a prominent movie, TV show, or commercial. Suddenly, it is everywhere. Other shows, movies, and commercials start to use it. A lot. It is back on the radio, maybe even back on the charts. The original album it came from sells like hotcakes. Somewhere, a songwriter makes a lot of unexpected money.\\nAlso known as the \\\"Guitar Hero effect\\\" \\u2014 via the phenomenon of old songs finding a new audience by their inclusion in the game. Can be helped along by Watch It for the Meme, at least in the case of Rick Astley.\\nParticularly successful examples may eventually become Standard Snippets. Might overlap with Breakaway Pop Hit, and often creates a Newbie Boom.\\nSee also The Red Stapler and Song Association, which sometimes involves this as well. Also compare Colbert Bump. Covered Up is when a song is brought back into prominence (well, kind of) because someone else in the music industry referenced it.\\nIronically, if this works really well, the song can remain popular after the work that revived it has been forgotten about."
    },
    "name": "This entry is trivia, which is cool and all, but not a trope. On a work, it goes on the Trivia tab.\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\n\\t\\t\\n\\t\\tRevival by Commercialization",
    "rdf_element": "RevivalByCommercialization/int_40e0e908",
    "short_name": "RevivalByCommercialization",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/RevivalByCommercialization"
  },
  {
    "categories": [
      "CameraTricks"
    ],
    "descriptions": {
      "TheMagnificentSeven": "The Magnificent Seven (1960)\\n And its inspiration Seven Samurai (1954), sort of.",
      "general": "The Power Walk is a wide shot of the main cast, shoulder to shoulder, suited up for battle and looking cool/determined/fierce as they walk towards the camera and often in slow motion. The Power Walk is mostly used in order to convey the unity of the group, as they walk in an orderly fashion in a single line.\\nIt's typically shot from a slightly lower than normal angle to add stature to the characters in the shot. Slo Mo is often used to give the images additional weight. Extra power can be gained from a dramatic backdrop, especially flames or explosions. The walk often continues until the characters are out of frame, and is often followed by an Act Break. Alternatively, it can be preceded by a slow build-up of the group, with just the lead walking at first, then others noticing and hurrying to his/her side one by one.\\nSometimes (especially when used in the opening credits) called a Hero Shot (although there can be other types of hero shots \\u2014 e.g. a shot from a low angle to make a character look larger than life).\\nCan be combined with an Unflinching Walk for extra badassitude. If they're standing still, it's the V-Formation Team Shot.\\nCommonly used as an intro shot of an ensemble cast in TV dramas, e.g. procedurals. It's starting to become a Discredited Trope due to Seinfeld Is Unfunny and the difficulty of actually getting a group of people to do this outside of a parade or a military exercise.\\nBecause the characters are usually just walking somewhere, this is a subtrope of Mundane Made Awesome."
    },
    "name": "Power Walk",
    "rdf_element": "PowerWalk/int_40e0e908",
    "short_name": "PowerWalk",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/PowerWalk"
  },
  {
    "categories": [
      "MartialArtsMovie"
    ],
    "descriptions": {
      "TheMagnificentSeven": "In a scene in The Magnificent Seven Lee's sitting at a table wrestling with his personal demons. Three flies appear by his cup, his hand flashes out and...",
      "general": "A staple of action and superhero movies, Super Fly Reflexes are showcased when a character grabs a fly or other flying insect with his bare hands. Usually this is to show how Badass or well trained a character is. If done with chopsticks, it's an Improbable Chopsticks Skill."
    },
    "name": "Super Fly Reflexes",
    "rdf_element": "SuperFlyReflexes/int_40e0e908",
    "short_name": "SuperFlyReflexes",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SuperFlyReflexes"
  },
  {
    "categories": [
      "GunsAndGunplayTropes"
    ],
    "descriptions": {
      "TheMagnificentSeven": "Britt in The Magnificent Seven is fast with both guns and knives. Early in the movie, he shows just how fast he is by using a thrown knife to kill an opponent who has a gun.",
      "general": "The Fastest Gun in the West has the ultimate Quick Draw. Nobody can draw and fire a gun faster than this guy. As a result, he wins every duel he ends up in, and others tend to be reluctant to fight him.\\nHowever, this fearsome reputation tends to bring unwanted attention. Every two-bit varmint in the state wants to take a piece outta this guy to make themselves more badass. Hence, the Fastest Gun in the West tends to have to keep travelling to try and find a place where nobody wants to fight them.\\nThis character can be a hero or a villain. The heroic type won't bring out his guns unless absolutely necessary, and then only to bring down an outlaw or bandito. The villain is a sneaky bastard who just loves shootin' an' killin', but may be brought low by The Hero's resourcefulness.\\nIf this character ever loses a duel, his mantle passes on to the one that killed him, who must then endure the same curse that the former fastest gun put up with.\\nIt should also be noted that in a cynical or realistic scenario, being the fastest gun in the west is rarely much help if said character is somehow caught off guard. It hardly matters if one can draw faster than one can blink, it's of no use if one never sees the threat coming. Many a lightning fast gunslinger meets their end by a bullet In the Back rather than a Showdown at High Noon.\\nA subtrope of The Gunslinger. Compare World's Strongest Man.\\n\\nExamples"
    },
    "name": "Fastest Gun in the West",
    "rdf_element": "FastestGunInTheWest/int_40e0e908",
    "short_name": "FastestGunInTheWest",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/FastestGunInTheWest"
  },
  {
    "categories": [
      "DeathTropes"
    ],
    "descriptions": {
      "TheMagnificentSeven": "Calvera in The Magnificent Seven goes out trying desperately to understand why. Much of the pathos comes from Eli Wallach being just that good.",
      "general": "So, there's a villain. Right. Murdering, world-conquering type. The series is ending, so it's time to get rid of him. Slowly and painfully. So he goes out with... a final touching quote and a One-Woman Wail?\\nAs odd as it may seem, if you want the audience to feel sorry for a villain, a good death scene is probably the way to go. This works best if you know their Freudian Excuse; Chaotic Stupid need not apply for this sort of thing. Also works best if this is a supporting villain. This is easiest to do with a Big Bad's minions: we can identify with The Dragon, and especially the Quirky Miniboss Squad, over time and may be sad to see them go. If a Fallen Hero dies, expect everyone to weep openly. A few well-chosen Last Words may also be used to create this feeling.\\nNote that if you want the audience to take the scene seriously then it helps to add some humanizing elements to your villain beforehand. See Likable Villain for ways in which this can be done. Neglecting to do this may result in Narm or just confuse the audience.\\nCompare Draco in Leather Pants, Cry for the Devil, What a Senseless Waste of Human Life, Antagonist in Mourning, and Death Equals Redemption. See Monster Sob Story when the villain's death isn't required to garner sympathy. Do not confuse with Alas, Poor Scrappy. Or Alas, Poor Yorick for that matter.\\nAs a Death Trope, several if not all Spoilers will be unmarked ahead. Beware."
    },
    "name": "Alas, Poor Villain",
    "rdf_element": "AlasPoorVillain/int_40e0e908",
    "short_name": "AlasPoorVillain",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/AlasPoorVillain"
  },
  {
    "categories": [
      "CharactersAsDevice"
    ],
    "descriptions": {
      "TheMagnificentSeven": "In the The Magnificent Seven, Bernardo is one of seven gunslingers hired by a Mexican village. The kids call him a hero but he feels the farmers are the real heroes since they work a tough, monotonous job full of responsibility that he never was brave enough to take on, despite his obvious affection for children.",
      "general": "In many works of fiction, the hero does good deeds on a level that would be difficult, if not impossible, for anyone in the real world to emulate. They stop wars, dismantle criminal syndicates, Save The World so often it becomes part of their regular schedule, and never shy away from performing a Heroic Sacrifice (sometimes even giving their lives for the greater good several times). Yet if the hero runs into a firefighter, volunteer worker, or soldier (if they're on the idealistic side of the spectrum), the hero will often make a comment along the lines of, \\\"You guys are the real heroes.\\\"\\nThe idea of such a scene is usually to pay tribute to real life heroes, who may not have their own TV shows or look like supermodels, but still give of themselves to save other people's lives. This is a noble motive on the writer's part, but it can create some problems if the story's Fourth Wall is firmly in place. The characters don't know they're fictional, after all; from their perspective, Superman tossing a nuclear bomb into outer space is no less real than a firefighter saving someone from a burning building. This can make the audience wonder why the story's hero considers him/herself a lesser hero than some guy who's never even saved the world once. If the main character is a superhero, writers justify this by pointing out that rushing into danger takes a lot more courage if you're not Nigh Invulnerable or rich enough to create high-tech gadgets.\\nOn the other hand, there's nothing that suggests that the various heroes have to be at odds with one another. Cops who handle Mooks, firefighters who fight blazes after a big showdown, and emergency workers who take care of wounded Innocent Bystanders can free up the superhero to deal with the Big Bad who's causing all the problems to begin with. Likewise, these same emergency workers might appreciate the help of the superheroes-being a firefighter is dangerous at the best of times, but having to dodge the attacks of a flame-spitting Pyro Maniac while trying to fight the fires he started risks becoming a suicide mission unless someone can deal with him. The basic point is to pay reverence to the mundane heroes who risk their lives to save others in our world.\\nCompare The Paragon (who even wants to invoke this among others).\\nContrast Never Be a Hero. This trope often overlap Unlikely Hero, since some of the most heroic deeds or actions are done by the most ordinary people."
    },
    "name": "The Real Heroes",
    "rdf_element": "TheRealHeroes/int_40e0e908",
    "short_name": "TheRealHeroes",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TheRealHeroes"
  },
  {
    "categories": [
      "EvilTropes"
    ],
    "descriptions": {
      "TheMagnificentSeven": "Calvera in The Magnificent Seven owns every scene he's in with relish.",
      "general": "In many conflicts between good and evil, who is going to be doing the lion's share of Chewing the Scenery? The villain(s), more likely than not. It's one way they are Obviously Evil and Drunk on the Dark Side.\\nAs for why, it's not known for sure. Maybe it's a reflection of their narcissism and total lack of inhibitions. Maybe they've decided that since they've already punted a few puppies, called down the lightning, and donned the Spikes of Villainy, they may as well have fun with it. And maybe the moral depravity of their act is balanced by how much fun they are to watch. Or this is used to indicate how Power and Evil feel Good. Whatever the reason, bacon and scenery are important parts of every villain's daily balanced breakfast.\\nThat isn't to say the heroes never get to have such moments, but the villains will get the clear majority of them. Of course, when they both do, the awesomeness factor increases tenfold. A Genre Savvy Villain Protagonist will act hammy just because it's expected.\\nAlso, when the villains are pretending to be good guys in some stories, they don't really act hammy, but when they show who they really are, they let loose, almost as if being a Large Ham is their true nature.\\nOften overlaps with Ham and Cheese. Contrast Softspoken Sadist (the villain is the calmest one in the room).\\nIf a hero is a Large Ham, or there is a World of Ham, it's not this trope (unless the villain manages to still out-ham everyone)."
    },
    "name": "Evil Is Hammy",
    "rdf_element": "EvilIsHammy/int_40e0e908",
    "short_name": "EvilIsHammy",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/EvilIsHammy"
  },
  {
    "categories": [
      "CharactersAsDevice"
    ],
    "descriptions": {
      "TheMagnificentSeven": "Chico from The Magnificent Seven.",
      "general": "Come on, guys! Let me describe The Team Wannabe here! I can be a great troper!\\nA character wants to be part of some group, whether a gang, club, or being a superhero's sidekick. He/She will follow them around constantly to the point of stalking. He/She will hang around wherever they hang around. He/She will keep begging and pleading until he gets in. Sometimes he/she even might, but usually he/she just stays the wannabe since Status Quo Is God. In a few cases he/she might get spurred enough to start to resent the group that rejected him/her, becoming a villain (or hero, if the group turns out to be evil).\\nThe Tagalong Kid is often this. An Ascended Fanboy is often a former wannabe.\\nA Sister Trope to Leader Wannabe.\\nCompare Never Be a Hero, I Just Want to Be Special, Hero with an F in Good.\\nContrast The Drag-Along.\\nCompare/Contrast Jumped at the Call."
    },
    "name": "The Team Wannabe",
    "rdf_element": "TheTeamWannabe/int_40e0e908",
    "short_name": "TheTeamWannabe",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TheTeamWannabe"
  },
  {
    "categories": [
      "GunsAndGunplayTropes"
    ],
    "descriptions": {
      "TheMagnificentSeven": "The Magnificent Seven has Chris use this in his attempt to convince Gunfighter Wannabe Chico to go home: he tells Chico to clap as fast as he can before casually drawing his gun between the closing hands and inviting Chico to match the feat.",
      "general": "The one-on-one gunfight is a derivation of the more ancient practice of duelling. Thus, a key characteristic of many gunfighters is their ability to field their weapon of choice with lightning speed. This is critical to their ability to deliver the Instant Death Bullet rather than receive it, although they may choose to blast the gun out of their adversary's hand.\\nBecause the trope is so well evolved, there are many refinements. Guns and holsters are commonly altered to make the quick draw more effective. Subverting the quick draw by removing an adversary's ammunition before the showdown is a well-known ploy. Shooting from the hip is a way to improve the speed of the draw at the expense of accuracy. You may also have the firearm in an apparatus that sends it directly into your hand.\\nThe Western Showdown at High Noon among shooters is the classic setting for this trope, but it can appear in pretty much every genre with guns, and the best of best at this game will often earn the title of Fastest Gun in the West.\\nThe sword analog of this trope is the Iaijutsu Practitioner in a Single-Stroke Battle."
    },
    "name": "Quick Draw",
    "rdf_element": "QuickDraw/int_40e0e908",
    "short_name": "QuickDraw",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/QuickDraw"
  },
  {
    "categories": [
      "GunsAndGunplayTropes"
    ],
    "descriptions": {
      "TheMagnificentSeven": "Chico from the movie The Magnificent Seven, the Western version of Katsushiro from Seven Samurai.",
      "general": "The Young Gun is the Western equivalent of the Kid Samurai: a younger, less-awesome version of The Gunslinger, looking to make a name for himself. Expect him to be hot-headed and impetuous. He will probably attach himself to an older, more experienced character, looking up to him as a mentor figure, only to be told that this is no kind of life for anyone and that he should get out while he still can.\\nThe Young Gun differs from his counterpart The Gunfighter Wannabe in that he actually has what it takes to be a gunslinger, but just needs a little training/experience/maturity in order to get up to speed. The Gunfighter Wannabe, by contrast, lacks the talent or temperament to make it as a gunslinger and his attempt to try to make a name for himself despite the warnings of his elders generally doesn't end well.\\nOutside the realm of Westerns, this trope all too often overlaps with Child Soldier."
    },
    "name": "Young Gun",
    "rdf_element": "YoungGun/int_40e0e908",
    "short_name": "YoungGun",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/YoungGun"
  },
  {
    "categories": [
      "ComedyTropes"
    ],
    "descriptions": {
      "TheMagnificentSeven": "When Homer calls Japan, he dials a ridiculous series of digits (we can't see what he's dialing). At one point, he touch-tones the theme to The Magnificent Seven. (Note that it's made to seem longer than it is by Homer looking back to the phonebook after every digit).",
      "general": "A phone number is much longer than a real phone number, or noticeably longer than other phone numbers given at the same time. The entire number may be listed or the audience may simply see a character dialing far more digits than would be reasonably expected without seeing which digits they are. Sometimes the number will be an international number and the extra digits are presumably country and area codes, but more often than not no explanation is given.\\nUsually a type of Overly Long Gag. See also For Inconvenience, Press \\\"1\\\".\\nSort of Truth in Television: To dial on a public phone from Tokyo to Guadalajara, Mexico, for example, you have to dial 0041-010-52-33-XXXX-XXXX, where 0041 is the long distance carrier,note\\u00A0In this case, Softbank, and this prefix is actually optional, though it's usually not recommended to omit it for the reason shown below. 010 is the international long distance code,note\\u00A0If you chose to omit the carrier selection prefix, you will be connected through the default carrier for your phone company, usually NTT, which is well known for its extortionate rates. 52 is Mexico's country code, 33 is Guadalajara's city code, and XXXX-XXXX is the local phone number. Also, any extra digits are ignored once you've finished dialing a full valid number, so sometimes harmless extra letters are tacked on to a mnemonic (i.e. 1-800-BUSINESS-NAME)."
    },
    "name": "Ridiculously Long Phone Number",
    "rdf_element": "RidiculouslyLongPhoneNumber/int_40e0e908",
    "short_name": "RidiculouslyLongPhoneNumber",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/RidiculouslyLongPhoneNumber"
  },
  {
    "categories": [
      "TheIndexTeam"
    ],
    "descriptions": {
      "TheMagnificentSeven": "Its American adaptation, The Magnificent Seven, has Steve McQueen's character Vin hold up fingers to count the members of their group when each new man joins.",
      "general": "A Dream Team is needed for The Con, The Caper, or to Save The World. Each teammember is contacted in a short scene revealing their specialty. This sequence culminates with all the members being in the same room together.\\nFor the animated TV series that uses this phrase a lot, see Avengers Assemble. For the film known by this name in the UK and Ireland, see The Avengers.\\nCompare with A-Team Montage, Everyone Meets Everyone, Intro Dump, Lock and Load Montage, Misfit Mobilization Moment, The Order, & Putting the Band Back Together."
    },
    "name": "Avengers Assemble",
    "rdf_element": "AvengersAssemble/int_40e0e908",
    "short_name": "AvengersAssemble",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/AvengersAssemble"
  },
  {
    "categories": [
      "DreamTropes"
    ],
    "descriptions": {
      "TheMagnificentSeven": "In The Magnificent Seven, Lee (Robert Vaughn) not only bolts upright, but also scrambles across the room in a panic when he awakens from a bad dream.",
      "general": "Whenever a character awakes from a nightmare on screen, he will fling himself up from lying down, while panting and looking around confused. Think carefully: how many times do you remember waking up from a nightmare by flinging your torso off the bed? Probably never, right? When most people wake up from one, they lie stunned and confused for a few seconds getting reoriented before looking around. The most you might get is a gasp and a full-body twitch, or some odd moaning coupled with sleep paralysis, although children may wake up screaming. But that would be boring on screen, so anyone with a bad dream has to halfway fling himself out of bed to show the audience it is a dream. Used particularly during an All Just a Dream sequence, to emphasize that the previous scene didn't happen. Besides, it's just cool.\\nThis does happen occasionally in the real world, but usually when one is startled by an outside sensation, not a nightmare. Most of the time, certain chemicals secreted while falling asleep prevent the sleeper from acting out their dreams, a condition known as sleep paralysis when it extends to shortly before falling asleep or after waking up. The rare times it does happen in real life involve a neurological disorder where the person is woken up from the dream by the sensation (not the other way around) and often describe the feeling as being \\\"pushed\\\" upright. Nevertheless, the Catapult Nightmare happens every single time on TV. If it's a Dream Within a Dream, expect two. Possibly more.\\nA night terror can have this effect, but it doesn't involve waking up and doesn't involve a dream\\u2014just full-on activation of the fight-or-flight system in the middle of the deepest stages of sleep. People who have them usually don't remember it in the morning.\\nBonus point if followed by dramatic Wake Up Fighting. See also Instant Waking Skills."
    },
    "name": "Catapult Nightmare",
    "rdf_element": "CatapultNightmare/int_40e0e908",
    "short_name": "CatapultNightmare",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/CatapultNightmare"
  },
  {
    "categories": [
      "DeathTropes"
    ],
    "descriptions": {
      "TheMagnificentSeven": "Four of The Magnificent Seven, following the plot of Seven Samurai.",
      "general": "So you're The Hero on a dangerous quest, you gather The Team and rally that Rag Tag Bunch Of Misfits to your cause. Battles are fought, Character Development is had, Fire-Forged Friends are made, and hearty laughs are shared by all.\\nThen, as you proceed towards the final battle, your friends start to die.\\nOne...\\nBy...\\nOne.\\nWhen an author uses a Dwindling Party, it's to showcase just how dangerous the situation has become. Not only Can Anyone Die, but in fact, everyone is dying! The reasoning is that as audiences grow attached to characters, the Emotional Torque from their death will resonate more and more with each passing, until it reaches fever pitch when The Hero confronts the cause of all the deaths.\\nUsually it works pretty well, though there are risks to using this trope. Namely, killing characters off too quickly or without proper characterization will not elicit the audience's empathy at the deaths. Also, playing the Sorting Algorithm of Mortality too straight will allow moderately Genre Savvy viewers to pick off the obvious Red Shirts and avoid feeling urgency or attachment.\\nThis trope is usually used only in the Action Adventure and Survival Horror Genres because it's kinda hard to write a Love Dodecahedron when Everybody's Dead, Dave. There are a few common set-ups to each, but they usually boil down to:"
    },
    "name": "Dwindling Party",
    "rdf_element": "DwindlingParty/int_40e0e908",
    "short_name": "DwindlingParty",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/DwindlingParty"
  },
  {
    "categories": [
      "ActionAdventureTropes"
    ],
    "descriptions": {
      "TheMagnificentSeven": "About the first third of The Magnificent Seven consists of this.",
      "general": "Occasionally, you get a hero with such personal magnetism that he is capable of persuading others, usually the Badass Bystander, to join him in his quest. Of course, the new companion has no qualms about killing for, or even dying for, the hero, despite having known him only briefly and facing many people who want him dead.\\nThis is a staple of fiction that may well be Older Than They Think. Many epics and legends chronicle the process by which a hero gathers a band of motley friends and allies of dubious background but doubtless courage and nobility. Even if the hero has no special quality compared to his subordinates, this is often his implied \\\"power\\\", Heart.\\nThere's a few variants of this:\\n Beat them up. Because Defeat Means Friendship, sparing someone's life after kicking their ass has a 50/50 chance of making them rethink their ways and maybe they'll become a lifelong friend and ally.\\n Conversely, beat up their enemy along with them. Fire-Forged Friends are always ready to come along.\\n Give a kid a candy bar. Because hey, proving you're kind to cute orphans is the best way to get their Caretaker to dump them to come with you!\\n Save their life. Simple: save someone's life, or buy their freedom, and they'll be your slave forever!\\n Tell them your quest. Who knows? Maybe they too are out to put a stop to Doctor Demonica? A particularly idealistic or persuasive hero can pull this off with gusto on even the most jaded.\\nOften at the center of a Character Magnetic Team. Contrast with The Dulcinea Effect, which usually involves the hero falling victim to a similar phenomenon at the hands of a member of the opposite sex, and Hitchhiker Heroes. A female Magnetic Hero who leads male characters with The Dulcinea Effect may be a Jeanne d'Arch\\u00E9type. On a larger scale, the usual subject of A Protagonist Shall Lead Them.\\nThe resultant group generally turns out to be a Ragtag Bunch of Misfits. If it actually sticks around for a while, you may get True Companions or Badass Crew.\\nContrast Socially-Awkward Hero.\\n\\nExamples"
    },
    "name": "Magnetic Hero",
    "rdf_element": "MagneticHero/int_40e0e908",
    "short_name": "MagneticHero",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/MagneticHero"
  },
  {
    "categories": [
      "WeaponsAndWieldingTropes"
    ],
    "descriptions": {
      "TheMagnificentSeven": "There have been at least three cases (specifically The Magnificent Seven, Blake's 7 and Firefly \\u2014 the latter two are probably homages to the first) where are a character is commended for a good shot only for them to say they were aiming somewhere else.",
      "general": "A character picks up a gun, bow, crossbow, throwing-knife, shuriken, or other long-range weapon, and gains Improbable Aiming Skills.\\nThis enables such feats as Blasting It out of Their Hands, creating a Pinball Projectile, knowing how to Lead The Target from kilometers away, or the Offhand Backshot (the firearm-based answer to the Offhand Backhand), and is in no way dependent on the factual accuracy of the weapons in question. A frequent user of this trope is The Western, where the heroes are often using guns that were, in real life, notoriously inaccurate at anything other than point-blank range, for feats that would make a modern-day sniper with a top-tuned high-tech rifle turn green with envy.\\nImprobable Aiming Skills is a prerequisite if an archer wants to pull off a multishot successfully.\\nWarning shots might take the form of a Knife Outline or William Telling.\\nIs sometimes parodied by implying that the shooter meant to do something entirely different and messed up in a spectacularly lucky way.\\nThe Achilles' Heel to someone with this ability is someone who can Dodge the Bullet. They tend to have little problem with Human Shield situations, as they're easily able to Shoot the Hostage Taker. Contrast Imperial Stormtrooper Marksmanship Academy- villainous Mooks are terrible at aiming.\\nAlmost always used by The Gunslinger (or, in fantasy settings, an archer). Contrast with A-Team Firing, More Dakka (which emphasizes quantity over quality, but is sometimes used with this trope), Shoot the Rope and the Imperial Stormtrooper Marksmanship Academy. When the computer AI pulls this off, it's The Computer Is a Cheating Bastard. See also Always Accurate Attack, Gun Fu.\\n\\nExamples"
    },
    "name": "Improbable Aiming Skills",
    "rdf_element": "ImprobableAimingSkills/int_40e0e908",
    "short_name": "ImprobableAimingSkills",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ImprobableAimingSkills"
  },
  {
    "categories": [
      "Starwars"
    ],
    "descriptions": {
      "TheMagnificentSeven": "The Magnificent Seven opens with a traveling salesmen arguing with the town undertaker over the burial of a Native American who died in the street: the salesman is willing to pay for the burial, but no one is willing to drive the hearse up to Boot Hill because a \\\"certain element\\\" in the town objects to having a non-white buried there and is threatening violence. The matter is resolved when Chris and Vin, the first two of the eponymous seven, volunteer to drive the hearse and engage in a brief gunfight with a group of racists who try to stop them from entering the cemetery. The villagers then approach them to ask for help, for men who do that are men who will help them.",
      "general": "One mark that distinguishes humans from nonhumans is that humans have funeral rites; they regard something as due to the dead and have for a long time. Indeed, since burials leave archeological evidence, we know that they occurred as long as 300,000 years ago, as a practice among the Neanderthals.\\nUnsurprisingly, this has been incorporated in art as a trope, as a mark of character, and is Older Than Dirt, with funeral rites in art from ancient civilizations. Evil characters will violate proper treatment of a corpse by mutilating, reanimating, or even eating the dead, though Due To The Dead is one of the most common standards villains maintain. Good characters will (rarely!) do the same to a dead Complete Monster or the like, but usually are marked by their proper respect for the dead, down to even letting Revenge end when the villain is dead; if they have to destroy bodies to contain a plague, or display it to prove that he is really dead, they will often find it Dirty Business.\\nEven when you put The Fun in Funeral, and Hilarity Ensues, the humor tends to be dark and the characters nasty.\\nA wide variety of practices are possible, as in Real Life. Cremation and burial are the most common, but such practices as exposing to the dead to vultures and other unusual methods can be done in fiction as in life. Even slicing up the body \\u2014 usually regarded as mutilation and proof of evil \\u2014 has been done in Real Life as a means to free the soul from the body and has featured so in fiction. Preserving parts (usually bones) of the dead can be the mark of a Necromancer or of respect, depending on how used; see the Sub-Trope of Dead Guy on Display.\\nOne funeral practice, however, will put the characters on the evil side, no matter how respectfully they carry it out: Human Sacrifice.\\nNote that some dead are due more than others. The Heroic Sacrifice calls for a well-attended funeral, making The Hero Famed In-Story, and perhaps even a monument. Sometimes to mitigate the effect of Dying Alone; What You Are in the Dark may threaten that the hero will die unmourned. Conversely, some are due less than most; the Complete Monster, the Dirty Coward, etc. may be dumped in an unmarked grave with minimal ceremony.\\nOn the other hand, some of the living owe the dead more than others. Family and friends have a duty to carry this out, often through a Shrine to the Fallen. Strangers who perform such things for the dead are acting out of generosity; a Good Shepherd may perform such rites. Indeed, some ghosts manifest in order to properly reward a total stranger who arranged for the burial.\\nOther ways in which this trope might present itself: closing the eyes of someone who Dies Wide Open; sorting through the deceased's belongings (may result in Personal Effects Reveal); responding with Manly Tears or Tender Tears; a Meaningful Funeral, when most characters show due respect; a Lonely Funeral, when few; Libation for the Dead; Dead Guy Junior; a Morality Chain continuing to bind postmortem; a determination to carry on the deceased character's work; people wearing The Poppy; and Never Speak Ill of the Dead.\\nHowever, no matter how beloved the dead, Excessive Mourning may be decried. Ghosts may complain that it is keeping them from peace, or characters may be criticized for neglecting their duties to the living.\\nObserving this may be necessary to prevent the deceased from being Barred from the Afterlife and coming back as a ghost or other form of The Undead \\u2014 which may take the form of an Indian Burial Ground.\\nTo discuss actual funeral practices, see Funerals.\\nOf course, this being a Death Trope, expect massive SPOILERS."
    },
    "name": "Due to the Dead",
    "rdf_element": "DueToTheDead/int_40e0e908",
    "short_name": "DueToTheDead",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/DueToTheDead"
  },
  {
    "categories": [
      "Dialogue"
    ],
    "descriptions": {
      "TheMagnificentSeven": "From The Magnificent Seven, after a discussion of all the good reasons for giving up and going home.",
      "general": "I swore to Describe I Gave My Word Here, and you shall not deter me!\\nAny dialog to indicate your deep offense that someone says that you could do something that you promised not to, or refrain from something you promised to do \\u2014 or actually tries to do something you had promised would not happen. (You are, after all, \\\"a man of your word.\\\") Bonus points if no one would realize you had broken it: if you had given it to a dying man, or no one would believe the character you gave it to. A Last Request for some reason is actually an especially binding promise \\u2014 as is a vow made to the already dead.\\nGenerally preceded by the Stock Phrase \\\"I give you my word.\\\"\\nMay indicate Honor Before Reason. On the other hand, a reputation for trustworthiness makes it easier to get people to listen to you, possibly getting you out of a Mexican Standoff, Hostage Situation, or other situation that cannot be resolved by brute force. On the third hand, when getting someone's word, beware of Exact Words.\\nThe Blue Blood, particularly the Officer and a Gentleman, is prone to this. Indeed, he may say, \\\"I give my word as a gentleman.\\\"\\nMore elaborate formulas are possible. This may be because their word is not binding without them, or to emphasize their seriousness. This can be \\\"I swear by Trope\\\" \\u2014 occasionally with the implication that Trope will personally avenge you on them if they swear falsely \\u2014 or a specific curse that they invoke to fall on them if they fail (usually expressed in the form \\\"May Trope strike me down\\\"). Bolt of Divine Retribution is not unknown as punishment.\\nConversely, some characters, particularly in settings where honor is held highly, will consider any kind of statement, no matter how casual, as binding.\\nMaking a blank-check promise \\u2014 \\\"Yes, I will do something for you\\\" \\u2014 or making it only because you have been lied to may lead to Honor Before Reason, where a character insists on carrying it out anyway. However, in these situations, even the most honorable character often insists on Exact Words. More prudent characters will break it on these grounds; then, they are more likely to be sure of their facts, or refuse to make a blank-check promise.\\nEven some villains stick to scrupulous honesty, either because they retain some ethical standards or because long-term trust is more useful than short-term backstabbing. It is often a disadvantage for the Devil in a Deal with the Devil. He will follow what he said; he'll squirm the meaning if he can, but if he gave some Impossible Task for you to follow and you somehow did, he will begrudgingly follow through. There are exceptions to this, but if someone is dealing with a literal devil, the deal can be expected to be honored.\\nIf an Incorruptible Pure Pureness character must break his word, or insist on Exact Words for some sound reason \\u2014 such as having been tricked \\u2014 he will break it but think it Dirty Business. A Knight Templar, on the other hand, will either break his word (or insist on Exact Words) without a tremor of conscience, or monomaniacally insist on carrying it out, regardless of the consequences. Similarly, heroes forced into the Sadistic Choice (where one option is saving lives and another keeping their promise) may end up forced into a Frequently-Broken Unbreakable Vow.\\nRequired for Combat by Champion.\\nContrast Heroic Vow and Will Not Tell a Lie. Closely related to the Blood Oath. When someone has broken this vow so thoroughly they become ostracised they're The Oath-Breaker. Releasing from the Promise is another option, though some characters think that even the person they've sworn the oath to can't free them."
    },
    "name": "I Gave My Word",
    "rdf_element": "IGaveMyWord/int_40e0e908",
    "short_name": "IGaveMyWord",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/IGaveMyWord"
  },
  {
    "categories": [
      "Plots"
    ],
    "descriptions": {
      "TheMagnificentSeven": "With one member of the The Magnificent Seven looking to settle down as his quickness dissipates, perhaps they qualify.",
      "general": "Usually, when someone fights, it's for a reason. Sometimes it's for patriotism or to fulfill an ideal. Sometimes it's to protect something or someone. And sometimes it's for some sort of compensation.\\nThe motivation of fighting solely for monetary gain is generally not treated as sympathetic. However, when the compensation is more than simply money, that can change.\\nThis group of people lost their homeland and has been seeking it ever since. Perhaps it was destroyed, or they were exiled, or they were on the losing end of a war. Whatever the reason, they want someplace to call home. Preferably their original home, but they might choose not to be picky. And they'll do just about anything for someone who can promise them that home back.\\nThey often have no one but each other. As a consequence, their commander is often A Father to His Men, and they are True Companions. (But not in more cynical stories.)\\nCompare with The Promised Land, which is what the characters in the work will view this future homeland as.\\nNot to be confused with fighting for your homeland.\\nContrast Eagle Squadron, where you have even more idealistic motives."
    },
    "name": "Fighting for a Homeland",
    "rdf_element": "FightingForAHomeland/int_40e0e908",
    "short_name": "FightingForAHomeland",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/FightingForAHomeland"
  },
  {
    "categories": [
      "CharacterizationTropes"
    ],
    "descriptions": {
      "TheMagnificentSeven": "Justified in The Magnificent Seven. The decision to betray the Seven is not made lightly by the townspeople, and the Seven themselves understand why they did it. One of them (Charles Bronson) strongly berates boys who think that by betraying the Seven their parents were being cowards. It's also subverted in that Calveras actually proves true to his word\\u2014he doesn't kill the villagers or the Seven. He releases the latter a fair distance from town and even returns their guns.\\n Note that this is one of the few tropes exclusive to The Magnificent Seven and not other versions of The Seven Samurai.\\n Calveras does imply there'll be some punishment (\\\"What will happen to the villagers?\\\" \\\"What will happen to them will happen regardless of whether you fight or not\\\") but it's obviously not in his interest to kill the villagers he's been leeching off. Likewise he thinks killing the American gunfighter will lead to other Americans coming down looking for revenge.",
      "general": "After much pleading, begging, pity and a sense of moral justice, The Hero arrives, determined to save the townspeople from a terrible fate at the hands of a devious villain. Everything's looking all right, everyone is happy and then-\\nBam. Betrayed. The villain comes out of nowhere, captures The Hero and tells the townspeople \\\"You have done well to betray this interloper, for after your plans failed I would have destroyed all of you\\\". Note that the villain will probably still follow through with the original plans anyway, the complicity of the townspeople notwithstanding.\\nWhat The Hell, Townspeople? is meant to be the reaction of the audience to this situation as opposed to any general character. The idea is that the ostensibly good townspeople are basing their long-term survival plan on screwing over the only people who would actually be willing to be nice to them.\\nSee also: Apathetic Citizens, Dying Like Animals, Les Collaborateurs. If they never liked the hero in the first place, they're probably All of the Other Reindeer."
    },
    "name": "What The Hell, Townspeople?",
    "rdf_element": "WhatTheHellTownsPeople/int_40e0e908",
    "short_name": "WhatTheHellTownsPeople",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/WhatTheHellTownsPeople"
  },
  {
    "categories": [
      "LawsAndFormulas"
    ],
    "descriptions": {
      "TheMagnificentSeven": "The Magnificent Seven.",
      "general": "Right after three, seven is the most commonly used \\\"ominous\\\" number in fiction. This can be traced back to the ancient times; just think of the Seven Wonders, the Seven Days of Creation, or the Seven Hills of Rome. It is also common in many fairy tales.\\nIn the natural world, one of the origins of this significance come from the seven celestial bodies that could be seen with the naked eye, (Sun, Moon, and the planets up to Saturn), that were worshiped as deities, and the days named after them were the days of the week.\\nLater, natural phenomena were intentionally shoehorned into this \\\"significant\\\" number, for example the colors of the rainbow and the number of continents can be seven, depending on how you count them.\\nSince The Bible, especially the Book of Revelation, uses it repeatedly, seven became even more famous as a divine number, or as the number of perfection.\\nLucky Seven is a subtrope about examples where it is considered a lucky number. Also see Magical Seventh Son, Seven Deadly Sins."
    },
    "name": "Rule of Seven",
    "rdf_element": "RuleOfSeven/int_40e0e908",
    "short_name": "RuleOfSeven",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/RuleOfSeven"
  },
  {
    "categories": [
      "HeelFaceIndex"
    ],
    "descriptions": {
      "TheMagnificentSeven": "In The Magnificent Seven, Lee, played by Robert Vaughn is a gunfighter who has lost his nerve and usually tries to hide from participating in any of the shootouts in order to avoid being killed. In the end though, Lee finally finds his courage in rescuing some townsfolk inside of a farmhouse from three banditos during the climactic final showdown between the Seven and the Banditos.  He's killed immediately after he walks out of the farmhouse.",
      "general": "Often, when a character who has done something bad or evil sees the error of their ways and does a Heel-Face Turn in the course of fighting to undo the damage their redemption often comes at the cost of their own life.\\nThere are any number of reasons as to why authors do this:\\n1. It shows that the ex-villain is serious about helping the heroes, enough so to put his own life at stake to save them. It also plays up the drama of havinging a character turn good, but then tragically not survive to live out their redemption. This version is sometimes subverted with Redemption Earns Life or Redemption Equals Affliction, especially if the ex-villain is popular enough since the willingness to die is all that is needed out of this version of the trope.\\n2. It may be that the bad guy is just so bad that it's hard to accept the idea that he gets a happy ending even if he's sincerely changed his ways and so has to die to make things seem right. Sometimes Executive Meddling forces this so as not to cross Moral Guardians who will object if the ex-villain suffered another suitable punishment. See Do Not Do This Cool Thing.\\n3. Maybe the author is reluctant to change the status quo of the story by introducing an Anti-Hero to the cast but he still wants an antagonist to be sympathetic so he has them redeem themselves before dying. Thus having the main cast experience What a Senseless Waste of Human Life.\\n4. It could be that there is no place in the world for them. Sure, the redeemed villain going off to a happy little life with Babies Ever After is heartwarming, but it might just not be possible if he's especially infamous with the general public. Even if the heroes are willing to forgive the ex-villain it doesn't always mean that the muggles will comply. In this case death by Heroic Sacrifice may actually be a happier end for the character than being strung up by an angry mob. If subverted the character may end up having to hide his identity or go into exile otherwise the heroes may end up having to plead his case.\\nDeath Seeker and some types of the Martyr Without a Cause are characters most prone to believe this in universe. A possible end result of the Redemption Quest.\\nCompare Villain's Dying Grace when the villain is portrayed sympathetically as he is dying, Death Equals Redemption for when a dying villain chooses to do a final good act and Alas, Poor Villain when the character's death (speech) provides a reason for the fans to feel sorry for them. See also Heel Face Door Slam, when the poor guy doesn't even get to redeem himself before dying. Non-protagonist atoners are especially likely to be hit by this trope.\\nNaturally, this is a Death Trope. Expect unmarked spoilers ahead. You have been warned."
    },
    "name": "Redemption Equals Death",
    "rdf_element": "RedemptionEqualsDeath/int_40e0e908",
    "short_name": "RedemptionEqualsDeath",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/RedemptionEqualsDeath"
  },
  {
    "categories": [
      "CharactersAsDevice"
    ],
    "descriptions": {
      "TheMagnificentSeven": "In The Magnificent Seven, there are two Quiet Ones:\\n James Coburn's character Britt (the knife-thrower), with 11 lines total during the 128 minute-long film Britt's lines are also invariably short: in his introductory scene he says a total of five words. The scene is 2:28 seconds long. 21 seconds into it, he says \\\"You lost\\\". 1 minute and 17 seconds later, at 1:38, he says \\\"Call it.\\\" At 2:20, in response to Chris saying \\\"Britt.\\\", he says \\\"Chris.\\\"\\n Robert Vaughan's Lee (the gambler) has a whopping 16 lines.",
      "general": "He's not The Voiceless. He's not an Ineffectual Loner. He just rarely talks, so anything he does say carries extra weight. In most instances, The Quiet One is physically imposing. He is either The Big Guy or The Lancer and may also be a Gentle Giant or Genius Bruiser.\\nIf he's a member of The Squad, he'll either enjoy killing a bit too much or suffer anguish over the fact that he has killed and must continue to kill. If this is ever explained, it's credited to his former civilian occupation being one that abhors death and destruction. Often, this is the member assigned to carry the BFG.\\nHis quietness may be a reflection of deep psychological problems. Otherwise The Quiet One just comes across as cool, calm, collected, and slightly above the madness of their universe; a less vocal Deadpan Snarker.\\nYou might expect The Quiet One to be a loner, but unless he's the Aloof Big Brother, that's hardly ever the case, probably because of the assumption that Loners Are Freaks.\\nDifferent from The Voiceless in that The Quiet One can be seen talking occasionally, not just once during some special moment. Unsurprisingly, he isn't likely to be partial to small talk, and may have an enigmatic non-answer for any questions people might ask him.\\nA subtrope of The Stoic. See also The Silent Bob. Compare Heroic Mime, Silent Antagonist. Contrast Sesquipedalian Loquaciousness, Motor Mouth. If The Quiet One has a Berserk Button, it could be Beware the Quiet Ones."
    },
    "name": "The Quiet One",
    "rdf_element": "TheQuietOne/int_40e0e908",
    "short_name": "TheQuietOne",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TheQuietOne"
  },
  {
    "categories": [
      "DiscordTropes"
    ],
    "descriptions": {
      "TheMagnificentSeven": "Calvera to Chris Larabee Adams, Vin Tanner, Bernardo O'Reilly , Lee, Harry Luck, Britt, and Chico in The Magnificent Seven.",
      "general": "An Arch Enemy, archfoe, archnemesis, or simply nemesis is some character's designated and most important enemy.\\nThe Arch Enemy can be the Big Bad, The Dragon, The Rival, an Evil Counterpart, or even a Harmless Villain. The essential element is that, with them, It's Personal. Most typically, the Arch Enemy is a foil of some sort. For example, the Arch Enemy of the physically strong could be very smart. If the villain is the Bigger Bad, his Arch Enemy commonly is the Big Good.\\nThe Arch Enemy will stand out from the Super Hero's Rogues Gallery \\u2014 there will be one opponent where the relationship to the hero and the motivations for battling them are more potent. These feelings may be one-sided, felt more by the villain than the hero, or occasionally vice-versa.\\nA hero's Arch Enemy is not necessarily the biggest threat to them. Lex Luthor is considered Superman's Arch Enemy; Brainiac is smarter and Darkseid is vastly more powerful and dangerous, but for Lex - and, to a lesser extent, for Superman - it's personal between them.\\nSometimes, the hero could have made the same choices as the Arch Enemy: the Arch Enemy is showing us what he could have become, as in the case of Batman and the Joker.\\nA hero may possess more than one Arch Enemy if more than one villain from his Rogues Gallery stand out, or if a former Arch Enemy dies and new one comes in to the picture. As an example, consider Spider-Man: the Green Goblin, Doctor Octopus, and Venom have all established themselves as recurring and iconic foes of Spider-Man, each of whom has been considered the wallcrawler's Arch Enemy at different points in time.\\nLastly, remember that this generally refers to the enemy the hero considers to be his Arch Enemy, and ideally, it should be personal on both sides (though there are plenty of good \\\"But for Me, It Was Tuesday\\\"-type Arch Foes out there). Especially in the case of a Rogues Gallery, the hero is usually considered an Arch Enemy to all of his villains, but he doesn't treat all of them as such. Electro, Rhino, Scorpion, and others all consider Spider-Man their most hated foe, but compared to the Goblin, Venom, or Doc Ock, Spidey regards these guys more like superpowered nuisances. Also, remember that being the Big Bad does not automatically make a villain the hero's arch enemy.\\nBeware of letting an Arch Enemy fall victim to Villain Decay.\\nSee also Breakout Villain, for those instances when a run-of-the-mill villain ascends to Arch Enemy status.\\nNot to be confused with various works known as Nemesis. Also not to be confused with the Swedish melodic death metal band. Technically, the word \\\"nemesis\\\" originally referred to an agent of divine justice or retribution for egotistical thinking; thus Batman could be described as Joker's nemesis, but not vice versa.\\nThe Arch Enemy is more prone to certain tropes than the common villain:\\n\\n Animal Nemesis\\n Antagonist in Mourning\\n Break Them by Talking\\n Cain and Abel\\n Chronic Villainy\\n Classic Villain\\n Create Your Own Villain\\n Driven by Envy\\n Enemy Mine\\n Evil Counterpart\\n Evil Former Friend\\n Evil Versus Evil\\n Friendly Enemy\\n It's Personal with the Dragon: When The Dragon rather than the Big Bad is the arch enemy in question.\\n Joker Immunity\\n Not So Different\\n The Only One Allowed to Defeat You\\n Pick on Someone Your Own Size\\n The Resenter\\n Rival Turned Evil\\n Supervillain\\n Unknown Rival\\n Villain Takes an Interest\\n Worthy Opponent"
    },
    "name": "Arch-Enemy",
    "rdf_element": "ArchEnemy/int_40e0e908",
    "short_name": "ArchEnemy",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ArchEnemy"
  },
  {
    "categories": [
      "GunsAndGunplayTropes"
    ],
    "descriptions": {
      "TheMagnificentSeven": "From The Magnificent Seven movie:",
      "general": "We've all seen people hit impossible targets at great lengths under unbelievable circumstances. But occasionally, a hero will make a seemingly impossible shot, be congratulated on his awesomeness, and admit that he was aiming for something else entirely.\\nOften used to subvert an awesome moment into a funny one. May be the result of the Pinball Projectile. Contrast Exactly What I Aimed At.\\nCommon when something needs to be hit by a character with legendarily lousy aim."
    },
    "name": "Accidental Aiming Skills",
    "rdf_element": "AccidentalAimingSkills/int_40e0e908",
    "short_name": "AccidentalAimingSkills",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/AccidentalAimingSkills"
  },
  {
    "categories": [
      "EndingTropes"
    ],
    "descriptions": {
      "TheMagnificentSeven": "Chico decides to stay in the village at the end of The Magnificent Seven.",
      "general": "At the end of a story about a character being immersed in a new world which they absolutely hate, whether they're trapped in the wrong body, warped to another time or dimension, or forced to move in with their in-laws, there is often a scene at the very end where it's all over and now they get to go back to their old, beloved lifestyle.\\nBut... wait! What's this? The new environment has apparently grown on the character so much, that they don't want to go back? They choose to stay in their new environment and live happily ever after? Awwwwwwww. How touching.\\nIt can also be a consequence of Heroic Resolve. The hero may have a conflicting choice: yes, he can leave the war and go home, but if he does so, the war will continue and his friends will be killed or enslaved. The hero is the Big Good, perhaps even The Chosen One, and with this role Comes Great Responsibility. By choosing to stay and rejecting the chance to leave, the hero proves that he is not the victim of Deus Angst Machina, but that he willingly accepts the harsh conditions on behalf of the others... the basic definition of heroism.\\nA Love Interest can also be a factor. Indeed, this trope is often encouraged by a Fantastic Romance. By choosing this trope, the hero may think that You Are Worth Hell or otherwise more important than what's on the other side. No Star-Crossed Lovers here!\\nThe opposite of But Now I Must Go. Often a result of Becoming the Mask. See also Going Native, Home Sweet Home, and Send Me Back. Compare Stay with the Aliens and Can't Stay Normal.\\nSPOILERS GALORE."
    },
    "name": "I Choose to Stay",
    "rdf_element": "IChooseToStay/int_40e0e908",
    "short_name": "IChooseToStay",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/IChooseToStay"
  },
  {
    "categories": [
      "IndexOfExactTropeTitles"
    ],
    "descriptions": {
      "TheMagnificentSeven": "The theme to The Magnificent Seven.",
      "general": "A type of Mood Motif that was traditionally used in medieval Europe to celebrate the arrival of a royal person. The form usually involved trumpets played in a bombastic and stirring manner.\\nToday, it is still present in music as a form of celebrating something. A fanfare today also uses brass instruments, or the closest digital music equivalent, and if not bombastic, it is still meant to be stirring and uplifting.\\nA Sister Trope to Victorious Chorus. May often accompany a \\\"Hell Yes\\\" Moment or a Moment of Awesome.\\nCompare Orchestral Bombing, Dramatic Timpani, Drum Roll Please, Ermine Cape Effect (having the same effect for royalty, but with clothes).\\nContrast Losing Horns."
    },
    "name": "Fanfare",
    "rdf_element": "Fanfare/int_40e0e908",
    "short_name": "Fanfare",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/Fanfare"
  },
  {
    "categories": [
      "DeathTropes"
    ],
    "descriptions": {
      "TheMagnificentSeven": "Near the end of The Magnificent Seven, Harry Luck, a money-hungry gunslinger, is fatally wounded. Although the Seven are only being paid $20 for their services, plus food and lodging during their stay, Harry is convinced that there must be some sort of secret wealth involved. With his dying breaths, he tells his friend Chris that he'd \\\"hate to die a sucker\\\" and asks one more time what the big secret was, prompting Chris to assure him that they were fighting for \\\"Gold. Sacks of it.\\\"",
      "general": "So, it's the end. Someone you know is about to bite it, having fought the good fight and, well, lost. But it's okay, you tell them; the battle's as good as won, the reinforcements will be here soon, and everything will be all right. And so they pass on happy, secure in the knowledge that everything's okay.\\nWell, that's a lie. There aren't reinforcements coming. In fact, you look pretty screwed. But, hey. At least your friend died happy, right?\\nLet Them Die Happy is what happens when one character gives another one last thing to hope for, even if said thing doesn't technically exist. Sure, they may be pissed off when they get to the afterlife (if there is such a thing in the setting), but at least they were happy in their darkest hour. Right?\\nCompare Go Out with a Smile, for when the dying character smiles for the sake of their surviving loved one, and The Power of Legacy, where the lie is being told by another on behalf of the dead for the sake of the living. Not to be confused with Died Happily Ever After, when a character is \\\"released\\\" and finally at peace after his death.\\n As this is a Death Trope, spoilers will be unmarked.\\n\\nExamples"
    },
    "name": "Let Them Die Happy",
    "rdf_element": "LetThemDieHappy/int_40e0e908",
    "short_name": "LetThemDieHappy",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/LetThemDieHappy"
  },
  {
    "categories": [
      "ActionAdventureTropes"
    ],
    "descriptions": {
      "TheMagnificentSeven": "And its Western remake The Magnificent Seven - Where the seven gunmen, plus the villainous bandit leader, are Badass from start to finish.",
      "general": "A work that is heavily dependent on things, situations, or actions that are stereotypically masculine, in order to appeal to a predominantly male audience. Made by men, for men.\\nExpect to see Perma Stubble, hot blood, improbably muscled males, Carpets Of Virility, lots of fighting, Stuff Blowing Up, large amounts of Rule of Cool, and if you're lucky, Manly Tears. Most, if not all of the main characters are often grade-A Badasses and sometimes Large Hams. Expect to see somebody shout a phrase WHERE! THEY! EMPHASIZE! EVERY! WORD! which can result in Memetic Mutation. Soundtrack is prone to be fueled by The Power of Rock.\\nTraditionally, the role of women in such works is often stereotypically feminine, as support characters or Love Interests, sometimes satellite ones, while the men fight and die (often for their sake). A woman may be the Unwitting Instigator of Doom, doing some small and unimportant action early in the movie or in the origin story, which start the chain of events that lead to some great disaster For Want of a Nail, and the real men would have to deal with it (for example, the villain may have turned into a villain in the first place because Love Makes You Crazy). Nevertheless, badass females are far from uncommon, and they may or may not be masculine in their interests. Either way, expect Fanservice. Though keep in mind actual sex or womanizing doesn't necessarily mean \\\"manly\\\", as most playboys tend to have physical (and personality) traits opposite to the ones described above.\\nThese works also tend to glorify war, although there have been many manly works with the opposite viewpoint.\\nNamed after a line in the contrasting segment of the Janus Syndicate parody video Counter-Strike For Kids.\\nJust because a work falls under this trope doesn't mean that it can't have any feminine appeal or a significantly large female audience. You'll find that many of the examples below have almost as many female fans as they do male fans. This trope simply means that stereotypical masculine behavior is a significant focus of the work at hand. The number of female fans generally depends on how rigidly and/or multi-dimensionally the work fits this trope.\\nWhen those in charge think that a foreign video game would sell better with this aesthetic than the one it came with, you get the American side of American Kirby Is Hardcore.\\nThe World of Badass is often the setting for this trope. Compare/Contrast Darker and Edgier. See also Awesomeness Is Volatile. Not directly related to Rated M for Money in any way but the potential for intersection between the two is high.\\nCompare with Testosterone Poisoning, where the appeal to masculinity is exaggerated to the point of parody (though expect to pass through here before hitting Testosterone Poisoning levels of manly).\\nContrast Chick Flick (which is this trope's opposite), Kawaisa and Moe (which are all opposed aesthetics).\\n\\nExamples"
    },
    "name": "Rated M for Manly",
    "rdf_element": "RatedMForManly/int_40e0e908",
    "short_name": "RatedMForManly",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/RatedMForManly"
  },
  {
    "categories": [
      "CharacterIntroductionIndex"
    ],
    "descriptions": {
      "TheMagnificentSeven": "So it's not too surprising that The Magnificent Seven does it too.",
      "general": "A series introduces the main cast by adding them one at a time in sequential episodes, chapters, and/or story arcs.\\nUsually a tactic by writers to get everyone collected before having any real plot started, and the audience feels they can start paying attention. Also a cheap way to ensure that everyone's relationship to the lead has equal history.\\nSometimes followed by Green Rooming. Can be especially annoying in things like Twelve-Episode Anime series if the cast has more than four people.\\nExtremely common with Bishoujo Series and Unwanted Harems. Even more common in computer games (namely, RPGs), with many such games introducing a new party member in each area, some even going so far as to have an obvious number of \\\"slots\\\" that are going to be filled up by the end of the game.\\nThe next step to a Debut Queue system is the Character Magnetic Team. Contrast You ALL Share My Story. May involve a Second Episode Introduction. If the characters are all present in early episodes but are given characterisation episode-by-episode, see A Day in the Limelight. Also see Arbitrarily Serialized Simultaneous Adventures for video games which begin by giving each character in the party their own level. Characters introduced by Debut Queue may also fall under Hitchhiker Heroes.\\n\\nExamples"
    },
    "name": "Debut Queue",
    "rdf_element": "DebutQueue/int_40e0e908",
    "short_name": "DebutQueue",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/DebutQueue"
  },
  {
    "categories": [
      "GunsAndGunplayTropes"
    ],
    "descriptions": {
      "TheMagnificentSeven": "In The Magnificent Seven, a bunch of racists blocking the burial of an Indian are disabled this way. It's mostly to prove how awesome Steve McQueen and Yul Brynner's characters are, though it's played with a bit more realism than many examples: the men thus disarmed are visibly injured and bleeding afterwards.",
      "general": "A character shoots a weapon out of another's hand. The one whose weapon was blasted, however, almost never gets hurt. Indeed, this technique is often used by heroic gunslingers (who may have an aversion to just shooting the enemy) to subdue their enemies without killing them.\\nSometimes, however, they were aiming for something else.\\nIf the gun is somehow still usable despite having been hit by a slug of lead and copper traveling in excess of 800 feet per second, then it's a case of Magic Bullets.\\nNot to be confused with an Arm Cannon or Blasting Time. Often an example of Improbable Aiming Skills.\\n\\nExamples"
    },
    "name": "Blasting It out of Their Hands",
    "rdf_element": "BlastingItOutOfTheirHands/int_40e0e908",
    "short_name": "BlastingItOutOfTheirHands",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/BlastingItOutOfTheirHands"
  },
  {
    "categories": [
      "CharactersAsDevice"
    ],
    "descriptions": {
      "TheMagnificentSeven": "The seventh member of The Magnificent Seven really hates farmers, though himself a farmer.",
      "general": "The Boomerang Bigot is a character who thinks that all members of Group X are an inferior race/species... even while being a member of Group X themselves. Despite the obvious contradiction, the Boomerang Bigot doesn't see anything wrong with their view, and will continue to proudly persecute Group X.\\nDiffers from You Are What You Hate in that there is no ignorance, secrecy, or self-doubt involved. The Boomerang Bigot knows they're a member of the targeted group \\u2014 and others know it, too \\u2014 but remains unabashed about holding their views, possibly in an odd form of Honor Before Reason. However, it is possible for the two tropes to overlap. A bigot's membership in the hated group might be secret to most people but known to a few. If he continues to sincerely express hatred towards the hated group, even when in a situation where his secret will not be exposed, then he might show shades of both Boomerang Bigot and You Are What You Hate.\\nSuch behavior almost always occurs for laughs. If not... be afraid.\\nHas also been known in the mainstream as \\\"Self-Hating\\\", with the ethnic group following after (such as \\\"Self-Hating Black\\\" and \\\"Self-Hating Jew\\\"). A more technical term is \\\"internalized bigotry\\\". If they're not self-hating and simply criticize the behavior of their group, they might just be insisting that they Stop Being Stereotypical.\\nIf done poorly, this trope can lead to Unfortunate Implications, such as that being bigoted is okay as long as it's self-loathing bigotry - or, on the other hand, that a person must be prejudiced in the \\\"right\\\" way, because otherwise they'll be a Category Traitor.\\nA supertrope of Misanthrope Supreme. Also see Noble Bigot, Pretend Prejudice, Cultural Cringe, Hunter of His Own Kind, Humans Are Bastards, Even Nerds Have Standards, Some of My Best Friends Are X, Internalized Categorism, N-Word Privileges, Female Misogynist, and Psychological Projection. Gayngst and Armoured Closet Gay are related tropes for self-hating gays and lesbians, and Effeminate Misogynistic Guy for a less direct form of boomerang-bigotry. The most extreme cases may commit Genocide from the Inside, or attempt to do so. See also Self-Deprecation."
    },
    "name": "Boomerang Bigot",
    "rdf_element": "BoomerangBigot/int_40e0e908",
    "short_name": "BoomerangBigot",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/BoomerangBigot"
  },
  {
    "categories": [
      "MusicAndSoundEffects"
    ],
    "descriptions": {
      "TheMagnificentSeven": "The Magnificent Seven theme by Elmer Bernstein, the score that defined Western film scores for 20 years.\\n Also, Elmer Bernstein's score for the film To Kill A Mockingbird is still a timeless piece that modern composers emulate all the time.",
      "general": "Influential and notable music of note, usually with notes, in successive order. See also Music Tropes.\\nFor exemplary Score And Soundtrack, see Notable Original Music.\\nHAHAHA GET IT? MUSIC? OF NOTE? HAHAHA"
    },
    "name": "Music of Note",
    "rdf_element": "MusicOfNote/int_40e0e908",
    "short_name": "MusicOfNote",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/MusicOfNote"
  },
  {
    "categories": [
      "SexualHarassmentAndRapeTropes"
    ],
    "descriptions": {
      "TheMagnificentSeven": "The Magnificent Seven. The villagers hide their women because they're afraid the hired guns will rape them. Yul Brynner's character acknowledges that their fears are not entirely unjustified (not all gunslingers being as noble as the seven, after all) but opines that \\\"you might have given us the benefit of the doubt.\\\" In Seven Samurai, a father is so terrified that his daughter will be raped by the Samurai that he cuts off her hair to disguise her as a boy.",
      "general": "The tendency of movies to depict the villain's associated armies, tribes, barbarian hordes, and bands of mercenaries as being prone to raping the women of a town they're overrunning, while the armies, tribes, barbarian hordes, and mercs that are working for the hero are usually innocent of this particular atrocity.\\nIn modern times, it would preclude all audience sympathy to portray a heroic character as having a tolerance (or even worse, a taste) for forcing himself on captive women. A protagonist may have other character flaws; may plunder the enemy's gold, burn the enemy's crops, torch the enemy's buildings, or visit bordellos, but in most stories, there will be no rape or tolerance of it in his outfit. Rape will be forbidden, and malefactors will be dealt with.\\nMovies that involve historical generals, chiefs, or warlords will generally treat it as a given that they didn't tolerate such things, unless such leaders are the villains of the work. Sometimes the all-too-common occurrence of officers who did disapprove being limited in their ability to control their men will be shown, since it still leaves the hero sympathetic.\\nAlthough we'd never tolerate it from a hero, rape remains one of the many depraved types of behavior we may expect from a villain. Villains being villains, rape while pillaging will still be the order of the day when the evil enemy soldiers attack a village full of protagonists, and will be used to underline exactly how ruthless and vile The Enemy is. Individual mooks might be above this, but an army full of them... not so much.\\nOften a case of Values Dissonance. Behavior that was often tolerated or even approved strikes us as horrifying and disgusting and gets reserved only for the villains.\\nAlso possibly symptomatic of The Pirates Who Don't Do Anything. Whichever side we, the audience, are supposed to identify with is simply going to be assumed not to do that sort of thing, whatever their attitude to other atrocities.\\nToo many aversions go to the opposite extreme, painting whatever era or world they're set in as a No Woman's Land Crapsack World, which is an oversimplification at best, sometimes outright Demonization. Modern audiences like to be told that they're much more civilized than their ancestors, even if their ancestors have to get varying degrees of Historical Villain Upgrade in the process. History itself is often taught this way, as well, because it's useful to whatever ideology dominates an educational system to try and show how much better the ideology has made things since the Bad Old Days.\\nThis trope is not going anywhere. There's no shame in audiences demanding minimal standards of conduct from characters courting their support, and writers are wise to remember this. Having pirates that act like pirates, or Vikings that act like Vikings would alienate the audience, which is something to be avoided with far more care than historical inaccuracy. Even history buffs that sneer at inaccurate diet or clothing styles may cringe.\\nBlack Comedy may invoke Aren't You Going To Ravish Us?\\nSee also Politically Correct History and Historical Hero Upgrade. Subversions often involve Historical Villain Upgrade, Crapsack World, No Woman's Land."
    },
    "name": "The Women Are Safe with Us",
    "rdf_element": "TheWomenAreSafeWithUs/int_40e0e908",
    "short_name": "TheWomenAreSafeWithUs",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TheWomenAreSafeWithUs"
  },
  {
    "categories": [
      "CombatTropes"
    ],
    "descriptions": {
      "TheMagnificentSeven": "In The Magnificent Seven, The Seven wonder why the bandits keep attacking them instead of going off to find easier pickings. They learn that the bandits haven't eaten in days and if they don't get the village's food they will starve.",
      "general": "Whether the characters are fighting men or monsters, they will often attack long after any sensible foe would have attempted surrender or retreat. They may suffer from crippling injuries, or even injuries that will be fatal without treatment.\\nMay be justified (among humans) by having their pride hurt or honor involved, having lost so much that only victory can redeem them, having nowhere to run to, or having an absolutely crucial need for victory, so that flight would just be prolonging their pain, or (among monsters) by having them maddened in some way, but often enough it's just shown. Or maybe the character is simply a Fearless Fool.\\nHarder to justify, but popular, is that they fight until they drop dead. No one is crippled or disabled by wounds \\u2014 and not because they took Bottled Heroic Resolve. This can overlap with Critical Existence Failure, especially in videogames.\\nThe Determinator is prone to it, although depending on what he is determined on, he may not engage in it.\\nCommon among Mooks, though not the most common form of Mook Chivalry. One sign of The Berserker, who will often continue to attack after all his foes are down, not being able to distinguish between Friend or Foe. Lawful Stupid characters may also engage in it. A We Have Reserves general usually demands it.\\nCompare Last Stand, where retreating from some fights would be carried out whenever practical, and Unconscious Objector, where they keep attacking even after they're too beaten up to realize they're doing it.\\nInversion is Screw This, I'm Outta Here!. See also Leeroy Jenkins. Contrast Super-Persistent Predator. Possible duplication with I Will Fight Some More Forever. Attack! Attack... Retreat! Retreat! is a comedy version when this trope is juxtaposed with Oh Crap! and becomes Screw This, I'm Outta Here!.\\nNot to be confused with Tora! Tora! Tora!.\\nThe \\\"AI in Video Games\\\" equivalent is Suicidal Overconfidence."
    },
    "name": "Attack! Attack! Attack!",
    "rdf_element": "AttackAttackAttack/int_40e0e908",
    "short_name": "AttackAttackAttack",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/AttackAttackAttack"
  },
  {
    "categories": [
      "DerivativeWorks"
    ],
    "descriptions": {
      "TheMagnificentSeven": "The Magnificent Seven is a remake of the Japanese film Seven Samurai, which was then remade IN SPACE! as Battle Beyond the Stars, remade and computer animated as A Bug's Life, then remade yet again as the anime Samurai Seven. This scenario is so prominent that it even spawned a trope, The Magnificent Seven Samurai.",
      "general": "It has become common in the past few decades to make updated versions of older films. This can be done for several reasons: the director may be a fan of the original work, the studios may want to capitalize on nostalgia, or the writers may want to approach the original plot from a different angle. A movie is not a remake if it is based on the same source as an earlier film, such as the 1967 and 1998 versions of Doctor Doolittle, which were both based on the book series.\\nA variation on The Remake is the Foreign Remake, an English version of a foreign movie. It can be between any two countries, such as The Ring, a Japanese film remade in the US.\\nThe Video Game Remake is a subtrope of this, as is The Film of the Series.\\nTV shows can also be remade, but this is much rarer because of the tendency to instead make later series part of the same continuity as the earlier ones. When a series is remade it is often a Continuity Reboot as well.\\nIt should be noted that remakes have existed almost as long as there have been movies.\\nNot to be confused with the REmake, which is a specific example of a Video Game Remake, or the 2006 Slasher Movie The Remake.\\nRemakes are also similar to Continuity Reboots, and there is occasionally some overlap. However, one of the key differences between a straight remake and a Continuity Reboot is that anything can be remade, but only a long-running series can be rebooted. Re Tool is also often congruent with both Continuity Reboots and remakes.\\nThe terms \\\"remake\\\" and \\\"reimagining\\\" are somewhat interchangeable and fall under the same general heading, but there is a difference of degree. Reimaginings take more liberties with the original than remakes typically do, so billing a project as a reimagining is a signal that the audience should not expect it to closely follow the original.\\nA Tone Shift will often be part of the Remake, especially if it's billed as a reimagining."
    },
    "name": "The Remake",
    "rdf_element": "TheRemake/int_40e0e908",
    "short_name": "TheRemake",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TheRemake"
  },
  {
    "categories": [
      "SolitaryTropes"
    ],
    "descriptions": {
      "TheMagnificentSeven": "The Magnificent Seven is a Western adaptation of The Seven Samurai.",
      "general": "The medieval Knight Errant stems from the Chivalric Romance, where individual Knights In Shining Armor would wander the land, searching for evil to slay and ladies to rescue, guided by the Damsel Errant. Since then, knights have declined in popularity, but the Knight Errant is still around in full force \\u2014 instead of knights, they are now often samurai, cowboys, or Samurai Cowboys.\\nHistorically a knight errant would refer to a landless knight who would travel with his lord in service and hope of earning his own land. If he is traveling because he was sent by someone it might be a case of My Master, Right or Wrong.\\nThey are basically the feudal equivalent of The Stateless.\\nKnights Errant have some or all of the following traits:\\n They, by definition, have Chronic Hero Syndrome. They may or may not request compensation, but will always try to do the right thing.\\n They have no fixed home, and spend their lives Walking the Earth (Errant means \\\"wandering\\\"). When they're finished smiting the local evil, they'll up and leave.\\n They have a code of honor. If they are heroes, they can be a Knight in Sour Armor, but will always have some degree of idealism inside. On the rare occasion they're a villain, they're usually a Noble Demon or He Who Fights Monsters.\\n They seek out wrongs to right, generally on a small scale \\u2014 a town beset by bandits, a dragon preying on the locals, etc. Only occasionally will they be pitted against an Evil Overlord with earth-conquering ambitions. They often have one specific quest they are on, but you can count on them running into unrelated trouble along the way.\\n They are loners. They do not have any True Companions and are not part of a Five-Man Band. They may travel with a squire or two, but not with peers; they leave allies behind when they leave town. Their love interests, if any, are left behind or bumped off by the bad guys.\\n Sometimes, they are The Stoic, almost to the point of being less a character and more a physical incarnation of justice. They are very prone to having a Mysterious Past. This type generally overlaps with The Drifter.\\n The classic Knight Errant of Chivalric Romance is often accompanied by his Distaff Counterpart and complement the Damsel Errant. He is seeking adventure and she knows where adventures are to be found.\\nThere are many variations on the Knight Errant outside of Knights In Shining Armor. The Western very often stars a Knight Errant in the form of a wandering gunslinger or cowboy. Samurai are often, and Ronin are almost always, Knights Errant. Wuxia heroes are Knights Errant. Because of the shared archetype, stories about one type of Knight Errant can easily be Recycled IN SPACE \\u2014 New Old West and Space Western are examples of this.\\nCompare The Drifter, an accidental Knight Errant.\\nSee Knights Errant for the webcomic."
    },
    "name": "Knight Errant",
    "rdf_element": "KnightErrant/int_40e0e908",
    "short_name": "KnightErrant",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/KnightErrant"
  },
  {
    "categories": [
      "FairyTaleTropes"
    ],
    "descriptions": {
      "TheMagnificentSeven": "Shows up in The Magnificent Seven with Chico, the inexperienced young gun tagging along behind the other more experienced gunslingers on the ride to the Mexican village.",
      "general": "In any series of ostensibly-similar individuals, the last one will always be smaller than (or otherwise different from) the rest, and will often cause more trouble than the others. Just to drive the point home, they may have an Odd Name Out.\\nWhen the Youngest Child Wins, the child is often The Runt At The End, and may also be The Fool. In less sensitive works, will also often be a Butt Monkey. Be careful, because sometimes The Runt At The End turns out to be a Pint-Sized Powerhouse.\\nCompare Arson, Murder, and Jaywalking, The Last of These Is Not Like the Others."
    },
    "name": "The Runt at the End",
    "rdf_element": "TheRuntAtTheEnd/int_40e0e908",
    "short_name": "TheRuntAtTheEnd",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TheRuntAtTheEnd"
  },
  {
    "categories": [],
    "descriptions": {
      "TheMagnificentSeven": "Invoked, then inverted in The Magnificent Seven. While looking for gunmen to hire, one farmer suggests one that has lots of scars on his face, thinking that scars are a sign of toughness. Another farmer replies that \\\"The man for us is the one who GAVE him that face.\\\"",
      "general": "A relatively simple way for a writer to show a character's tough without explicitly saying it: give them a prominent scar. Even if the cause of the scar is never revealed, it's clear that the character suffered some sort of serious wound and survived. For example, you look at a group of Space Marines. Who do you think is the toughest one there? The clean-faced guy or the guy with a healed gash across his face?\\nLike an Eyepatch After Time Skip, it's a common tool to show a character is a Future Badass.\\nCommon Rugged Scars include:\\n A cut over one eye\\n A claw mark (usually three or four even gashes on the chest or face)\\n Any of the Standard Bleeding Spots\\n Any scar shaped like an X.\\nCompare Every Scar Has A Story and Scar Survey. In this case, the story behind the scar is irrelevant, all that matters is that the character's scar sets them apart as tough or a survivor. Overlap between the two is possible; even if the cause of a scar is revealed, if it is used to show someone is tough then this applies as well. Covered in Scars is a subtrope that occurs when this is taken Up to Eleven. Goes hand-in-hand with Real Men Get Shot. Supertrope to Dueling Scar."
    },
    "name": "Rugged Scar",
    "rdf_element": "RuggedScar/int_40e0e908",
    "short_name": "RuggedScar",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/RuggedScar"
  },
  {
    "categories": [
      "IndexToTheRescue"
    ],
    "descriptions": {
      "TheMagnificentSeven": "In The Magnificent Seven, the eponymous seven are betrayed by a group of villagers and driven out of the town they were hired to protect. One by one, they each decide to go back, except for Harry Luck, who informs them they're all crazy and rides away. When Chris is cornered without cover during the climactic gunfight, however, Harry comes galloping in to save him.",
      "general": "It starts with the hero about to go into a big fight, maybe against the Big Bad or at least one of his most powerful minions. He's gonna need all the help he can get, but one of his allies - likely the one he's had the least amount of trust in anyway through this whole ordeal - just wants to leave when he has the chance. The guy will call it self-preservation or common sense, but even if the hero chides him for being selfish, he can live with that. \\\"Fine, be that way!\\\" the hero shouts, and they part company, likely on a sour note.\\nNow, with the hero left alone, the fight looks lost. But no! At the last moment that same untrustworthy ally in question returns to save the protagonist. Why? Changed his mind. A way of setting up Big Damn Heroes. See also Conscience Makes You Go Back.\\nFriends can let the hero down for many reasons. Coming back usually entails character growth.\\n\\nExamples"
    },
    "name": "Changed My Mind, Kid",
    "rdf_element": "ChangedMyMindKid/int_40e0e908",
    "short_name": "ChangedMyMindKid",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ChangedMyMindKid"
  },
  {
    "categories": [
      "Mentors"
    ],
    "descriptions": {
      "TheMagnificentSeven": "The Old Man in The Magnificent Seven is probably the ur-example for the Western.",
      "general": "The Wasteland Elder is the de facto leader of his small, rundown community. Maybe it's After the End, it could be a Western frontier town fallen on hard times, or even just a tent town for squatters in the middle of a city. No one elected him, he never put his name in a sorting hat, nor does he push his leadership on his people, he's simply an old survivor and respected enough that his word carries weight. Male pronouns are used throughout this trope, but this is an equal opportunity character.\\nIf there's an actual mayor, he's either corrupt or been forced to help the Big Bad. When The Hero comes to town, it's usually the Wasteland Elder who serves as Mr. Exposition and asks him for help. If the story is about empowering normal people, or The Hero needs help taking down the Big Bad, he's the one who rallies the Untrusting Community to take up arms and become a Posse. With a little luck, they won't be dying like animals any longer.\\nOnce the Big Bad is beat, the Wasteland Elder usually rallies his constituents to start working to improve their town, thanking The Hero for all they've done and offering them a more permanent home if he's The Drifter.\\nSee also After the End, Reasonable Authority Figure, Western Characters, Character Witness. If he has \\\"subjects\\\" and is homeless, he's the King of the Homeless. Not to be confused with Hermit Guru."
    },
    "name": "Wasteland Elder",
    "rdf_element": "WastelandElder/int_40e0e908",
    "short_name": "WastelandElder",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/WastelandElder"
  },
  {
    "categories": [
      "EquineAndEquestrianTropes"
    ],
    "descriptions": {
      "TheMagnificentSeven": "Played with in The Magnificent Seven. Britt shoots a bandit off his horse at long range. After Chico compliments him, he demurs: \\\"I was aiming for the horse.\\\"\\n In the big fight scenes, however, there are several instances of horses falling down from being shot, or being dragged down. They appear to be well-trained stunt animals.",
      "general": "In any combat situation with people riding horses on one side, and ranged weapons on the other, some of the bullets (arrows, etc.) are going to hit the horses. After all, real bullets don't have anyone's name on them, they're addressed \\\"to whom it may concern\\\", and a horse makes a mighty big target. It's pretty inevitable that some of those horses are going to get hit and fall down, probably further injuring themselves.\\nThe problem is this is very hard to fake in live-action film and TV barring CGI or similar advanced effects. Training a horse to fall down on cue is hard and training a horse to fall down at a gallop is nigh-impossible. During the 1920s and 1930s, movies often did horse fall stunts with tripwires, with fatal results for many of the horses. Actually shooting a horse is, of course, cruel, expensive, wasteful, and probably illegal, but is sometimes done where the law doesn't prohibit it.\\nCome to think of it, the \\\"expensive\\\" and \\\"wasteful\\\" parts make this a Justified Trope in some situations; they've got a pretty good resale value if you can manage to kill the rider instead. After all, horses are more expensive than humans, who can be replaced for free.\\nThe result is that you can watch dozens of Westerns and never see a horse get shot, no matter how many riders are shot off of them. Because people tend to be sensitive to cruelty against horses, this trope also appears in non-live-action fiction.\\nAs this trope is very common, the examples on this page favor aversions."
    },
    "name": "Invulnerable Horses",
    "rdf_element": "InvulnerableHorses/int_40e0e908",
    "short_name": "InvulnerableHorses",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/InvulnerableHorses"
  },
  {
    "categories": [],
    "descriptions": {
      "TheMagnificentSeven": "Several characters in The Magnificent Seven are gunslingers working as drifter cowboys at the start of the movie.",
      "general": "The Cowboy is the archetypical character of the Western, perhaps the quintessential American hero. In the simplest terms, a \\\"cowboy\\\" is someone whose primary job is tending a herd of cattle on a ranch. In more general terms, it can be any character that has the appearance and mannerisms of a cowboy. Thus, the term \\\"cowboy\\\" is often used as an inclusive term for any Western characters, regardless of whether they are actually ranchers or not.\\nSubtypes include:\\nWorking Cowboy: A cowboy who actually has a job herding cattle and spends the majority of his time doing that job. Working cowboys tend to have more worn clothing, scruffier appearances and stronger odors than other types of cowboys. Stories about working cowboys usually focus on the nitty-gritty of ranch work and the dangers of the trail, culminating in the Cattle Drive, with a herd of cattle being led across often hazardous terrain to market. A common plotline is for the working cowboy to be a nice fellow at heart, but have his rough appearance attract a woman because All Girls Want Bad Boys. Expect the parents to initially object, despite older ranch hands, perhaps even the foreman, vouching for the young cowboy's good nature.\\nThe common possessions of a Working Cowboy include: A saddle, a saddle blanket, a rope, some saddle bags and whatever personals he can fit in them (including his hat), as well as a rifle and a six-shooter. If he has his own horse he is well off (relatively) for a cowhand.\\nRodeo Rider: This fellow is a working cowboy on the off-season, but whenever there's a rodeo, he's off to show off his riding and roping skills. Rodeo riders tend to be more boastful and concerned with winning trophies than other cowboys. Stories about rodeo riders often play up the difficulties their nomadic lifestyle causes with relationships.\\nSinging Cowboy: A cowboy who sings as his primary avocation. While it's true that some musical talent was always appreciated on the range, the singing cowboy was really a product of Hollywood. The standard formula for B-movies included at least one musical number, and a singing cowboy could slip one right in naturally while saving the ranch. \\\"Saving the ranch\\\" is the number one plotline for singing cowboy stories, closely followed by \\\"clean up the lawless town.\\\" Top singing cowboys included Roy Rogers and Gene Autry, but even John Wayne was tested as one in an early movie! Now a Dead Horse Trope; nowadays if you see a singer in a cowboy hat, he's just a Country-Western musician.\\nPhilosopher Cowboy: This is The Smart Guy who decides he prefers honest work amid the outdoors rather than the City Life. Plutarch was a big read for literate cowboys, along with the Bible, parts of Shakespeare and whatever small books would fit in a saddlebag. May be called upon to say a few words on portentious occasions. Can come very close to the Warrior Poet.\\nLone Cowboy/Ranch Owner: This is the fellow who is running his own ranch often by himself on a rawhide (Cowboy shoestrings = rawhide) budget, perhaps aided by an old Indian friend or his young wife. Expect him to be the target of the Big Ranches who see him as easy prey. (He's the Cowboy equivalent of the Determined Homesteader.) Considered a good male love interest for Western-themed romance novels.\\nDude Ranch Cowboy: Similar to the working cowboy, but whose job is to give \\\"dudes\\\" (tourists) a taste of The Theme Park Version of ranch life. Generally more careful of his appearance than the working cowboy, many in fiction being ruggedly handsome. Often has to rescue a tenderfoot who is Too Dumb to Live, and can be the Temporary Love Interest for a female character. More serious-minded cowboys may be embarrassed by having to work on a dude ranch.\\nCowgirl: The Distaff Counterpart of the Cowboy. Generally a Plucky Girl in Western garb, who can ride and shoot as well as any man (except the protagonist), but who is seldom seen doing any of the filthier ranch chores. In fiction, almost always the love interest for the protagonist, or the young man the protagonist is helping this week. May be a plentiful source of Fetish Fuel (though to be fair, cowboys can be that too.) Not to be confused with females who are a Little Bit Beastly and bovine-based, or the result of mixing Cute Monster Girl and A Load of Bull.\\nGeography plays an important role in determining cowboy characters.\\nOn the Plains, larger ranches based around the water holes are to be expected with a significant number of working cowboys, with a scattering of Rodeo Riders.\\nIn the Mountains expect smaller ranches, with the result of more Lone Cowboys, Philosopher Cowboys (they like smaller operations where their intellect can be appreciated), and the ranches are more open to a Drifter Cowboy.\\nIn the Desert/Badlands, expect cowboys to be closer to the Indians, with two or three characters referred to as Apache, or raised by Apache. A lot more emphasis on water scarcity, similar to the mountains in character composition, but expect more Outlaws, both as The Rustlers, but also among the legitimate Working Cowboys. This is a land for Hard Men and if you do the work people don't ask questions.\\nSinging Cowboys might be anywhere, but are less likely in the Badlands, although they appear there too, sometimes as a way of showing the softer side of men.\\nIn fiction, black cowboys are much less common than they were in Real Life. After The American Civil War, a lot of freed slaves came west to make a living away from their former masters and the new \\\"sharecropping\\\" paradigm. Only in relatively recent times, however, has it become customary for visual media to reflect this.\\nMexican and Mexican-American cowboys, called Vaqueros, tended to fare better in media presentations, known for their riding and roping skills. Vaqueros are in fact the precursors to what we consider cowboys. It's from them that we get the equipment and the word \\\"rodeo\\\" and many of the events included in it, after all. This used to be mixed with unfortunate negative stereotypes, however. Many early vaqueros were Amerindians who worked in missions colonial New Spain.\\nThe Australian term for this profession is \\\"Jackaroo\\\", with \\\"Jillaroo\\\" for women (although there is a Rugby League team called the North Queensland Cowboys).\\nThis character type often overlaps with:\\n The Gunslinger. Most ranches were staffed by working cowboys, but usually at least a few were \\\"good with a gun\\\" despite not being professional gunfighters. All of them were expected to wield a gun if the ranch was attacked (known as \\\"riding for the brand\\\"), loyalty was highly prized, and drifter cowboys were often suspect for this reason. If a fight was expected the boss might go ahead and hire him some gunfighters.\\n The Drifter. A fair amount of ranch work is seasonal, and a cowboy without a solid reputation often had to go where they needed extra hands, rather than hold down a steady position. And not a few had the wanderlust.\\n Outlaw. The Evil Counterpart of the Cowboy is The Rustler, who uses the same skills to steal cattle and horses.\\nCompare the Cowboy Cop, who keeps the frontier attitude towards law enforcement; and the Space Cowboy, who is the Speculative Fiction version.\\nAlso be aware that Cowboy, with a capital \\\"C\\\" has a very specific meaning when discussing Tombstone, Arizona and the shootout at the OK Corral. In Tombstone, the Cowboys were a violent gang of rustlers opposed by Wyatt Earp and Doc Holliday. This is an example of how the term can be misused, as Doc would be insulted to be called a \\\"cowboy\\\" or a \\\"Cowboy.\\\"\\nSome say that the Cowboy is the third faction in the war between the Pirate and the Ninja, but the Cowboys work for a living, thank you kindly. Besides, they're more concerned with their traditional enemies: Indians, farmers, sheepherders and rustlers."
    },
    "name": "Cowboy",
    "rdf_element": "Cowboy/int_40e0e908",
    "short_name": "Cowboy",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/Cowboy"
  },
  {
    "categories": [
      "Criminals"
    ],
    "descriptions": {
      "TheMagnificentSeven": "Calvera and his band of outlaws in The Magnificent Seven.",
      "general": "A subset of the Outlaw with a Hispanic flavor. Most often found in stories set in Mexico or near the Mexican border.\\nStereotypically, the bandito has a thick Mexican accent, wears a sombrero and poncho or serape, and in later time periods a bandolier of ammunition. A thick mustache is common, but not mandatory. Many Banditos are designed after the real-life Bandito and revolution general Pancho Villa.\\nUsually the villains of a Western, but if portrayed sympathetically will have a Robin Hood code of honor, or be revolutionaries fighting against the corrupt government.\\nAs with the outlaw, the bandito often overlaps with The Gunslinger and Cowboy roles, with the latter being called vaqueros. A bandito might also be a Knife Nut or lariat expert and often Trigger Happy.\\nNote that bandito is the English spelling. In Spanish it is bandido. We get desperado from the Spanish desesperado."
    },
    "name": "Bandito",
    "rdf_element": "Bandito/int_40e0e908",
    "short_name": "Bandito",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/Bandito"
  },
  {
    "categories": [
      "Plots"
    ],
    "descriptions": {
      "TheMagnificentSeven": "The Magnificent Seven, for instance, is a direct western adaptation of Kurosawa's film.\\n And Battle Beyond the Stars, the Recycled In Space version.\\n And Samurai 7, the Recycled With Humongous Mecha version.\\n And Seven Swords, a chinese version.",
      "general": "There's a big bad gang/army out there that wants to sack the peaceful village for whatever reason. The Protagonist can't stop them by himself for whatever reason. Either way, it's time to teach the villagers how to fight and defend themselves. Expect some complaining about \\\"losing their peaceful way of life.\\\" If there's a Wasteland Elder around, expect them to back the hero and shush the young'un.\\nThe villagers will fight back with pitchforks, plowshares and frying pans. It will also include many Bamboo Technology traps involving previously innocuous items, like laundry buckets filled with boiling water. Usually, the outlaw band/army should have been able to beat them, had they taken the villagers seriously and fought with genuine strategy; but their downfall usually lay in rushing into traps.\\nIn some instances, the villagers may have existed under the oppression of the hordes for years or even generations without even thinking of fighting back. Not, that is, until The Hero shows up. Bathing in the glow of his shining example, the common people finally rise up to combat the Evil Overlords.\\nWith the enemy dead or on the run, and the villagers converted to the notion of violence for self-defense, the heroes leave.\\nSee also The Magnificent Seven Samurai, The Paragon, Perfect Pacifist People, Home Guard, Instant Militia. The village is often a Doomed Hometown that fights back. Compare Defiant Stone Throw. Contrast One-Man Army, where this sort of thing is not necessary.\\nFor added effect, listen to this while reading this page."
    },
    "name": "Training the Peaceful Villagers",
    "rdf_element": "TrainingThePeacefulVillagers/int_40e0e908",
    "short_name": "TrainingThePeacefulVillagers",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TrainingThePeacefulVillagers"
  },
  {
    "categories": [
      "TitleTropes"
    ],
    "descriptions": {
      "TheMagnificentSeven": "The Magnificent Seven became 7 rohkeata miest\\u00E4 (7 Brave Men).",
      "general": "When translating works of fiction sometimes you keep the original title in the original language. Sometimes you try to make up your own translation or equivalent. Sometimes you just make up a title. Often the results of copyright disputes or because the title cannot be translated and keep making sense (because it's based on a pun or a specific expression in the language it was made in, for example).\\nRelated to, but not to be confused with Market-Based Title. That trope is when titles are changed in the same language. This trope is when titles are changed in translation. If the title is changed to make it seem like the work is related to a totally unrelated work, it's a case of Translation Matchmaking. See also The Foreign Subtitle and In Name Only.\\nExamples are divided by language. Please list examples under the language being translated into, rather than the language translated from.\\nRemember that what you are reading could be a translation of a translation of a movie title, or even a translation of a specific interpretation of a \\\"Blind Idiot\\\" Translation... so particularly perplexing titles might not actually be a mistake on someone's part, it just worked out that way."
    },
    "name": "Completely Different Title",
    "rdf_element": "CompletelyDifferentTitle/int_40e0e908",
    "short_name": "CompletelyDifferentTitle",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/CompletelyDifferentTitle"
  },
  {
    "categories": [
      "FilmTropes"
    ],
    "descriptions": {
      "TheMagnificentSeven": "The Magnificent Seven has the first confrontation with Calvera and the bandits, which leads to a round of back-to-back Badass Boasts.",
      "general": "It is well known that the second act of any story is one of the most important parts and one of the hardest to get down right. So to keep everyone enthralled during this period you come up with The Centerpiece Spectacular.\\nThe Centerpiece Spectacular is a point in a story that is certainly not the climax, but it is situated during the middle of the story or sometimes even the beginning to really get their attention. You can usually identify it as being the sequence everyone is talking about, and that is usually because this sequence is the work's Crowning Moment of Awesome.\\nNow, there can often be a downside to this. It isn't a bad thing to make the centerpiece the high point of the story, but if the climax doesn't even come close to approaching it then it can end up being a let down. And if the running time of the story has too great a distance between the centerpiece and the climax, you can run into Ending Fatigue.\\nThe placing of The Centerpiece Spectacular can vary wildly, though it is never the climax. If this sequence happens towards the beginning of the story, it can overlap with an Establishing Character Moment. In early Act 2 it is intended to get the plot flowing fast. In late Act 2 it is a set-up for the climax."
    },
    "name": "The Centerpiece Spectacular",
    "rdf_element": "TheCenterpieceSpectacular/int_40e0e908",
    "short_name": "TheCenterpieceSpectacular",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TheCenterpieceSpectacular"
  },
  {
    "categories": [
      "NamingConventions"
    ],
    "descriptions": {
      "TheMagnificentSeven": "The Magnificent Seven.",
      "general": "If you have a group of people banding together to fight evil, or to cause it, then it's good to have a good team name that people will remember. If you can't think of anything else, then why not name yourself after the number of members you have, plus a nice adjective that describes you? Maybe try to tie it together in a pun or something.\\nIn the end, what do you have? Why, The Notable Numeral, of course!\\nThis naming convention is popular in Real Life to describe people who make the news as a group, usually as either the victims of a crime or as the people arrested for a crime (often in historic/sensational cases of people who are believed to be wrongly accused, whose case seems to represent a broader issue or who grab the public's attention in some other way), such as the Buffalo Six and the West Memphis Three. The Other Wiki calls these \\\"Quantified groups of defendants.\\\" Describing a single such defendant, usually fictional, as the something-or-other One is a Stock Parody.\\nThis can get awkward when you have a change in membership (unless the net change is zero). When changing the name would be very difficult, you'll just have to live with the name being an Artifact Title due to the One Extra Member (or one less member, as the case may be).\\nBeware, if excess alliteration disturbs you, then it might be best to look elsewhere.\\nSee also The Adjectival Superhero, where the adjective describes a person or team instead of a number. Can cross with Superhero Sobriquets if it's a nickname and not the team's proper name."
    },
    "name": "The Notable Numeral",
    "rdf_element": "TheNotableNumeral/int_40e0e908",
    "short_name": "TheNotableNumeral",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TheNotableNumeral"
  },
  {
    "categories": [
      "TheIndexTeam"
    ],
    "descriptions": {
      "TheMagnificentSeven": "In The Magnificent Seven there is a bit of this going on in two ways. The character Chico is viewed as this by the other characters, although the character Lee, played by Robert Vaughn, unlike the others, does not have a counterpart in the Seven Samurai and was created specifically for the film, making him also a Sixth Ranger.",
      "general": "Some series start out with a particular type of ensemble, with a certain number of characters and a defined role for each: a Power Trio, for example, or a Five-Man Band. Then, mid-season, a mysterious new character appears, fighting the protagonists and antagonists alike! After many misunderstandings, the new character is revealed to be a good guy, and joins the team.\\nAny new character that joins an established ensemble and knocks it out of one of the traditional categories (and possibly into another) is a Sixth Ranger. There may be more than one per team, with either several joining in succession, or pre-established pairs coming in at once. In a Magical Girl show, it is not uncommon for the Sixth Ranger to be the lead character's boyfriend.\\nTheir power and coolness is inversely proportional to the number of episodes since their d\\u00E9but, since Good Is Dumb. Expect them to be single-handedly defeating enemies that the main team struggled against during their first appearance, falling in line as they become integrated into the group, then finally getting overtaken by the original heroes. In fact, they almost invariably tend to become a magnet for The Worf Effect as soon as the latest new Big Bad shows up.\\nIn some of the more extreme cases, a former Big Bad, Dragon, or Wild Card villain can take on this role after they have been defeated or performed an independent Heel-Face Turn, and may or may not act as a secondary Lancer.\\nIf the show doesn't look like it's going to change its status quo, expect the Sixth Ranger to actually be the Sixth Ranger Traitor. Since most Sixth Rangers used to be loners, they may serve as the Token Evil Teammate. If a Sixth Ranger candidate does join the Ensemble, but the series is nearly over, the candidate is an Eleventh Hour Ranger. When the team started as a Power Trio and gets two Sixth Rangers to make a Five-Man Band, they make Three Plus Two.\\nCompare Hitchhiker Heroes and Magnetic Hero, where adding characters is the team's normal state. Sailor Earth is a Fan Work subtrope where the Sixth Ranger is an Original Character. Also see One Extra Member, especially when the team's name indicates the number of members and the Sixth Ranger doesn't force a change in the team's name.\\nNamed for the introduction of the Green Ranger in the original Mighty Morphin' Power Rangers.\\nA common method for Merchandise-Driven works to add new characters to the cast\\u2014and the toy line."
    },
    "name": "Sixth Ranger",
    "rdf_element": "SixthRanger/int_40e0e908",
    "short_name": "SixthRanger",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SixthRanger"
  },
  {
    "categories": [
      "ActionAdventureTropes"
    ],
    "descriptions": {
      "TheMagnificentSeven": "The Magnificent Seven - This film is actually a remake of Seven Samurai as a Western.",
      "general": "One of the many ways your hometown can become a Doomed Hometown. A group of bandits, pirates, or even mooks working for a Big Bad cause trouble primarily by sacking the town - that is, looting, damaging property, and sometimes even murdering and kidnapping innocent townsfolk. Raping is optional(-ly shown), but the town is almost always burned down afterward. This gives an excellent opportunity for the bad guys to Kick the Dog. Rape, Pillage, and Burn is guaranteed to appear in any work involving Pirates or Horny Vikings. Sometimes appears, though not as frequently, in the Wild West or Medieval European Fantasy. This activity is a common pastime of The Horde.\\nThis is one way to gain Plunder. If this problem persists, villagers may resort to hiring The Magnificent Seven Samurai.\\nTruth in Television. This is generally a problem in areas without a strong government to keep order, even today. In many civilizations, it was not resolved until power, money, and land were consolidated under noblemen and kings rich enough to afford standing armies. It is also one reason why peasants in older times tolerated kings and nobles who were quite nasty, as the alternative was almost always constant chaos caused by dozens and dozens of rival warlords.\\nIt should be noted that as nasty as this trope can get, its not entirely unjustified in terms of cold hard pragmatism, at least in less civilized settings. It provides food, supplies, and funds for an army far away from home which is in constant need of all three. It raises morale among the attacking forces, demoralizes the victims, and builds a fearsome reputation which can among be used to coerce surrender. The downside is that creates a lot of resentment from the population, turns enemy troops fanatical and invites reprisals, damages the economic value of the area you conquer, postpones cultural assimilation by decades, and can become addictive to the troops, which is a big problem when they return home. Even \\\"good guys\\\" like Lincoln in the Civil War were known to order this, because supplies were making them tactically sluggish. Also, rape can mean multiple things. One of the more archaic definitions is \\\"to capture\\\".\\nAnd remember, to avoid (even more) squick, it's rape, pillage, then burn."
    },
    "name": "Rape, Pillage, and Burn",
    "rdf_element": "RapePillageAndBurn/int_40e0e908",
    "short_name": "RapePillageAndBurn",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/RapePillageAndBurn"
  }
]