[
  {
    "categories": [
      "SelfDemonstratingArticle"
    ],
    "descriptions": {
      "Willow": "Willow contains a predestination paradox (if you assume, as the film does, that prophecy really is knowledge of the future): Bavmorda's attempts to destroy Elora are the very thing that causes her own destruction, which she would not have attempted to do EXCEPT for foreknowledge that Elora was going to cause her destruction.",
      "general": "A contradiction of causality within the timeline brought about by Time Travel. Theorized to be dangerous to the fabric of reality, and known to be dangerous to the brains of anyone who tries to get their head around them. So don't. It's usually what The Professor worries about during a Time Travel story.\\nPunishments for creating a paradox vary. You might instantly vanish from history or cause your time-travelling self to be erased; you might be immune but find the world around you different; you might destroy reality itself; heck, you might even accidentally unleash killer flying time monkeys.\\nThis is all fictional, of course. In reality, a confirmed paradox would disallow time travel to work at all. You see, a logical paradox is not a thing. It is a sign in a human-created model that either you have attempted something impossible or that you have incomplete understanding of how something works. Here's the thing: all our notions of causality are based on the fact that time only moves in the one direction and a paradox exploits this cause and effect relationship. Once you throw Time Travel into the equation and have time move in a different way, it's really anyone's guess what will happen. Not that this prevents authors from abusing the concept as a sort of universe-wide Logic Bomb.\\nThere are many kinds of paradoxes that can be created by poorly thought-out time travel, but it usually fits one of these two major categories:\\nGrandfather Paradox\\nThis paradox gets its name for a very simple question: \\\"what would happen to you if you went back in time and killed your grandfather before he had offspring?\\\" (Parodied by Futurama; see example in Stable Time Loop)\\nMore generally, this means doing something that makes your time travel impossible or unnecessary. For instance, if success in the time travel endeavor means that the condition you set out to change never happens, then you won't ever have had any reason to come back and try to change it. Thus, without your intervention, it will happen after all, meaning you then must go back to change it, meaning you don't have to, meaning you have to, and so on, ad infinitum.\\nMost cases of Mental Time Travel sidestep or ignore the grandfather paradox.\\nOntological Paradox\\nThe kind of paradox that occurs in a Stable Time Loop if you're not very careful about what you're doing, involving events that are their own causes. While not a paradox in the strictest sense - events remain self-consistent - it does violate normal expectations in surprising waysnote\\u00A0Quantum physics comes into play, see discussion. Common variations include:\\nThe Object Loop\\nAn object from the future is sent into the past, takes The Slow Path back to the future, and then gets sent back into the past again, in the same way, for the same purpose. For example, you travel to the past and sell a pair of antique glasses you got from a friend, who inherited them from his grandfather, who bought them from you, the time traveler. This time loop results in several important physics problems, such as:\\nWhere did the glasses come from in the first place? The glasses have literally sprung into existence from nothing, appearing to violate the law of conservation of energy/mass. This is sometimes called a \\\"closed timelike curve\\\" in hard SF.\\nHow does the object escape erosion or other forms of damage? Since its origin point is also its end point, the object cannot (relative to itself) loop endlessly as it would experience infinite decay (relative to itself) and therefore would not exist to be sent to the past, preventing the loop from occurring at all. Thus, to exist the object must (improbably) escape all forms of damage/erosion/entropy between its arrival and departure; technically, this isn't impossible, but its improbability makes object loops very weird from a quantum mechanics perspective.\\nIn one common variation, information loops, rather than physical objects: for instance, an engineer from the future gives the formula for transparent aluminum to its historical \\\"inventor\\\", becoming the creator of a metal that has always existed. This version may avoid the problem of decay, provided that the information is correctly transmitted and recorded. The actual effect of this variation is that no one invented the object, or no one discovered the formula/concept. It's just there.\\nThe object could also be repaired, or otherwise reset to a certain state, at some point during its existence; this would be the closest to creation the object experiences. This is a variant of an information loop, in that the object contains or suggests information (what it should be like) that is used (along with whatever remains of the damaged object) to create the like-new object.\\nThe Reverse Grandfather Paradox\\nWhen time travel is involved, cause and effect tend to get muddled. Say you remember being involved in an accident as a child, and would have died if not for the intervention of a mysterious stranger who showed up, saved your life and then vanished without a trace. Later, you become a time traveler and find yourself at the scene of the accident, and there's a little kid who needs saving. That's right: you happen to be the mysterious rescuer. Instead of accidentally making your time travel unnecessary or impossible by meddling with the past, your meddling somehow made it required or possible in the first place. But then the question becomes how you originally (an increasingly meaningless concept in this context) survived to time-travel and save yourself.\\nThus, an ontological paradox occurs, which is not actually a paradox in the logical sense, but a confusing and counter-intuitive result of time travel. This also precludes a multiverse explanation, since both child and rescuer-adult occupy the same timeline and universe, if the child has a childhood-memory of being rescued by the adult-self.\\nNormally, as written, the temporal paradox never turns out to be as dangerous as The Professor imagined it would be, or it turns out the characters were \\\"supposed to do it\\\" in the original timeline. The latter ontological paradox is also known as a predestination paradox, and the resultant philosophical questions are rarely thought about in the series.\\nIf two time periods are featured, the effects of a paradox will usually be visible in the future only \\\"after\\\" the cause has happened in the past (see Meanwhile, in the Future).\\nInterestingly, series rarely have the same result to paradoxes even in the same show.\\nThe most common effect of a paradox, on TV at least, is to trigger the Reset Button and unmake the entire episode's consequences.\\nTheoretically, a paradox that consists of two mutually-exclusive events can have one of two results: either the fabric of reality rips itself apart trying to determine which reality is the 'correct' one, or \\u2014 according to Multiverse Theory \\u2014 it's discovered that causing a paradox is a technical impossibility, as each supposed 'paradox' merely creates two 'alternate' timelines \\u2014 one for 'Situation A' and another for 'Situation B'.\\n(Of course, Multiverse Theory also holds that time-travel is hypothetically possible \\u2014 since every choice made, and every action taken, and every word ever written, creates a series of 'alternate universes', each being slightly different to account for the results of the choice/action/word, we would just need a consistent way to travel 'between' the various 'multiverses' thus created.) On the flip side, it also means that it's impossible to completely Set Right What Once Went Wrong, as the \\\"original\\\" timeline will always be unchanged.\\nCompare Timey-Wimey Ball, Stable Time Loop. If time is somehow dangerous besides from paradox, it's Time Is Dangerous."
    },
    "name": "Temporal Paradox",
    "rdf_element": "TemporalParadox/int_21ff24b7",
    "short_name": "TemporalParadox",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TemporalParadox"
  },
  {
    "categories": [
      "Telepathy"
    ],
    "descriptions": {
      "Willow": "Queen Bavmorda from Willow.",
      "general": "The Evil Sorcerer is the living (or occasionally undead) proof of the maxim that power corrupts and that absolute power corrupts absolutely.\\nHe, or sometimes she, is the mage who has delved too deeply into Things Man Was Not Meant to Know and mastered The Dark Arts. He has achieved great power, but at the expense of his soul. He deals in Black Magic and might well have made a Deal with the Devil. Evil Sorcerers are very dangerous foes, as they are creative as well as clever. From them, one can expect anything; hordes of demonic (Or Undead) Mooks as the bluntest tool, More Than Mind Control as the subtlest one, and anything between those two and beyond. He will probably be a Sorcerous Overlord, dwelling in an Evil Tower of Ominousness and ruling the land with an iron \\u2014 but also magical \\u2014 fist, though he may also show up as an Evil Chancellor, using his powers to subvert the throne more subtly.\\nThe Evil Sorcerer nearly always gets top billing as a villain, as one of his most common traits is pride. Where he is a second-stringer, he's likely to only be one-upped by a demonic bargain gone wrong \\u2014 probably because he cheated. This makes him prone to learning the painful lesson that Evil Is Not a Toy. He might also be upstaged by a God of Evil \\u2014 but then, the most powerful Evil Sorcerers often have delusions of godhood themselves. In a villainous hierarchy, he'll most likely be the Big Bad, The Dragon, or the Evil Genius (though he could also be The Man Behind the Man or, if he has little loyalty to any particular faction, the Wild Card). Killing the Evil Sorcerer is one way to stop his Keystone Army.\\nThe Evil Sorcerer can be at several levels of the Super Weight scale (depending on how strong magic is in a given setting) but he'll almost always be far more powerful than the heroes (unless they manage to get physical with him), and will probably be at least superficially stronger than his good counterparts (owing to possessing powers that they can't or won't use). If he's an Evil Archmage, everybody should watch out.\\nIt's likely that every sorcerer will be this if Magic Is Evil. Compare the Wicked Witch and (for the more modern descendant) Mad Scientist. Female versions are likely to also be a Vain Sorceress. An undead Evil Sorcerer will probably be called a Lich."
    },
    "name": "Evil Sorcerer",
    "rdf_element": "EvilSorcerer/int_21ff24b7",
    "short_name": "EvilSorcerer",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/EvilSorcerer"
  },
  {
    "categories": [
      "ActionAdventureTropes"
    ],
    "descriptions": {
      "Willow": "Willow, Krull, Legend. Basically every 80s fantasy movie was required to end this way.",
      "general": "There are really only a few good ways to end an action movie. You've got your car chase, your mano-a-mano showdown, and your grand, sweeping Final Battle (and maybe something else. Or maybe not. Whatever). These are all well and good, but sometimes the Big Bad isn't gracious enough to come to you. In that case, you'd better go to them.\\nThat means it's time to gear up and assault the bad guy's home base. Sure, maybe it's guarded by countless extremely well-trained warriors, a squad of bounty hunters looking for your head, and even The Dragon, but what choice do you have? Maybe the villain's stole your secret sauce recipe, and he's not afraid to use it. Maybe he's gonna force your girlfriend to marry him. Maybe he just can't be trusted not to come back worse than before. In any case, the only way to stop him is to take him down.\\nIn Real Life, particularly during the Middle Ages, actually storming the castle was the tactic of last resort, due to how most fortifications are built specifically to give the defenders every advantage possible. Hence why they're called \\\"fortifications\\\". Any sort of direct assault on properly built and manned fortifications required a hell of a numerical advantage, very solid morale, and often repeated attacks\\u2014and even then it would be an absolute bloodbath. More often sieges were won by cutting off the defenders from supplies and starving them to death or surrender (which could take years), by breaching the defenses from the outside and marching in that way (not always practical), or by convincing enemy soldiers within the defenses to Turn Coat and let you in (very difficult). Going through the front door is almost always a suicide mission (assuming it's even possible), but it sure is entertaining.\\nWhile Storming The Castle can take place before the story's climax, the results are generally less dramatic. If a villain does this to the heroes, it's All Your Base Are Belong to Us and/or The Siege, in which a small number of heroes Hold the Line against numerically superior invaders. Weirdly, the good guys tend to win no matter who's attacking what... or at least they do most of the time.\\nMay constitute a Suicide Mission. Compare Foe-Tossing Charge, which is on a smaller scale.\\nIn a variant, instead of directly attacking the castle with massive forces, a small party will sneak in (through the sewers, disguised as delivering supplies, Dressing as the Enemy, etc.) and attempt to take the castle from within.\\n\\nExamples"
    },
    "name": "Storming the Castle",
    "rdf_element": "StormingTheCastle/int_21ff24b7",
    "short_name": "StormingTheCastle",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/StormingTheCastle"
  },
  {
    "categories": [
      "FantasticSapientSpeciesTropes"
    ],
    "descriptions": {
      "Willow": "The Nelwyns from the 1988 fantasy film Willow, made by Ron Howard and George Lucas. Although an otherwise straight example, Willow himself takes on the Big Bad on in the end and wins. Although this is through a bluff about his level of power (and some practiced sleight-of-hand), by the end of the sequel novels (a.k.a. the Shadow trilogy) he is probably the most powerful mortal magic user in the setting. He retires; having decided it's Lonely at the Top and goes back to his community.",
      "general": "Hobbits are a breed of Fae; note the Pointy Ears in the films of The Lord of the Rings. They can specifically be considered Fae/human hybrids, which in addition to their height, is part of the reason why they are also known as Halflings in many works. It is easy to assume hobbits are stand-ins for humans, since they lack magic or other flashy gimmicks. Paradoxically, this can make them seem more like \\\"modern\\\" humans than the humans in their settings.\\nThey are usually a small, \\\"innocent\\\" version of people who only want to enjoy life without big plans or complications. Then they're thrown into the world suddenly and have to survive on their wits and luck. They occasionally are the ones to get the Golden Snitch. At the beginning of a given story, a hobbit character will usually also be exceptionally naive, unworldly, and illustrate the difference between wisdom and intelligence; as they usually have a fair amount of the former, with none of the latter.\\nIf the Hobbit/Halfling is a member of The Team then expect him to act as The Sneaky Guy, (more specifically, the Thief from the Fighter, Mage, Thief trio, or a \\\"burglar\\\" in the Trope Maker) He will also periodically overcome his apparently fearful nature and get dangerous, with a resulting Super Weight of 1, edging towards 2 in some cases. Character development usually revolves around them learning Waif-Fu, becoming less naive, (simply because their native environment usually isn't dangerous at all, but the world outside it is) and taking a level in badass in general terms.\\nHobbits also tend to be small, possibly to make younger audiences easily identify with them. It is an easy way to make them seem less threatening to other characters. Jerks will get frustrated with them. If your cast is otherwise filled with fantastic and lordly people, you know people who treat them nicely are good at heart.\\nIt is common in anime for Hobbits to literally look like young children, regardless of age.\\nIf the heroes encounter an entire town of Hobbits, it is to protect such a place from encroaching forces of evil.\\nWhile The Lord of the Rings has defined the modern interpretation of most of the races in fantasy fiction, hobbits are unique in the sense that they were nearly completely Tolkien's own creation, and were adopted to other fantasy worlds from there. Their oddly specific traits tend to include very high magic resistance, higher than average luck and good sling, slingshot and rock throwing abilities.\\nIncidentally, the word \\\"hobbit\\\" dates back at least to 1895 and probably earlier than that; Michael Aislabie Denham mentions them in a Long List of fantastical creatures. (See Quotes.All Trolls Are Different for the full list.) Nevertheless, it's very common for non-Tolkien works to come up with a different name for their hobbit-like race, as the Tolkien estate, and even more so the owners of the film rights, are notoriously litigious.\\nSee The Hobbit for the book by J. R. R. Tolkien, and The Hobbit for the film.\\n\\nExamples"
    },
    "name": "Hobbits",
    "rdf_element": "Hobbits/int_21ff24b7",
    "short_name": "Hobbits",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/Hobbits"
  },
  {
    "categories": [
      "Mentors"
    ],
    "descriptions": {
      "Willow": "Arguably, Fin Raizel from Willow. She's a powerful sorceress who spends much of the movie in the form of a possum (not to mention a raven and a goat).",
      "general": "The Hero is, in the beginning, just a normal boy/girl (or at least relatively normal, anyway). However, this character has a powerful destiny, completely unaware of the role they will play in the grand scheme of things. Someone has to break the news, and turn this Muggle into the hero he/she is meant to be. And that someone is... a talking cat?\\nPart Talking Animal and part enlightened teacher, the mentor mascot plays the dual role of teaching the protagonist about their destiny and powers, while at the same time adding that little bit of comic relief and cuteness (if the show in question is already cutesy, it might start to become sickeningly sweet). Even so, the Mentor Mascot takes its job seriously, and tends to accompany The Hero everywhere just in case the Mooks or the Quirky Miniboss Squad show up.\\nIn a show (or other medium) where the Masquerade is of significant importance (and when is it not?), the Mentor Mascot will simultaneously be the strictest enforcer and the greatest threat to said facade, since talking animals are usually not normal. However, due to cleverness and selective possession of the Idiot Ball, this is generally just for comic effect rather than an actual problem.\\nOftentimes, the mentor is an Old Master who was cursed into a helpless form, serving as a very good justification for why he is shepherding the Ragtag Bunch of Misfits instead of using his great knowledge and power to save the world himself.\\nGenerally an anime/manga trope (especially common in Magical Girl anime) but still present in other media. In Magical Girl shows, this critter is usually the one who initially gives the girl her powers, and is known as a companion or a familiar."
    },
    "name": "Mentor Mascot",
    "rdf_element": "MentorMascot/int_21ff24b7",
    "short_name": "MentorMascot",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/MentorMascot"
  },
  {
    "categories": [
      "HeelFaceIndex"
    ],
    "descriptions": {
      "Willow": "Madmartigan, the master swordsman in Willow, qualifies for the \\\"lost himself in dissipation\\\" version of the trope.",
      "general": "Not all Villains are born. Some are made, and none are more tragic than the Fallen Hero. As the name implies, the Fallen Hero used to be a hero before doing a Face-Heel Turn. They may even have been an Ideal Hero or another equally optimistic archetype, up until the moment when they suffered something bad enough for them to lose all faith in good and idealism, be it the loss of a loved one, too many good deeds coming back to bite them hard, betrayal by someone they trusted the most, too much distrust from those who should have been allies, or some other faith-shattering event. It might even be a drawn out process of seduction to The Dark Side or fall from grace."
    },
    "name": "Fallen Hero",
    "rdf_element": "FallenHero/int_21ff24b7",
    "short_name": "FallenHero",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/FallenHero"
  },
  {
    "categories": [
      "DeathTropes"
    ],
    "descriptions": {
      "Willow": "In Willow, General Kael. Madmartigan smashes his skull-mask, and Kael chases Madmartigan up a flight of stairs. Madmartigan stabs him in the chest; Kael responds by punching Madmartigan in the face and trying to strangle him. Madmartigan slashes Kael's belly, then twists the blade still in his chest. Kael does not appear to notice. Madmartigan impales him on his own sword. Kael is still on his feet when Madmartigan finally shoves him off the walkway. Even then he is still moving so Madmartigan throws a dagger into him just for good measure.",
      "general": "In Which multiple things happen to a character, any of which ought to be fatal. Eventually, one of them is.\\nThere can be several reasons for this:\\n The character is just that tough. It's the Only Way to Be Sure.\\n The character is backed by The Powers That Be or some other supernatural thing.\\n The first fatal thing that happens is relatively slow-acting, and knowledge of it leads them to do something drastic.\\n Someone really hates them.\\n It's funny.\\nIf someone is supernaturally relentless, unstoppable, or Made of Iron, then this is the most reliable way to kill them. Related to a Self-Destructive Charge and to There Is No Kill Like Overkill (in this case, there is no kill except overkill). Might be done because someone wants to Make Sure He's Dead. Sometimes the person actually does want to die, but screw it up, so it becomes a Bungled Suicide. Related to (though not to be confused with) Why Won't You Die?.\\nIn video games, this is often a Recurring Boss.\\nThe trope takes its name from a myth spread by Prince Felix Yusupov about the assassination of Grigori Rasputin in 1916 (which many scholars had analyzed and found semi-plausible explanations for how Rasputin could have survived the abuse he was allegedly put through). Ironically, Rasputin's Real Life death wasn't at all Rasputinian; the 1916 autopsy report (as discovered after the Cold War and reviewed by American and Russian doctors in 2002) shows that Rasputin was shot twice in the back, with a final bullet to the head with a .455 Webley which killed him instantly. However, his killers wanted to portray him as a near-indestructible son of Satan, so they made up an elaborate story about how he survived poison, beating, and bullet wounds only to drown in the Neva. Later embellishments by Yusupov (he thought up a new one every time he was short on money) even had Rasputin dying of hypothermia, having attempted to claw through the ice that covered him, and to top it off, when they cremated him, his body was trying to get up again as it burned.note\\u00A0It should be noted that the use of a .455 Webley pistol suggests it may have been a British intelligence agent, so even the real version is pretty cool.\\nEven with the legend having been debunked, it remains much more popular than the truth because the true story of Rasputin's death is boring, whereas the fake story is much cooler. His death is also disputed, as without Rasputin, who would be Alan Moore? Finally, the myth of Rasputin's death fulfills all five of the possible reasons listed above.\\nThis is a Death Trope, so EXPECT SPOILERS!"
    },
    "name": "Rasputinian Death",
    "rdf_element": "RasputinianDeath/int_21ff24b7",
    "short_name": "RasputinianDeath",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/RasputinianDeath"
  },
  {
    "categories": [
      "NarrativeDevices"
    ],
    "descriptions": {
      "Willow": "Elora Danan in Willow: born with a birthmark that destined her to bring about Bavmorda's downfall. Her mother sends her away with a benevolent nursemaid and is then is killed by Bavmorda's enforcers. Willow finds her floating down a river, having been sent away to safety by the nursemaid moments before she's tracked down and murdered.",
      "general": "An infant is saved from some calamity by being cast into the hands of Fate by his parents, whose lives are sometimes claimed by the same calamity. Fate promptly deposits the young hero with a family (usually poor and humble) who will raise him up to be good, just, noble and strong. He remains ignorant of his true heritage, except perhaps for some trinket \\u2014 a ring or maybe a pendant, or sometimes even a distinctive birthmark \\u2014 which can identify him to someone who knew his parents.\\nSometimes the infant is abandoned in the wilderness by the villain, who doesn't want to murder the child directly, and instead wants it to die from exposure. This never works out as planned.\\nOften the hero is an aristocrat or even a prince(ss), whose nurture by a humble family gives him a refreshingly egalitarian view on things when he finally discovers his heritage and takes his rightful position. A vital stage in the Genocide Backfire plot.\\nAlso known as a Foundling Tale. Contrast with Cinderella Circumstances, Changeling Tale (which is the inverse of this trope).\\nSee also Changeling Fantasy. Compare Doorstop Baby, Switched at Birth, Separated at Birth, Muggle Foster Parents, Wonder Child, Wild Child, Noble Fugitive. See also Parental Abandonment, Fling a Light into the Future, and The Ark which is another ancient motif. Results from a Nice Job Breaking It, Herod!."
    },
    "name": "Moses in the Bullrushes",
    "rdf_element": "MosesInTheBullrushes/int_21ff24b7",
    "short_name": "MosesInTheBullrushes",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/MosesInTheBullrushes"
  },
  {
    "categories": [
      "DisguiseTropes"
    ],
    "descriptions": {
      "Willow": "Madmartigan's lady disguise ends up serving as this in Willow when the villains are searching the town he's in. It doesn't fool them for long, though...",
      "general": "See that harmless little lady over there? She's actually a man \\u2014 a masculine, adventurous man who uses the dress to appear harmless and hide in plain sight.\\nMen are active, women are passive. That's the way things are, at least according to traditional gender roles.\\nThus, if a man wants to become invisible and appear nonthreatening, it can be beneficial for him to pretend to be a woman. In sharp contrast to most forms of regular cross-dressing, this is done as a way of avoiding attention.\\nContrast Sweet Polly Oliver, which is something of the inverse of this trope, since those women dress as men in order to openly embrace the male gender role of being active and potentially dangerous.\\nMany of the examples specifically have a male character disguising himself as an old woman, which is somewhat less reliant on sexist perceptions since senior citizens are (stereo)typically weak and frail (and it's also somewhat more believable that a man could look like an older woman than a younger one).\\nSubtrope of Disguised in Drag. May overlap with Wig, Dress, Accent.\\n\\nExamples"
    },
    "name": "Harmless Lady Disguise",
    "rdf_element": "HarmlessLadyDisguise/int_21ff24b7",
    "short_name": "HarmlessLadyDisguise",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/HarmlessLadyDisguise"
  },
  {
    "categories": [
      "RedFishBlueFish"
    ],
    "descriptions": {
      "Willow": "Willow takes it both ways. Mad Mardigan prefers a sword over all else but is willing and more than able to use a crossbow, and Sorcia's primary weapon is a bow and arrows but she carries a rapier that she is rather skilled with.",
      "general": "The tendency to make the one female character a ranged fighter while her male partner/teammate fights up close. In fantasy settings, she's the archer or a Squishy Wizard, and the burliest male character has a giant melee weapon. In comic books, especially Marvel Comics in the '60s and '70s, female characters were often given powers that were ranged or unconventional enough to let them stay back while their male teammates did the heavy hitting.\\nPart of this is due to cultural taboos against showing women getting hit. It may also have to do with the fact that a skimpy costume looks more plausible on someone who isn't in melee. While Action Girls have long since become commonplace these days, heroines are still more likely to have ranged powers than the guys.\\nTogether, a Melee Man and a Missile Maid may form a Battle Couple. The classic pairing of a caster and a basher is Sword and Sorcerer. Occasionally mutates into the Two Guys and a Girl form of Fighter, Mage, Thief."
    },
    "name": "Guys Smash, Girls Shoot",
    "rdf_element": "GuysSmashGirlsShoot/int_21ff24b7",
    "short_name": "GuysSmashGirlsShoot",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/GuysSmashGirlsShoot"
  },
  {
    "categories": [
      "TitleTropes"
    ],
    "descriptions": {
      "Willow": "Willow",
      "general": "The Character Title is one of the easiest ways to name a work of fiction. Just take the name of a character and use it for the name of the series. The eponymous character is usually, but not always, the protagonist. A possible downfall of this trope is that if the show is a live-action, should the actor playing the title character decides to quit, it could spell the end of the show.\\nCompare Job Title, which is where the work is named after a character's occupation; and The Place, in which it is named after a location. It may change over time due to Spotlight-Stealing Title. Contrast I Am Not Shazam, where people assume the series' name is the character's name. See the Protagonist Title Fallacy for the false assumption that only protagonists' names are used in Character Titles. In literary circles this is called an eponym, a term also used to refer to The Namesake. Also note that you won't see Cowboy Bebop at His Computer.\\nOccasionally overlaps with Biopic, The Namesake and Versus Title.\\nSuper Trope to:\\n\\n Adjective Noun Fred\\n Antagonist Title\\n Character Name and the Noun Phrase\\n Epunymous Title\\n Family Title\\n The Full Name Adventures\\n I, Noun\\n Mononymous Biopic Title\\n Multi-Character Title\\n Name and Name\\n Protagonist and Friends\\n Protagonist Title\\n Role Called\\n Secondary Character Title\\n Self-Titled Album\\n The Talk Show with Host Name\\n Team Title"
    },
    "name": "Character Title",
    "rdf_element": "CharacterTitle/int_21ff24b7",
    "short_name": "CharacterTitle",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/CharacterTitle"
  },
  {
    "categories": [
      "TropesInShiningArmor"
    ],
    "descriptions": {
      "Willow": "Also in Willow",
      "general": "The use of a shield, or something in a similar shape and/or size, as a board or sled to traverse through a particular environment.\\nBeing carried on a shield is a different trope entirely.\\nCompare Body Sled."
    },
    "name": "Shield Surf",
    "rdf_element": "ShieldSurf/int_21ff24b7",
    "short_name": "ShieldSurf",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ShieldSurf"
  },
  {
    "categories": [
      "ActionAdventureTropes"
    ],
    "descriptions": {
      "Willow": "Willow has the hell dogs, which Bavmorda sends to track down the escaping nursemaid in the opening sequence. The nursemaid barely makes it to the water in time to drop the baby on a raft before the hell dogs are upon her.",
      "general": "Dogs have been brought out to track some quarry and have been sniffing about. One starts to bay, and the others join it, and they all chase off.\\nBecause They Have the Scent. And someone will say so. In these words, or others. It's sometimes \\\"They've picked up the scent.\\\" or \\\"They've picked up the trail.\\\" The second may also be used when the Scarily Competent Tracker is clearly following.\\nIf the dogs are hunting people, they are loud enough to be heard by the pursued, who may be the ones who say this. It indicates that The Chase is about to begin in earnest, and that evasion will not be feasible or require throwing the dogs off. Generally a grim point. And the pursuee will almost always go to water or roll in something disgusting to throw the animals off the scent. (This always works on television. Contrary to what most people expect, it does not work in real life.)\\nHunters of either animals or men may also use the Stock Phrase.\\nThis is also used in superhero comics wherein you have a hero with animal powers, or with aliens/fantasy races with strong senses of smell. May be visually represented with Fluorescent Footprints or a glowing \\\"cloud\\\" of scent.\\n\\nExamples"
    },
    "name": "They Have the Scent",
    "rdf_element": "TheyHaveTheScent/int_21ff24b7",
    "short_name": "TheyHaveTheScent",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TheyHaveTheScent"
  },
  {
    "categories": [
      "StockPhrases"
    ],
    "descriptions": {
      "Willow": "In Willow, from Madmartigan: \\\"There's a... a peck here with an acorn pointed at me!\\\"",
      "general": "\\\"He's got a weapon!\\\" is the cry of panic made when someone who had appeared to be or make an empty threat shows, intentionally or otherwise, that he can back his threats up. He's not harmless; he has a weapon.\\nThis cry is also used if someone has something that only looks like a weapon. Expect such people to become the targets of preemptive strikes before the mistake is noticed. People who truly have weapons don't get this treatment: they either dominate, or there will be a true Fight Scene.\\nThe exact cry tends to include the name of the weapon. \\\"He's got a gun!\\\" \\\"He's got a bomb!\\\"\\nCompare I've Got an X and I'm Not Afraid to Use It. May have shades of Captain Obvious; however, in Real Life situations, it's safer for everyone in earshot for it to be announced as a warning.\\nMay turn into Shoot Him, He Has a Wallet! if he didn't have a weapon after all."
    },
    "name": "He's Got a Weapon!",
    "rdf_element": "HesGotAWeapon/int_21ff24b7",
    "short_name": "HesGotAWeapon",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/HesGotAWeapon"
  },
  {
    "categories": [
      "FateAndProphecyTropes"
    ],
    "descriptions": {
      "Willow": "In Willow, Elora Danan is prophesied to bring about Bavmorda's end. However her defeat actually comes by the hands of those protecting the infant princess; Elora Danan is the catalyst who brings about Bavmorda's end, not herself the agent of it.",
      "general": "Prophecies are funny things. They always come true (except when they don't), but they almost never mean what you thought they did.\\nIt's even worse when you think you have them figured out.\\nHalf the time they work much like a Literal Genie. A prophecy may seem to predict the death of a character, or of a set of characters, or The End of the World as We Know It, but then it turns out that there's some other reason for such-and-such to occur. (Like if a character \\\"isn't coming back\\\" from some sojourn to, say, The Future, they may survive, but then stay in the future.)\\nThe other half are impossibly cryptic, often using incredibly flowery metaphors. \\\"The sun will rise on Christmas Day\\\" has an obvious literal interpretation, but the sun in question might actually be the Aztec god Huitzilopochtli, an H-bomb, or the British tabloid. It might, through standard symbolism, mean gold, or something golden, love in general or a particular pair of lovers. It could refer to Japan, Uruguay or the Jesuits, all of whom use a sun in their flag. It could be a person whose name means 'sun', such as Elanor, Eloise, Sol, Sorin... It could be any of a thousand things. And if it's spoken rather than written that opens up situations where the prophecy refers to a \\\"son\\\" rather than \\\"the sun.\\\"\\n\\\"Rise\\\" has multiple meanings too, and there are several possible dates for Christmas. If the prophecy is said to be a translation, there's additional room for obscurity. Perhaps rise should be raise - the same word in some languages. Perhaps the real meaning involves trilingual puns, or Hittite idioms. The technical term for the little \\\"twist\\\" in such a prophecy (or any riddle, contract, etc) is \\\"quibble\\\" (although it's most commonly used for when the twist turns on legalistic nitpicking).\\nAmbiguous Syntax can be another technique: in \\\"The duke yet lives who the king shall betray,\\\" will the king betray the duke, or the duke the king? And since most prohecies are spoken, there is always the possibility that it was simply misheard. Remember, when it comes to prophecy, homonyms are definitely not your friends. If the prophecy is old enough to have been recorded in a dead language, the original wording may also be forgotten, replaced by a less-clear translation \\u2014 or in the worst-case scenario, multiple translations, at least two of which directly contradict each other.\\nIn any case, the prophecies generally rely on a heaping dose of Double Meanings to give them their ambiguous nature.\\nSometimes, of course, the most literal meaning is correct. Such an instance can still be a meta-Twist if the witnesses to the prophecy's proclamation suspect a twist.\\nDeciding what the prophecy actually meant, and whether it's literal or deeply cryptic, is then impossible until after it has happened, which is part of the mechanism of many Self Fulfilling Prophecies. It's because no one understood the real meaning that the attempts to avert it made it come true.\\nThis is Older Than Feudalism; the \\\"cryptic\\\" prophecy was a staple of ancient Greek Mythology.\\nSee also No Man of Woman Born, False Reassurance. For when the \\\"real meaning\\\" relies on an extremely dubious interpretation (beyond what a reasonable person would consider valid) of the original prophecy, see Metaphorically True.\\nSince the mere fact that there is a twist to a prophecy is often a spoiler, feel free to turn back at this point."
    },
    "name": "Prophecy Twist",
    "rdf_element": "ProphecyTwist/int_21ff24b7",
    "short_name": "ProphecyTwist",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ProphecyTwist"
  },
  {
    "categories": [
      "ShowBusiness"
    ],
    "descriptions": {
      "Willow": "Willow",
      "general": "The air that every Geek breathes, a Cult Classic is a film or other work which has a devoted, even if sometimes small, fanbase. Some Cult Classics are obscure commercial failures at the time of their premiere which have since then successfully attracted a fanbase, even to the extent of becoming moneyspinners. Although this is the common public perception to a Cult Classic, some Cult movies were in fact box-office successes at the time but maintained a cult following long after public interest has moved onto the next flavour of the month. It's probably for this reason that some films with a strong cult following (eg The Blues Brothers) are sometimes wrongly assumed to have been unsuccessful at their time of release.\\nCult classics have an unusual shelf life, and seemingly avert the Popularity Polynomial completely. Rather than receiving a short but large burst of popularity before ultimately fading completely into obscurity, cult classics receive a marginal amount of attention almost indefinitely. It's a good bet that a show or movie considered a cult classic 30 years ago will still be such today.\\nThough some movie studios have intentionally tried to position releases as Cult-Classics-To-Be (like MirrorMask and Snakes on a Plane), perhaps hiring a bunch of cult actors and funky music, it is not usually successful. A true Cult Classic is as rare as capturing lightning in a bottle.\\nNote that not all cult classics are actually good. Although many of them are, or at least, are remembered as such. In fact, many cult classics are hilariously bad \\u2014 which is why their fans adore them. These are sometimes called \\\"Camp Classics\\\".\\nSee also Critical Dissonance when the critics hate it, and Critic Proof when...the critics hate it, also. If it's a critical darling on the art-house circuit, but has no following beyond that, that's the other kind of Critical Dissonance. Contrast Quality By Popular Vote, which is the inverse trope. Compare Stoner Flick and/or B-Movienote\\u00A0Not all B Movies have a cult following; see page quote. Stoner Flicks are usually considered cult, however.\\nOften the term \\\"cult\\\" is (perhaps) inaccurately applied to anything that is both old and has a devoted fan following, even if it was popular at the time. If the devoted fan following is rooted in it being both old and critically-acclaimed, and thus popular with fans of classic works in general (e.g. The Marx Brothers), it probably doesn't count.\\nAlso note that \\\"cult classic\\\" is an affectionate English expression for a work of this type, and does not mean that it's a \\\"classic\\\" in the same sense of, say, a \\\"classic novel\\\" or \\\"essential work\\\". Unless the fandom are surrounded by a sea of indifference, such usage is too broad to be meaningful, so works such as Star Wars don't count. Otherwise, the phrase would be meaningless, as Roger Ebert has noted in lamenting its misuse, since it does carry certain genre-specific connotations.\\nThe word \\\"classic\\\" may also be seen as an intensifier of sorts, implying works that have become seen as cult over the years, similar to a Sleeper Hit \\u2014 due to factors such as Audience Participation, Notable Quotables, or other engrossing aspects that attract a select audience who proselytize fervently and disdain non-believers.\\nOne good measurement to use when in doubt, is critical consensus. If a work is commonly described by critics as quirky, fringe, bizarre or off-putting to newcomers, and therefore \\\"cult\\\", then that meets the definition of the trope. If this is actually used as a selling point, then that is a good sign. An even better sign is if critics debate whether or not it's still cult.\\nOn The Other Wiki, \\\"something of a cult classic\\\" (exact words, always; see for yourself) is a well-worn Justifying Edit.\\nNote that most of these cult classics have their own pages already. Yes, we are collectively that geeky.\\nWhen a cult classic actually does become popular, expect geeks to complain It's Popular, Now It Sucks.\\nA standard guide in the cult film genre is Danny Peary Cult Movies List.\\nWhen listing works by the same author, please don't list, say, the entire filmography of a director with a cult reputation. A cult classic should have a small but devout following in the absence of widespread current popular acclaim, in addition to the work itself meeting the definition of the trope. Only list those works by a given author for which the label is justified.\\n\\nExamples"
    },
    "name": "Cult Classic",
    "rdf_element": "CultClassic/int_21ff24b7",
    "short_name": "CultClassic",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/CultClassic"
  },
  {
    "categories": [
      "PersonalAppearanceTropes"
    ],
    "descriptions": {
      "Willow": "Willow - The movie introduction details this trope, exactly, right off the bat.",
      "general": "Vanquishing evil is actually pretty easy: just grab a Chosen One, give them a sword (or just a herring \\u2014 Chosen Ones are a very resourceful lot), point them in the right direction and just wait until the evil empire falls. In fact, the only challenge in this puzzle is figuring out just who and where the Chosen One is in the first place. You don't want to end up with a Fake Ultimate Hero, after all.\\nWell, worry no more!\\nFor your convenience, the gods were nice enough to physically label your Chosen One in some way. Typically, this comes in the form of an unusually shaped birthmark or strange hair/eye color. For bonus points, there will often be a vague allusion to this mark or phenotype that will only make sense once the Chosen One actually appears.\\nA subtrope of Distinguishing Mark. Overlaps with Claimed by the Supernatural when the Chosen One is literally chosen by something.\\n\\nExamples"
    },
    "name": "Birthmark of Destiny",
    "rdf_element": "BirthmarkOfDestiny/int_21ff24b7",
    "short_name": "BirthmarkOfDestiny",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/BirthmarkOfDestiny"
  },
  {
    "categories": [
      "StockPhrases"
    ],
    "descriptions": {
      "Willow": "Willow: \\\"Rool, you fool, get out of the road!\\\"",
      "general": "The word \\\"fool\\\". Try it out. When someone disappoints you or does something stupid, throw the word out. C'mon, give it some gusto. You fool! You...(deep breath, now) FOOL! Got the hang of it yet? No? It just sounds silly in real life? Well, get used to it, because fiction? Fiction loves this word. It's the ultimate insult. Every villain uses it, every hero with a hasty friend uses it... hell, if we were to list every example we could find, that would take up too much webspace. It's so common. Only really prominent examples should be listed.\\nInterestingly, we may have the Hays Office's old Production Code to thank for this. In the olden days, most mainstream works couldn't use profanity. How to show that your villain is one bad dude when his language is carefully scrubbed with bleach? Well, according to The Bible, whoever says \\\"You fool!\\\" is liable to fiery Gehenna. (Matthew 5:22) Thus, having your villain call his rival a fool allowed the audience to know that this guy was bad news without resorting to using any verboten words.\\nThis also serves to elevate the villain above their underlings (and often the hero as well), since most \\\"Fool!\\\" users tend to be characters of a higher social class/state of being. In other words, the villain is simply above the use of such vulgar colloquial terms as \\\"idiot\\\", \\\"moron\\\", or \\\"stupid dumb***\\\"."
    },
    "name": "You Fool!",
    "rdf_element": "YouFool/int_21ff24b7",
    "short_name": "YouFool",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/YouFool"
  },
  {
    "categories": [
      "SoundFXTropes"
    ],
    "descriptions": {
      "Willow": "Also used twice in Willow once when a chariot with two evil mooks overturns, and later during the final battle when an enemy soldier falls off their horse. It's another George Lucas movie, so go figure.",
      "general": "Overused Stock Sound Effects can screw with a TV viewer's attention span \\u2014 repeated use makes them instantly recognizable to those in the know. One of the worst offenders is the Stock Scream \\u2014 one of several vocal effects used when a character has to scream and the sound the actor recorded isn't loud or piercing enough. From the popularity of some stock \\\"scream\\\" effects, you would think they were the only ones in existence. Currently there are about 15 commonly used stock screams, most of which have yet to be named.\\nLooking for an Instant Wilhelm Scream? Look no further."
    },
    "name": "Stock Scream",
    "rdf_element": "StockScream/int_21ff24b7",
    "short_name": "StockScream",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/StockScream"
  },
  {
    "categories": [
      "DisguiseTropes"
    ],
    "descriptions": {
      "Willow": "In Willow, Madmartigan disguises himself as a woman in an attempt to hide from a woman's jealous husband. It backfires when said husband finds him attractive and proceeds to proposition him. Right in front of his wife.",
      "general": "Any scenario where a man dresses as a woman for purposes of disguise. In many cases, this results in Incredibly Conspicuous Drag, the man with his square jaw and broad shoulders looking like an Amazon at best and a Drag Queen at worst... but it's still good enough to fool others most of the time. He may look genuinely attractive as a woman, but Attractive Bent-Gender is likely to come into play in either case.\\nFrequently, but not invariably, Played for Laughs. May result in An Aesop about walking a mile in women's shoes.\\nSubtrope of Crossdresser. If the character wears female disguises more often than seems strictly necessary and/or seems to like it to some degree, then he also qualifies as a Wholesome Crossdresser or Creepy Crossdresser depending on just what fashion he or she likes it.\\nSweet Polly Oliver is the Distaff Counterpart of this trope, but is more likely to be Played for Drama.\\nHarmless Lady Disguise is a subtrope."
    },
    "name": "Disguised in Drag",
    "rdf_element": "DisguisedInDrag/int_21ff24b7",
    "short_name": "DisguisedInDrag",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/DisguisedInDrag"
  },
  {
    "categories": [
      "CharactersAsDevice"
    ],
    "descriptions": {
      "Willow": "Willow: Elora Danaan is destined to overthrow evil queen Bavmorda, the irony being it's her protectors who defeat Bavmorda because she was trying to kill the baby in the first place.",
      "general": "The existence of the town, the human race, the universe, etc. comes down to the continued survival of one individual. For most of their lives, this person may not have been all that important in the grander scheme of things, but in this case at least, they are ultimately tied into the fate and destiny of their world. (Or at least enough people believe so to make a plot out of it, even if it later turns out that the character didn't really need to be protected.)\\nThe goal, therefore, is to protect this person no matter what the cost. If they die, are gotten hold of by the wrong person, or are even just in the wrong place at the right time, then bad stuff will result.\\nBasically, this is what happens when the MacGuffin Girl meets the Butterfly of Doom, without necessarily having the fantastic, world-shaping elements that those plots usually require. The reason the character is important may be relatively mundane, emotional, and/or circumstantial in nature. They need not be a self-contained weapon, a Cosmic Keystone, an artefact disguised as a living being, The Chosen One, Messianic Archetype, or a Barrier Maiden; they may not even have any special abilities to speak of (though that depends on the genre of the story). In some cases, they may have a strong emotional connection and relevance to the cast, so their death or even injury would result in the cast going off the rails somehow.\\nThe other characters may not even know exactly why they're protecting this person. They may just have to be in a certain place in a certain time, or they may just have enough influence on others or on their surroundings that eliminating them would cause the situation to become incredibly tedious at best, and apocalyptic at worst.\\nCompare with MacGuffin Girl, Barrier Maiden and Apocalypse Maiden. When the hero's relationship with the person in question is the one that decides the world's fate, you get Sekaikei Genre. Sometimes subject to Prophecy Twist, in which case compare No Man of Woman Born."
    },
    "name": "Save This Person, Save the World",
    "rdf_element": "SaveThisPersonSaveTheWorld/int_21ff24b7",
    "short_name": "SaveThisPersonSaveTheWorld",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SaveThisPersonSaveTheWorld"
  },
  {
    "categories": [
      "ConMan"
    ],
    "descriptions": {
      "Willow": "The High Aldwyn from Willow zig-zags the trope. He is quite capable of real magic, but seems to find it easier to get the results he wants through cold-reading and mind-games. Also, he is a competent leader and unambiguously good, in spite of being the most manipulative character in the film, including the Big Bad.",
      "general": "The grift-speak name for a person that runs a psychic game is 'Reader'. And it ain't about Tarot cards.\\nThey are the profilers of the grift world. A reader learns more about where a mark's buttons are with a single side-long glance than most people will ever figure out about him. Certainly more than the mark does, anyway.\\nPhony psychics have a specialized set of tools available for exploring those buttons; Tarot cards, Ouija boards, convincing trance-states, cold-reads, and so forth. These are used to refine the reader's understanding of how best to operate the buttons. Once they are clearly understood, the mark is moved into one of a number of specialized tales."
    },
    "name": "Phony Psychic",
    "rdf_element": "PhonyPsychic/int_21ff24b7",
    "short_name": "PhonyPsychic",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/PhonyPsychic"
  },
  {
    "categories": [
      "TheBeautifulTropes"
    ],
    "descriptions": {
      "Willow": "In Willow, even the infant queen Elora Danaan had one.",
      "general": "Beauty marks are facial moles. They are called that because, over the course of history, they have at times been considered an attractive feature. Generally, to be considered attractive, a mole has to be small, not protrude from the person's face, and definitely not have any hairs growing from it. They will usually be either above the lip or below the eye. Fake beauty marks have sometimes been fashionable, especially in the 18th century. Most fake moles were made of silk or velvet, and were sometimes cut into shapes like stars or hearts.\\nThis trope is about how facial moles have been handled in fiction, whether they were true Beauty Marks or just plain disgusting moles. There have been dozens of stories resolved because of the discovery of \\\"the family birthmark\\\". A common gag in comedies featuring a character with a mole is having it explicitly revealed to be fake, or else have the mole spontaneously move around the character's face between close-ups. Occasionally, the Chosen One has this. And occasionally, just occasionally, the presence of a mole means a skin cancer plot is approaching.\\nIn anime, a tragic character will sometimes have a mole near the outside corner of one eye, because in Japan such a mark symbolizes a hard, sad life\\u2014the placement calls to mind a tear of sorrow."
    },
    "name": "Beauty Mark",
    "rdf_element": "BeautyMark/int_21ff24b7",
    "short_name": "BeautyMark",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/BeautyMark"
  },
  {
    "categories": [
      "JustForPun"
    ],
    "descriptions": {
      "Willow": "Willow has Burglekutt, the prefect of Willow's village whose Establishing Character Moment involves his making it quite clear that he wants the hero's farmland. A minor Running Gag involves his head and/or face getting shit on by passing birds.",
      "general": "A character whose intended role in the story (the role the authors made for him/her) is to be so despicable that the audience wants him or her to fail just as much as they want the heroes to succeed.\\nIn many cases, this individual is not simply the villain of the story. Let's say we have a cast of perfectly likable protagonists, reasonable and sympathetic villains, and Bob. Bob is not the main antagonist, and is sometimes not a villain at all. He is not causing the struggle that the heroes must overcome, but he is making the heroes' lives more difficult. His list of character traits includes selfishness, stubbornness, greed, holier-than-thou contempt, cowardice, and an inexhaustible penchant for making bad decisions. He may also be rude and obnoxious, bigoted, sleazy and undeservedly smug. Basically, Bob exists to be hated. Everything he does and everything he says is designed to make the audience yearn for his death just a little bit more. If we see his eventual downfall \\u2014 and we usually do \\u2014 it is just as satisfying as the writers can possibly make it. A particularly pointed Karmic Death is always a nice touch.\\nAn especially common flavor of this character in recent decades is the Politically Incorrect Villain.\\nThe Hate Sink is typically found in stories that do not have a natural target for the audience's scorn. Common environments for this weasel are:"
    },
    "name": "Hate Sink",
    "rdf_element": "HateSink/int_21ff24b7",
    "short_name": "HateSink",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/HateSink"
  },
  {
    "categories": [
      "HeelFaceIndex"
    ],
    "descriptions": {
      "Willow": "Sorsha in Willow betrays her Evil Queen mother and joins the heroes out of love for Madmartigan.",
      "general": "This character begins the story on the side of the villain but ends it on the hero's side. Why? Love.\\nMaybe she and the hero are both stuck on a spaceship at the other end of the galaxy and she discovers his kindness and her newfound feelings for him. Or maybe she finds out that she's been lied to by the villain all her life and has been working for the very people she thought she was fighting against while the hero has been honest with her and is the one she wants to be with. Somehow, she falls for him and decides to defect to his side.\\nThis character will most likely never be truly evil, only misguided or manipulated. Since they are essentially an ordinary citizen of The Empire, they sometimes also serve to humanize their average citizen. While almost Always Female, males can just as easily fulfill the same role.\\nMost of the time, unlike the Mad Scientist's Beautiful Daughter, this character is the primary female lead, quite capable of taking care of herself, and her Character Development is a major part of the story. It's a good thing, too \\u2014 she tends to have a few sources of angst in her past that require a lot of dealing with before she and her man can ride off into the sunset together.\\nIf she doesn't switch sides, it's Dating Catwoman. While a High Heel-Face Turn may be done for a number of reasons, this trope's defining trait is love."
    },
    "name": "Defecting for Love",
    "rdf_element": "DefectingForLove/int_21ff24b7",
    "short_name": "DefectingForLove",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/DefectingForLove"
  },
  {
    "categories": [
      "HeelFaceIndex"
    ],
    "descriptions": {
      "Willow": "In Willow, Sorsha's throwing in with the heroes was as much driven by her mother's contemptuous treatment as by her interest in Madmartigan.\\n Slight subversion in that the evil queen actually treated her daughter fairly well and balked at the idea of Sorsha eventually betraying her, despite the warnings from her fortunetellers.",
      "general": "The Big Bad has a loyal minion who has been feeling... somewhat less than loyal recently. Maybe he met the heroes and liked them. Maybe he discovered more than a few reasons to believe that his master wasn't as nice as he seemed. Maybe he's not sure he approves of the current plot. Maybe he just learned what the plan really was. Whatever the reason, he is pondering a difficult dilemma. Remain loyal, or betray the boss?\\nFortunately, the Big Bad is willing to help him come to a decision. He immediately starts doing everything in his power to make the minion feel hurt and miserable, possibly going as far as saying We Have Reserves, thus perfectly solidifying and justifying the inevitable Heel-Face Turn or Mook-Face Turn.\\nVillains who think It's All About Me are particularly prone to this \\u2014 and particularly prone to being shocked when the minion leaves.\\nEvil Cannot Comprehend Good is often, though not always, an element in their motivations. A particularly Magnetic Hero can usually tip the balance in his favor with a few kind words, or just by showing how he treats his friends. Indeed, when the villain goes for Flaw Exploitation, endangering his minions to force the hero to save them, or just leaving them in danger because he knows the hero will save them, the contrast is generally as vivid as it gets.\\nNot to be confused with Even Mooks Have Loved Ones, where the minion considers betraying the boss for being cruel to their friends or relatives. Contrast Kill Me Now or Forever Stay Your Hand. Watch out for Heel Face Door Slam. Cross your fingers for Redemption Earns Life. Compare Rebellious Rebel, where the original discovery of the villain's treachery motivates his defection. Also see Defecting for Love. When the villain's words and acts draw the character, see Bring Them Around. See also Who's Laughing Now? for when a Butt Monkey minion commits a Face-Heel Turn due to mistreatment from the Good Is Not Nice hero. If the minion in question ends up betraying and finishing off his/her former boss without actually defecting to the other side, it is The Dog Bites Back. Contrast with its polar opposite, Because You Were Nice to Me.\\nSPOILERS for many Heel Face Turns follow.\\n\\nExamples"
    },
    "name": "Mistreatment-Induced Betrayal",
    "rdf_element": "MistreatmentInducedBetrayal/int_21ff24b7",
    "short_name": "MistreatmentInducedBetrayal",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/MistreatmentInducedBetrayal"
  },
  {
    "categories": [
      "EvilTropes"
    ],
    "descriptions": {
      "Willow": "Willow: All of Bavmorda's men wear black armour. General Kael complements his with a scary bone mask.",
      "general": "Black is perhaps the most typical color for evil, or at least the antagonists, to wear. Thus in many stories, the villains will wear largely black clothing most of the time, in contrast to the colors worn by neutral and good characters (which will be at least moderately lighter).\\nThis is because in many cultures, black is the color of darkness, decay, and death. Thus even though wearing black doesn't make someone evil, being evil makes it more than likely one is going to wear black.\\nIt doesn't matter if it's all the villains, the Big Bad and a few others, or just a group of Mooks that appear for a few episodes, if they wear a large amount of black (even just one noticeable part of their clothing), you know it's this trope. This is also why black is a common color for an Evil Costume Switch.\\nHeck, some Eviler Than Thou villains might wear black when the \\\"lesser\\\" evils don't.\\nThere's some science behind this. There are studies that show that people that wear black are more aggressive than people who don't. They've also found that black isn't only associated with evil, but also contamination and sickness. These associations give people an instinctive cue that the person wearing black is dominant, and somebody you don't want to mess with. note\\u00A0Note that these associations may be cultural, as historically other colours, including white, had these connatations instead, and in some cases still have, while black is associated with neutrality and even outright heroism in some cultures.\\nNow since some think Evil Is Cool, then black can also become a cool color, but those don't cover this trope, nor does this trope come into play if the heroes also wear black. This can come into play with a Villain Protagonist though.\\nTrope Relations\\nA Sub-Trope of Good Colors, Evil Colors, Dark Is Evil (since dark is usually shown as black), Dress-Coded for Your Convenience (since this is about clothing color).\\nA Super Trope to Black Knight (as wearing black armor is part of the trope), Black Cloak, Woman in Black.\\nA Sister Trope to Red and Black and Evil All Over (which often involves clothing), Paint It Black (which isn't limited to this color), Black Eyes of Evil.\\nCompare Purple Is the New Black, Evil Costume Switch.\\nContrast Little Black Dress (wearing black is stylish instead of evil), Movie Superheroes Wear Black (because they are still heroes), Dark Is Not Evil, Gold and White Are Divine."
    },
    "name": "Evil Wears Black",
    "rdf_element": "EvilWearsBlack/int_21ff24b7",
    "short_name": "EvilWearsBlack",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/EvilWearsBlack"
  },
  {
    "categories": [
      "ComedyTropes"
    ],
    "descriptions": {
      "Willow": "In one scene in Willow, the protagonist and Madmartigan are arguing, until the latter steps in what looks like dog doo. Cue an Oh Crap! expression from both of them, as they know it's not from a dog, it's from a troll, which means those dangerous monsters are probably around. (And it just goes downhill from there...)",
      "general": "Any comedy featuring animals, especially pets, is required amongst the typical gags to make at least one poop joke, regardless of how lame, or poor, or tasteless, or yes, shitty it might be.\\nThe Trope Namer is a euphemism for horse manure.\\nIf eating said Road Apples is involved, then the trope is I Ate WHAT?\\nOften a subset of Vulgar Humor."
    },
    "name": "Road Apples",
    "rdf_element": "RoadApples/int_21ff24b7",
    "short_name": "RoadApples",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/RoadApples"
  },
  {
    "categories": [
      "HairTropes"
    ],
    "descriptions": {
      "Willow": "In Willow, Willow's wife Kaia lops off her braid and gives it to him as a keepsake near the start of the movie.",
      "general": "When a character cuts off his or her hair, it often symbolizes a rite of passage or bout of character growth. A princess striking out on an adventure, or a new recruit at boot camp, for instance. Hair is something that takes time and effort to grow, so parting with it voluntarily can be a powerful act.\\nThis is particularly a big deal when women get haircuts, since Long Hair Is Feminine. Yet in fiction, even an accidental hair slicing can leave a character with a surprisingly even cut.\\nIn many religions (Western Christianity, Ancient Egyptian religion, and others) priests and/or monks cut/shave their hair. Roman Catholic nuns also tend to cut and mantain their hair short under their veils when they enter the nunneries. The cutting of one's own hair is also a part of Buddhist mythology, specifically something done by Siddhartha himself early on in his path to enlightenment, so anime examples might draw from this as an allusion. There are also some cultures, including Native American and many Asians, where a person would cut his or her hair as an act of grief, disgrace, or even rebellion. In the Confucian tradition, hair (like the rest of your body) is considered a gift from your parents and may not be damaged without a very good reason. Furthermore, prisoners and psychiatric patients commonly have their heads shaved, often to prevent the spread of lice, but sometimes also as a demeaning measure.\\nHaving the head shaved can be a punishment prescribed in law, but also something done as \\\"mob justice,\\\" an infamous example of which was the thousands of European women who had their heads shaved in front of cheering crowds in the wake of World War II, as punishment for associating with occupying Nazis during the war.\\nHowever, an important haircut can also be positive, such as changing one's style after a breakup.\\nThe opposite of a Hair Reboot. If it comes after a Heel-Face Turn may result in switching their Good Hair, Evil Hair around. May also occur after or during a Close-Call Haircut. If it's involuntary, it's likely a Traumatic Haircut. If the hair is changed in order to show a change in characterization, this may also be an Expository Hairstyle Change.\\nSee also Beard of Sorrow, Dye or Die, Expository Hairstyles, and Fanservice Pack."
    },
    "name": "Important Haircut",
    "rdf_element": "ImportantHaircut/int_21ff24b7",
    "short_name": "ImportantHaircut",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ImportantHaircut"
  },
  {
    "categories": [
      "GraphicalTropes"
    ],
    "descriptions": {
      "Willow": "In Willow, occurs as Queen Bavmorda is struck by lightning as a result of her own backfiring magic.",
      "general": "The application of high voltages to animated flesh and bone renders the former translucent and the latter luminescent, allowing the skeleton to be seen in the style of a classic X-ray for as long as the current flows. Stock Femur Bones may be involved.\\nDespite the impressive light show, the victim will usually suffer no ill effects beyond looking a bit singed and shocked. On the other hand, a Disintegrator Ray (which is far more likely to be lethal) can also produce these sparks as it zaps the victim to dust (or leaves only the skeleton behind).\\nThe trope name is a tribute to the \\\"X-Ray Specs\\\" that have been advertised in the back of comic books since time immemorial.\\nWhile this definitely does not happen in Real Life, the source of this trope is probably the fact that a really high voltage is required in order for an X-Ray machine to produce pictures of your bones."
    },
    "name": "X-Ray Sparks",
    "rdf_element": "XRaySparks/int_21ff24b7",
    "short_name": "XRaySparks",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/XRaySparks"
  },
  {
    "categories": [
      "ILikeSwords"
    ],
    "descriptions": {
      "Willow": "Madmartigan in Willow styles himself the world's greatest swordsman and makes a strong claim.",
      "general": "A character noted for his or her mastery of the sword. Might be a deadly duelist, a skillful swordsman, or just someone who is notably better at putting holes in other people. They may or may not posses Implausible Fencing Powers depending on the level of realism within the work. Their weapon of choice might be a Cool Sword, katana, rapier, BFS or something completely mundane. Some might be undefeated and renowned as the best swordsman in the world, while others might be an anonymous badass trying to stay alive.\\nOften a Mentor, often helping other characters Take a Level in Badass. Occasionally an Old Master. May be Badass Normal if there are superhumans to compare to. May well be the Worlds Greatest Warrior."
    },
    "name": "Master Swordsman",
    "rdf_element": "MasterSwordsman/int_21ff24b7",
    "short_name": "MasterSwordsman",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/MasterSwordsman"
  },
  {
    "categories": [
      "Plots"
    ],
    "descriptions": {
      "Willow": "Kicks off the plot of Willow.",
      "general": "It's raining, and a mother is carrying a baby in a basket. The baby is wrapped up in a blanket, but is obviously a main character. The mother may or may not be kept anonymous by a cloak.\\nSo the mother goes up to a doorstep, puts the baby down, may or may not add a letter and/or an Orphan's Plot Trinket, rings the doorbell and slips quietly into the night. The door is opened by the child's adoptive parents, who are always fully accepting of the baby and their new roles as parents instead of contacting the authorities (and it just so happens that someone is always home and awake to answer the door, thus sparing the baby from dying of exposure). Cut to several years later.\\nThis title is a pun on Doorstep Baby, and is not to be confused using a baby as a doorstop. For that, you're looking for Hilariously Abusive Childhood.\\nAlso known as a \\\"foundling\\\". Often causes Changeling Fantasy. See also Parental Abandonment, Missing Mom.\\nLead-in to Moses in the Bullrushes and Muggle Foster Parents.\\n\\nExamples"
    },
    "name": "Doorstop Baby",
    "rdf_element": "DoorstopBaby/int_21ff24b7",
    "short_name": "DoorstopBaby",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/DoorstopBaby"
  },
  {
    "categories": [
      "IndexOfFictionalCreatures"
    ],
    "descriptions": {
      "Willow": "Trolls in Willow are smelly, vicious apelike brutes who hate Nelwyns.",
      "general": "Elves have Pointy Ears and live for a very long time out in the magical forest. Dwarves live underground, dig up jewels, and are short and like to grow long beards. Merpeople live underwater, have sea-creature features, and sing. And Trolls...\\nErr? Well, they're always big, ugly, brutal, and stupid, right? Except when they're small, Ugly Cute and friendly.\\nShould they be giants with scaly green skin that rapidly heal from any injury except fire or acid? Or something that's literally made of rock and gets smarter when it's in the cold? Or are they\\ngrey-skinned aliens that can use computers and wear glasses? Tusked and mohawked practitioners of Hollywood Voodoo? Or perhaps something that guards bridges from errant goats? Or could they simply be beings who entertain themselves at the expense of others?\\nAll right, let's admit it. Trolls are diverse. It's not even a matter of everyone wanting them to be different; there are so many clashing ideas of trolls in mythology itself that it's hard to decide what they are. Pretty much the only standard thing about trolls is that they are ugly- or at least Ugly Cute. So, really, you can't blame modern creators for putting their own spin on trolls. If there is any consistency, it is that the less cute the troll, the meaner the troll, but even that tends to be subverted.\\nQuite a few depictions of Trolls have them as being vulnerable to fire. Some fictional interpretations give them ridiculously fast regenerative powers, such that they can heal themselves even as you're cutting them down making them frighteningly invincible. In these interpretations, fire is the only way to prevent their injuries from healing and thus the only way to defeat them. Others have them harmed or petrified by sunlight.\\nMany of the differences stem from language barriers. When translating a myth from another culture, it was common habit for a previously unknown creature to be stamped as a troll. The names Ogre, Giant, and Troll were also interchangeable for many storytellers, resulting in further confusion.\\nEven within Scandinavian folklore trolls are extremely diverse, and range from magical mischievous goblins to huge dumb giants who roamed the forest and could sniff out a Christian man's blood. Part of this comes from the isolated nature of Scandinavian communities; localized versions of monsters destroying crops and eating your porridge appeared. The word troll in Norse languages, similar to trolleri/trylleri which means magic, is basically a blanket term for any creature that's strange, unusual, poorly understood, seemingly supernatural or vaguely inhuman, similar to the Japanese concept of youkai.\\nHas nothing to do with trolling (which is actually named after a method of bait-fishing), except when it does.\\nSee also Our Orcs Are Different, Our Goblins Are Different, Our Giants Are Bigger, and Our Ogres Are Hungrier. Compare Our Ghouls Are Creepier, another fantasy creature with inconsistent portrayals.\\n\\nExamples"
    },
    "name": "All Trolls Are Different",
    "rdf_element": "AllTrollsAreDifferent/int_21ff24b7",
    "short_name": "AllTrollsAreDifferent",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/AllTrollsAreDifferent"
  },
  {
    "categories": [
      "MagicAndPowers"
    ],
    "descriptions": {
      "Willow": "Willow's attempts to remove a Baleful Polymorph from his teacher and Big Good Fin Raziel (placed by Big Bad Bavmorda) just turn her into a different animal because he's a magical novice. Either he'd lose control of the wand from pain or he'd be distracted. It's only towards the end that he forces himself to keep chanting through the pain long enough to take her through a series of changes until she finally emerges as human.",
      "general": "A character has magical powers. Either because of inexperience, a Malfunction Malady, the magic equivalent of Phlebotinum Breakdown, or some other reason, the spell screws up, often resulting in an unintended effect or Amusing Injuries, or both. In a game, a Magic Misfire can be a subtype of Critical Failure. Derived from D&D's \\\"Magic Missile\\\", it's stock in trade for the Inept Mage. This is a convenient way to make inexperienced characters nevertheless impressive, as their misspeaks can function like a Random Effect Spell and still be potent.\\n\\nExamples"
    },
    "name": "Magic Misfire",
    "rdf_element": "MagicMisfire/int_21ff24b7",
    "short_name": "MagicMisfire",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/MagicMisfire"
  },
  {
    "categories": [
      "SelfDemonstratingArticle"
    ],
    "descriptions": {
      "Willow": "Willow: \\\"NOT A WOMAN!\\\"\\n Arguably, more likely Lug's Berserk button being pressed than proper madness mantra.",
      "general": "Characters who are having a mental breakdown sometimes become fixated on a certain phrase that they repeat until everyone in the world is sick of it.\\nSometimes, this chanting allows the character to snap out of their insanity. Sometimes, it becomes their life-long theme song as they rock back and forth in a cozy padded room. If they aren't locked up, expect a room with every square inch stating the phrase. When combined with As the Good Book Says, the ominousness goes through the roof.\\nJust about every mental institution scene has someone chanting some sort of non sequitur in the background. And woe betide us all if this non sequitur should be significant.\\nMay result in the terms becoming meaningless and possibly descend into a strange form of Mondegreen thanks to the human knack of picking up patterns out of nothing.\\nContrast the Talkative Loon, who at least varies the chatter. Compare to Cluster F-Bomb and Rapid-Fire \\\"No!\\\".\\nA Survival Mantra is an attempt to master fear and pain, but when it doesn't work, you find the point where that trope crosses over into this one.\\nMust trope. Must trope. Must trope. Must trope. Must trope. Must trope."
    },
    "name": "Madness Mantra",
    "rdf_element": "MadnessMantra/int_21ff24b7",
    "short_name": "MadnessMantra",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/MadnessMantra"
  },
  {
    "categories": [
      "FightScene"
    ],
    "descriptions": {
      "Willow": "Willow, beginning of the escape from the inn. \\\"Gentlemen? Meet Llug.\\\"",
      "general": "A common trick when fighting a Giant Mook, but often seen elsewhere is to find a way to use their power against them. The simplest way to do this is using your own cunning and speed.\\nDeadly Dodging is a short term in-combat form of Batman Gambit. Arrange things so that the enemy attempts to hit you, but move at the last minute, causing them to hit whatever you conveniently arranged to be behind you."
    },
    "name": "Deadly Dodging",
    "rdf_element": "DeadlyDodging/int_21ff24b7",
    "short_name": "DeadlyDodging",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/DeadlyDodging"
  },
  {
    "categories": [],
    "descriptions": {
      "Willow": "In Willow, the High Aldwin tests his potential apprentices by holding up his hand and asking them to choose which finger contains the power to control the world. Each hopeful, including Willow, chooses one of the High Aldwin's extended fingers; all of them choose incorrectly, and the test ends with no new apprentice selected. Later, before leaving on the expedition to deliver baby Elora Danan to the crossroads, Willow admits that his initial impulse was to choose his own finger, which the High Aldwin tells him was the correct answer.",
      "general": "One or more heroes are put through a False Crucible, without any warning they're being tested. This is particularly popular with trickster mentors.\\nCompare Hidden Purpose Test (where the hero knows he's being tested but not what he's being tested on), Unwinnable Training Simulation (where the hero doesn't know there's no way to beat it), and Danger Room Cold Open (where the audience doesn't know the hero's being tested).\\nSecret Test of Character is the common special case where the character may think they're being tested about one thing, but what's actually being tested is the strength of the hero's moral conviction. Other common cases include secret tests of skill, intelligence, supernatural powers and true love.\\nWhen the hero initially knew (s)he was being tested, but is falsely told the test has ended, it's a Training Accident (military) or The Game Never Stopped (civilian). Either way, the hero ends up thinking (s)he's facing a real situation, with no idea it's still just a test.\\n\\nExamples"
    },
    "name": "Secret Test",
    "rdf_element": "SecretTest/int_21ff24b7",
    "short_name": "SecretTest",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SecretTest"
  },
  {
    "categories": [
      "SpeculativeFictionTropes"
    ],
    "descriptions": {
      "Willow": "The brownies from Willow.",
      "general": "Little People\\u2014 really little people. Lilliputians are humanoid characters whose main characteristic is that they are very, very small. Like, up to your knee small. Size of your thumb small. Size of an ant small.\\nThis may be the result of a shrink ray experiment gone wrong, but it's most likely the natural size of these beings, in which case they probably live in a Mouse World. Whatever the case, you can be assured that life for these guys is going to be tough, as every insect is a threat, every step up a staircase is a colossal climb, and nobody ever watches where they're stepping.\\nLilliputian Warriors is a subtrope, for when these guys kick ass despite fitting in the palm of a hand. Keep in mind these aren't The Fair Folk\\u2014fairies already have their own tropes. Regular-sized people who shrink down and then revert to normal size fall under Incredible Shrinking Man; this is for naturally small humanoids. Contrast Our Giants Are Bigger, to whom we are the Lilliputians.\\nNot to be confused with Liverpudlians."
    },
    "name": "Lilliputians",
    "rdf_element": "Lilliputians/int_21ff24b7",
    "short_name": "Lilliputians",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/Lilliputians"
  },
  {
    "categories": [
      "CombatTropes"
    ],
    "descriptions": {
      "Willow": "In Willow the main villain Bavmorda wants to use a ritual whose end is to wipe the victim away from existence.",
      "general": "Many works have the Holy Hand Grenade: a purifying, holy blast of light and goodness which eradicates evil in sight, turning it into a dusty pile of ash.\\nHowever, what happens if it gets reversed?\\nThe Unholy Nuke tends to be a power fit for a Big Bad: a devastating magic/technique/ritual fueled by unholy power, often the Evil Counterpart to a technique used by the good guys. Usually it involves Black Magic and darkness, but other elements can play a role as well. Bonus points if it's Powered by a Forsaken Child. It may be a Dangerous Forbidden Technique. Sometimes an Evil Knockoff will use this as a dark mirror of one of the hero's own powers. In Video Games, expect to see it used by the Final Boss.\\nSee also Light Is Not Good, Casting a Shadow, Person of Mass Destruction. May or not be part of a Yin-Yang Bomb. Contrast Holy Hand Grenade. See also Fantastic Nuke, where the emphasis is on the scale of the damage done regardless of whether the spell is specifically \\\"unholy\\\" or not."
    },
    "name": "Unholy Nuke",
    "rdf_element": "UnholyNuke/int_21ff24b7",
    "short_name": "UnholyNuke",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/UnholyNuke"
  },
  {
    "categories": [
      "SpeculativeFictionTropes"
    ],
    "descriptions": {
      "Willow": "In Willow, the local evil sorceress tries to kill the infant prophesied to be her downfall, inadvertently rallying all her enemies to try and protect the child, ultimately leading to the sorceress's defeat. In addition to that in the end she ends up destroying herself with the very spell she was going to use to destroy the child.",
      "general": "Whenever anyone tries to avert a prophecy, for good or ill, the end result of their actions is to bring the prophecy about. The harder they struggle to prevent it, the more inescapable their destiny becomes. Fate, it seems, loves irony. Strangely, the other side of this, where the prophecy is fulfilled because someone wants to fulfill it, is rarely explored in fiction (Either-Or Prophecies notwithstanding).\\nWhen a hero tries to prevent the prophesied release of an ancient evil, their actions will help it escape because You Can't Fight Fate. When the Big Bad tries to slaughter all the members of a given people in order to kill the one among them who is prophesied to end them, they will only manage to create the hero that they fear, because destiny says so.\\nOne common mechanism for this is a Prophecy Twist. If no one understands the real meaning of the prophecy, any attempts to avert it will naturally be futile. A cynic will point out that by this measure, a prophecy must be vague. Otherwise it would be easy to defeat, or else those it affects must carry an Idiot Ball and not take the direct approach that would have no room for failure.\\nTo be this trope, a member of the cast must be actively trying to prevent it from happening. Then it happens, most often because of the attempt to prevent it. Generally, this happens through one of two courses: either a) the person the prophecy concerns will, in their pre-preemptive efforts to prevent their purported doom, end up creating the very circumstances by which the prophecy is fulfilled; or b) having taken their preventative measures, they will then unwittingly blunder right into the prophecy's hands. More complex prophecies may include both.\\nThe archetypal Older Than Feudalism example is the Greek tragedy Oedipus Rex. A prophecy says the king will be killed by his own son, so the king orders his infant son killed. (He has his feet nailed to a board and left to die of exposure in the wilderness, rather than, say, cutting him in half with a sword.) Oedipus is rescued, and brought up not knowing he's the prince. Twenty years later he learns his fate: he will kill his father and marry his mother. Wanting to protect his adoptive family \\u2014 who he believes are his natural parents \\u2014 Oedipus leaves home. On the road, he meets his biological father (whom he doesn't recognize, naturally), gets into an argument, and kills him. Shortly thereafter he comes to the city his father ruled, and frees them from the Sphinx; as a reward Oedipus is made king of the city and marries the widowed queen...his own mother.\\nMost of the real-world prophecies that come true are also self-fulfilling \\u2014 simply stating that something will happen often ensures that it will happen someday, whether by accident or because someone read your prophecy and decided they'd make it happen.\\nAn example sometimes given is that a prediction that a bank may become insolvent (or, excuse the pun, \\\"bankrupt\\\") may scare people into withdrawing their money from the bank all in a rush \\u2014 but since the bank only keeps a fraction of their deposits actually on hand (the rest is invested out, e.g. bank loans), the run on the bank can drive the bank into insolvency, ironically just as predicted. In simpler terms, fear that a certain commodity (like gasoline) will run short may trigger people to stock up on it, leading to a shortage of that very commodity. Then there's plain old paranoia, which is a good way to make enemies.\\nContrast Self-Defeating Prophecy. Compare Catch-22 Dilemma, Prophetic Fallacy, The Firefly Effect, Streisand Effect, Nice Job Breaking It, Hero (and/or Nice Job Fixing It, Villain, depending on who did it), and Nice Job Breaking It, Herod!. Often an integral part of tragedy. May cause a Clingy MacGuffin. For the Time Travel version, see You Already Changed The Past and Stable Time Loop. See also Situational Irony."
    },
    "name": "Self-Fulfilling Prophecy",
    "rdf_element": "SelfFulfillingProphecy/int_21ff24b7",
    "short_name": "SelfFulfillingProphecy",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SelfFulfillingProphecy"
  },
  {
    "categories": [
      "OlderThanDirt"
    ],
    "descriptions": {
      "Willow": "In Willow, an eagle ridden by a brownie kidnaps the infant princess that Willow is trying to protect.",
      "general": "A very old, but still popular animal stereotype: a Noble Bird Of Prey (usually an eagle, condor or a vulture) picks up a child or a small animal from the ground and carries it off to its nest to be eaten.\\nMostly an Urban Legend, since everything weighing more than 4 pounds is far too heavy to be carried off by these birds, making this a case of Somewhere, an Ornithologist Is Crying. They will prefer Vertical Kidnapping smaller animals. Yet, there have been many cases throughout history where babies or little children were merely attacked by large birds, and some eagles are perfectly capable of killing prey too large to actually carry off.\\nPterosaurs often take on this role in prehistoric settings, in spite of the fact that not only were most of them also too light to carry off even a child, they didn't even have grasping feet!\\nSubtrope of Feathered Fiend."
    },
    "name": "Kidnapping Bird of Prey",
    "rdf_element": "KidnappingBirdOfPrey/int_21ff24b7",
    "short_name": "KidnappingBirdOfPrey",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/KidnappingBirdOfPrey"
  },
  {
    "categories": [
      "HorrorTropes"
    ],
    "descriptions": {
      "Willow": "Willow: Of the Horrifying Metamorphosis variety, when Queen Bavmorda magically transforms an entire army into pigs. It's made explicit that the transformation doesn't affect what the victims are wearing, making a slow, painful process worse with constriction by clothing and medieval armor as they change shape.",
      "general": "Transformation Horror is a subtrope of Body Horror involving graphic and unsettling Transformation Sequences or continuous random mutation.\\nThis can occur in the process of both involuntary and Voluntary Shape Shifting, and the final form, if there is one, doesn't have to be horrific. Even turning a person into a Ridiculously Cute Critter can involve Transformation Horror along the way. What matters is that the process of the transformation is unpleasant to witness, and horrifying just to imagine experiencing."
    },
    "name": "Transformation Horror",
    "rdf_element": "TransformationHorror/int_21ff24b7",
    "short_name": "TransformationHorror",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TransformationHorror"
  },
  {
    "categories": [
      "VideogameSettings"
    ],
    "descriptions": {
      "Willow": "Willow uses some magic to burn a hole through the otherwise impassible wall of brambles.",
      "general": "A classic trope usually seen within the Fantasy genre, the Hedge has both a literal and metaphorical purpose within any story that features it.\\nPhysically, it is a place of painful passage, thorns and brambles, that acts as a hazard for the main character(s) as they try to either pass it, or escape it. More often than not, it is connected to fairies (Fae) or some other mysterious group of creatures, as the trope is linked to the idea of a natural barrier to some greater prize (or terrible horror). Fantasy-wise, the Hedge usually appears within enchanted forests. However, sometimes the Hedge is conjured by a \\\"higher power,\\\" and thus can appear anywhere the summoner demands (though not the golden rule). Also, the thorns tend to quickly eat whatever dies or lets its guard down within it.\\nThe Hedge is most often a home for various forms of life, whether carnivorous or not. Sometimes it's a kingdom in-and-of itself, being ruled by an Overlord, Sorceress, Bandit King or similar character. Outside of the previously stated genre, the Hedge can be a torturously difficult labyrinth made from plants and fungi, or a hideaway for smaller characters against the Big Bad.\\nMetaphorically, however, the Hedge of Thorns can stand for something that tears at the psyche as well as the body of anyone who tries to get through it (fairies often are linked to madness). It also acts as a test of character, since it can stand between the Hero(ine) and the Bright Castle that holds what (s)he seeks. Usually the ordeal of the Hedge, as previously stated, is one of mental endurance and brinking on insanity, since it questions one's principles and bravery, as well as capability to adapt to the harshness of the reality that exists within the Hedge.\\nNote: the Hedge can also be a catch-all term for lands belonging to the Fae, such as the The Lost Woods."
    },
    "name": "The Hedge of Thorns",
    "rdf_element": "TheHedgeOfThorns/int_21ff24b7",
    "short_name": "TheHedgeOfThorns",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TheHedgeOfThorns"
  },
  {
    "categories": [
      "RomanceArc"
    ],
    "descriptions": {
      "Willow": "Madmartigan and Sorsha get two in Willow. The first is in Sorsha's tent while Madmartigan is under the influence of a Love Potion. He kicks the ass of a couple guards, cuts the ropes supporting the tent, and takes a moment to grab Sorsha for a passionate kiss as it collapses around them, all before cutting his way out of it again to escape with Willow and Elora Danan. Later during the fight at Tir Asleen, Madmartigan single-handedly takes down the giant two-headed dragon while Sorsha is watching him throughout the battle, increasingly amazed at his badassery. When the dragon goes down and Madmartigan is thrown to the ground she's standing over him with her sword drawn, and as he backs away from her unarmed (she's still technically his enemy at this point) Sorsha grabs him by the front of his armor, hauls him to his feet and plants an equally epic kiss on him as she completes her Heel-Face Turn.",
      "general": "A kiss which is Serious Business, with all the spectacle that entails. In all probability it's a First Kiss that finally puts an end to Unresolved Sexual Tension and/or other typical obstacles that get in the way of True Love(tm). The scenery will be epic, the camera will go wild, the music will swell. The most straightforward way to telegraph a They Do which isn't an actual wedding.\\nSome tropes, such as Smooch of Victory, Hollywood Kiss, Concert Kiss, Beach Kiss, and Lip-Lock Sun-Block, are almost always examples of this as well. If a kiss is built up to be this but fails miserably, it's probably an Awkward Kiss.\\nHas nothing to do with Big Damn Heroes. Usually."
    },
    "name": "The Big Damn Kiss",
    "rdf_element": "TheBigDamnKiss/int_21ff24b7",
    "short_name": "TheBigDamnKiss",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TheBigDamnKiss"
  },
  {
    "categories": [
      "FairyTaleTropes"
    ],
    "descriptions": {
      "Willow": "Willow\\n Evil empress Bavmorda transforms all of an army into pigs this way. The pig transformation was also used as a temporary status effect in the NES RPG based on the movie.\\n The sorceress Fin Raziel is also subjected to this treatment, though Bavmorda turns her into a possum, not a pig. And then Willow himself transforms her into... a bunch of other animals, with nary a pause in between. She (finally) gets better.",
      "general": "A character gets hit with a spell, Curse, or Transformation Ray, causing an instantaneous and involuntary transformation into a harmless or useless form. This is commonly some sort of animal creature (whether real or fantastic), though it can also be a plant or a lifeless object. This form will render them unable to pursue their goals, until they can revert to their usual form by some means \\u2014 they may or may not lose their voice, or even their mental faculties (in which case someone else will have to seek the cure for them).\\nFrogs, newts, and toads are so common that they have their own subtrope, Bewitched Amphibians. Other common choices include mice, chickens, pigs, and sheep.\\nIn role-playing or video games, this is frequently a Standard Status Effect that will disable or greatly weaken most attacks and magic, but will rarely affect the victim's Hit Points or armor. People may get turned into toads, but \\u2014 hot damn \\u2014 those toads will be Made of Iron! A notable exception is when insects are involved, in which case the victim is not long for this world.\\nThis is common in fiction, as it's a way for a spellcaster to defeat a foe with magic without simply killing them. It's also generally less permanent and more palatable than actual death. Often requires a hero to find the magic \\\"cure\\\" to turn his friend back into a person. This can be also be used to show a specific aspect of the character's personality, such as gluttons turned into pigs, or cowards into chickens.\\nOccasionally in fiction a character may manage to save the day while still under this effect, sometimes through use of the animal form's abilities. This will lead to the Aesop that it's brains, not strength, that's important. Or that courage is more important than size. Or that you can lay an egg and still feel like a man.\\nIf the transformation is presented to disturb and frighten the viewer, it becomes Transformation Horror. It will then probably be a Painful Transformation.\\nWhether or not a Baleful Polymorph is effective against a Voluntary Shapeshifter varies, depending on whether or not it also imposes a Shapeshifter Mode Lock \\u2014 otherwise the shapeshifter can just transform themselves back to normal, or at least something else. Thus, it is a subtrope of curses.\\nDepending on the method, clothing may be transformed as well, or it may not, resulting in Shapeshifting Excludes Clothing if the characters or audience are aware of this fact, or Empty Piles of Clothing if they are not. (In either case, naturally, when they get turned back they're going to need those clothes back...)\\nPolymorphing into a nonliving form is much less likely to be played for laughs and much more likely to be permanent.\\nCan be used as a Karmic Transformation. Characters transformed this way may also exhibit Morphic Resonance. See also Emergency Transformation, Shape Shifter Mashup and Beauty to Beast. Compare Taken for Granite (turning into a statue), Unwilling Roboticisation (turning from flesh into something mechanical). Contrast with Hybrid Overkill Avoidance, where the subject is immune to further polymorphing because they're already supernatural. Compare Involuntary Shapeshifter."
    },
    "name": "Baleful Polymorph",
    "rdf_element": "BalefulPolymorph/int_21ff24b7",
    "short_name": "BalefulPolymorph",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/BalefulPolymorph"
  },
  {
    "categories": [
      "SpeculativeFictionTropes"
    ],
    "descriptions": {
      "Willow": "Willow",
      "general": "The defining High Fantasy storyline. The quest means business.\\nQuests feature The Hero and a bunch of supporting cast members traveling across the world with a firm goal in mind: to recover a McGuffin, collect all the Plot Coupons, Save the Princess, defeat the Big Bad, locate a loved one or all of the above. Quite possibly an Impossible Task, to get rid of him. Will usually involve lots of incidental minor adventures, running into oracles and wise men, fantastic creatures and damsels dispensing items that may help you on your quest. A great device, because it allows the writer to do character interaction and showcase exotic locations, and give The Hero a good reason to Walk the Earth. Used mostly in a fantasy world, but can also take place in a modern or mundane setting with enough work-around.\\nOlder versions just set the character off on his quest in the wilderness about them.\\nOften undertaken by Hitchhiker Heroes or people on The Homeward Journey.\\nThe problem with such a story from a modern perspective is that they can actually tail off too much into the various side-stories and forget the main goal that the characters originally started out on. This was less of a problem before, as Medieval writers often deliberately wrote a network of plots, subplots, and sub-subplots branching out like a tree. Examples of this are Spenser's Fairy Queen, Arabian Nights, and Romance of the Three Kingdoms.\\nChristopher Booker's The Seven Basic Plots separates The Quest from Overcoming the Monster. While both involve a journey, the Overcoming the Monster plot is far more focused on heading straight for the Monster (with perhaps a side quest for magic weapons), while The Quest concentrates on a variety of obstacles including Monsters, Temptations, Deadly Opposites, and a Journey to The Underworld. (This probably indicates that if the heroes don't realize there's a Big Bad to fight until after the halfway point, it's following The Quest plot.) Also, The Quest is the plot most likely to include companions (a small group, or just one companion - or, as with The Odyssey, a Red Shirt Army).\\nCompare The Hero's Journey. Though separate and distinct tropes, the two don't just overlap, they have adjoining apartments and raid each other's refrigerators Kramer-style. The main difference is that a quest has a stated goal, and the focus is mainly on the adventures had along the way to that goal; a hero's journey tends to be undertaken in response to events thrust upon the hero(es), and focuses on the personal growth of the characters as they find (or overcome)their destiny.\\n\\nExamples"
    },
    "name": "The Quest",
    "rdf_element": "TheQuest/int_21ff24b7",
    "short_name": "TheQuest",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TheQuest"
  },
  {
    "categories": [
      "CharactersAsDevice"
    ],
    "descriptions": {
      "Willow": "Madmartigan in Willow is something of an expy Han Solo who eventually leads the rebel army while Willow takes care of the Big Bad.\\n Airk fits the trope better though, since he's in command of the rebel army for most of the movie, whereas Madmartigan is basically a lone wolf and only takes charge  after Airk is killed by General Kael.",
      "general": "The Supporting Leader is a secondary character who leads the forces of good in their struggle against the Big Bad. He isn't the main protagonist of the series, but generally gets a spotlight episode focusing on some important battle right as the actual heroes are off performing whatever task winds up actually saving the day. This character is often the Deuteragonist.\\nThe Brigadier and The Captain may be his underlings. The heroes who actually defeat the Big Bad may also be in his or her chain of command, but they're more likely to be an independent force of their own; their personal struggle is usually for the Golden Snitch while the Supporting Leader keeps the Big Bad from winning by default.\\nPretty much found in any story where a kid is the hero. One of the surrounding adults will take on the role.\\nA variation of this is common in gaming, where following an initial battle, the player's nominal superior will tell them that the main battle is in hand and they need to proceed to the special objective that is the real centerpiece of the mission.\\nSometimes this character will be the true hero of the story, and the central character will be the Supporting Protagonist. When the leader is the protagonist, rather than a secondary hero, it's A Protagonist Shall Lead Them.\\nCompare Big Good, and The Lancer. Contrast with Hero Protagonist. If the battle scenes seem like they'd be pretty interesting in their own right, this character may be the Hero of Another Story.\\nA specific Sub-Trope to The Leader naturally."
    },
    "name": "Supporting Leader",
    "rdf_element": "SupportingLeader/int_21ff24b7",
    "short_name": "SupportingLeader",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SupportingLeader"
  },
  {
    "categories": [
      "OlderThanDirt"
    ],
    "descriptions": {
      "Willow": "Willow: he returns with a book of magic, but he settled back down to study at home.",
      "general": "Maybe, despite your Refusal of the Call, you got dragged in, but you have always longed for escape; maybe you Jumped at the Call and are now older and wiser; maybe you did love being In Harm's Way, but it's gotten old now, or you've fallen in love, or your cynicism has been overcome by the Close-Knit Community. It's time for the Happy Ending: to go, and stay, home. Nice, peaceful, safe home. And do all sorts of quiet things. Maybe settle down with the Love Interest and indulge in Babies Ever After, or just grow some flowers. Definitely stop all this dangerous adventuring stuff. Any attempt at And the Adventure Continues will be rebuffed with We Are Not Going Through That Again.\\nYou Can't Go Home Again? No matter, if you found another place that can serve as home. Often, it's better than the original. (Indeed, if the original was bad enough, this can actually motivate adventure, to find some place better.)\\nIf you can't get home, or find a replacement, often the driving force of There's No Place Like Home. Compatible with I Choose to Stay, as long as there is some place to settle down there.\\nThe Quest for the Bluebird of Happiness famously ends in returning home to find it nesting there, sometimes explicitly stated as this.\\nMay end in Stranger in a Familiar Land, deflating hopes; this can result in his searching for a new home, his realizing that his new home is where his new love and new friends are, or his deciding that after all, he loves In Harm's Way.\\nInverse of both In Harm's Way and Small Town Boredom \\u2014 although it is not unknown for a character to oscillate between them. Can also be a motive for avoiding the Deadly Decadent Court.\\nIt obviously can occur throughout the story, but can only be fulfilled at the end. As a consequence, often the bait for a Leave Your Quest Test. If it's the hero's primary motivation throughout the story, it's The Homeward Journey.\\nOften causes the character to hate being Famed In-Story, as that drags him away from home and draws curious visitors who clutter up the quiet life. The Heroic Neutral (often the Retired Badass) has succeeded in getting home, and the reason he will return to adventure is that Evil refuses to let him live there.\\nIn a series, may require Passing the Torch.\\n\\nExamples"
    },
    "name": "Home Sweet Home",
    "rdf_element": "HomeSweetHome/int_21ff24b7",
    "short_name": "HomeSweetHome",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/HomeSweetHome"
  },
  {
    "categories": [
      "RolePlayingGame"
    ],
    "descriptions": {
      "Willow": "Happens in Willow, with Our Hero very reluctantly answering the call.",
      "general": "Heroes come in all shapes and sizes; there are those who Jump at the Call and those who Refuse the Call. Whether reluctant or adventurous, stories with these heroes can start Easing Into The Adventure by introducing the hero well before they get their wooden sword and very first Fetch Quest in their peaceful hometown; with a young Bob doing chores, playing with friends, having a heart to heart promise with Alice, fighting and losing to the Jerk Jock who teases them. The usual.\\nThis helps us see the hero \\\"before\\\" and better appreciate Character Development, provide exposition, and generally build up slowly rather than quickly to the story's actions. In video games, it can Justify The Tutorial. It also makes their motivations for adventuring, returning home, and fear of losing (or pain at having lost) their hometown all the more poignant.\\nIt does raise the danger of losing fans who would like the actual story and attracting (briefly) fans who will not, because the opening is not indicative of the story.\\nNotably, if the peaceful hometown survives the hero's Call, there will be a Jerk Jock that the hero will return to face and handily beat, as well as a girl he wanted to woo who he now either marries, or spurns in favor of the girl he met on the voyage.\\nThis is so common in RPGs, be they Western or Eastern, that they might as well patent it \\u2014 the \\\"faffing about\\\" part makes for great tutorial material.\\nWhile we've seen it frequently already, it's still a classic.\\nSee also Good Morning, Crono. Contrast In Medias Res.\\n\\nExamples"
    },
    "name": "Easing Into the Adventure",
    "rdf_element": "EasingIntoTheAdventure/int_21ff24b7",
    "short_name": "EasingIntoTheAdventure",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/EasingIntoTheAdventure"
  },
  {
    "categories": [
      "SpeculativeFictionTropes"
    ],
    "descriptions": {
      "Willow": "The eponymous hero of Willow does this to The Chosen One in the climax, sending her somewhere \\\"where evil cannot touch her!\\\" Not really. He just used sleight of hand to hide the baby and make Bavmorda think she was gone. It worked so well even the good witch fell for it.",
      "general": "The end is nigh, and the curtain is dropping. With no hope left, the doomed inhabitants of a world perform one final act of defiance against the coming dark: they fling a light into the future.\\nWhether it's their last son, a powerful artifact, weapon, or even a simple warning, they send another person/people in danger of similar destruction a means to recognize and hopefully avert it. Sending this shining beacon can involve an escape (space) ship, Time Travel, being put in suspended animation, or a Subspace Ansible of some kind. This trope is common in Speculative Fiction and Fantasy, so the means of delivery can vary considerably.\\nIf it's part of a character's Backstory, it usually comes with a dose of The Chosen One. Sometimes, the \\\"light\\\" has no purpose in being sent other than in the sending; the dying world might not see themselves as able to help others, and just wants to shout its existence against the cold void of time and space.\\nCompare Living Relic, Moses in the Bullrushes, Thanatos Gambit, Fish Out of Temporal Water. Contrast Outside-Context Villain.\\nIf it's an inversion with the future flinging a light into the past, it may fall under Ominous Message from the Future instead."
    },
    "name": "Fling a Light into the Future",
    "rdf_element": "FlingALightIntoTheFuture/int_21ff24b7",
    "short_name": "FlingALightIntoTheFuture",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/FlingALightIntoTheFuture"
  },
  {
    "categories": [
      "HeelFaceIndex"
    ],
    "descriptions": {
      "Willow": "Averted in the movie Willow, where evil Queen Bavmorda wants her daughter Sorsha to follow in her footsteps. Of course, that just means that point 19 of the Evil Overlord List starts to apply for her...",
      "general": "There is a female villain. She could be a minor crook, or something more impressive like a professional assassin, The Dragon or even a Big Bad in her own right. Either way, she's going about her wicked ways and has every intention of continuing to do so.\\nAnd then, completely by accident, she gets pregnant.\\nAll of a sudden, she just can't seek redemption quickly enough. Sure, she's killed and looted for years without a shred of pity for her victims \\u2014 but now she's going to be a mother, and she just can't stand the idea of her baby thinking ill of her. Or the coming baby forces her to look back on all she's done and realize that she does not want this for her child, and does not want him or her to become like her. And of course, it's easier to keep the baby safe and Give Him a Normal Life if she abandons the lifestyle of an evil outlaw.\\nA variation is that she gives up the child once it is born and continues much the same as before, but we are made to understand that by doing so she squandered her chance \\u2014 if she had kept the baby, she would have been redeemed.\\nThis does not generally happen to male villains. If they have children, they are more likely to want them to grow up to follow in their evil footsteps.\\nThe prospect of parenthood does occasionally make people straighten their lives out. However, there are also people who have children because they assume that that will make them (or their partners) better people and turn out to be wrong about that, much to the misfortune of those children \\u2014 making this not quite Truth in Television.\\nMight be considered a subtrope of Babies Make Everything Better, and definitely a subtrope of High Heel-Face Turn.\\nSee also Morality Pet, once the child is born. See also Love Redeems.\\nIf she doesn't pull a Heel-Face Turn, but keeps the kid, she is a Dark Action Mom.\\nNot to be confused with the novel by David Baldacci or the 2006 Academy Award-nominated documentary feature by Amy J. Berg. (Or with The Lord's Prayer, which both titles, like this Trope's name, were inspired by.)"
    },
    "name": "Deliver Us from Evil",
    "rdf_element": "DeliverUsFromEvil/int_21ff24b7",
    "short_name": "DeliverUsFromEvil",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/DeliverUsFromEvil"
  },
  {
    "categories": [
      "FantasticSapientSpeciesTropes"
    ],
    "descriptions": {
      "Willow": "The Nelwyn, from the movie Willow.",
      "general": "Just about every fantasy world has at least one race whose defining characteristic is that they're short. They typically fill the role of \\\"comic relief\\\" in an adventuring group (when they're not the protagonists), and often serve as the \\\"cute\\\" race in a Five Races setup. Not always, though; the Little People can be made to fit pretty much any of the Five Races, with the exception normally being High Men (that spot's reserved for taller races, always). If any race of the Little People is to be considered tall compared to the rest of those races, it's most likely gonna be a Dwarf. Because they resemble a child, there's a good chance the Little People are magic users.\\nDwarves, Hobbits, Leprechauns, Gnomes, Christmas Elves, and some Fairies are specific subtropes. If these people are really little and are the main characters, it is a Mouse World; for other mouse-sized people, see Lilliputians.\\nNot to be confused with Little People Are Surreal, Depraved Dwarf, or the animated series of the same name. Should be distinguished from Real Life little people, lest you sound like Dr. Venture above."
    },
    "name": "Little People",
    "rdf_element": "LittlePeople/int_21ff24b7",
    "short_name": "LittlePeople",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/LittlePeople"
  },
  {
    "categories": [
      "SpeculativeFictionTropes"
    ],
    "descriptions": {
      "Willow": "At the end of Willow, a duel takes place between Fin Raziel and Queen Bavmorda.",
      "general": "A Wizard Duel (also Wizard's Duel or Wizardly Duel) is when two (sometimes more) characters with magical or magic-like powers (spells, usually) battle each other using them. A trope found mostly in Fantasy, though it may apply to characters with magic-like powers of other genres.\\nIf both the heroes and villains have a wizard on their side, you can be assured this will happen at some point. Usually at or near the story's climax, probably because such a battle tends to be visually impressive. Of course, if the protagonist of the series is the sorcerer, then it happens all the time. The battle doesn't have to be between enemies; it can occur between friends or rivals, a master and his apprentice, and so on.\\nSometimes, there are specific rules that have to be followed in the duel, especially if both characters belong to a special caste or organization. Of course, if one of the participants is dishonorable, expect him or her to cheat.\\nIf such rules prohibit direct attacks on each other, or the work's demographic would make serious violence inappropriate, or the duel is just more of a friendly rivalry than an all-out fight, the participants may limit themselves to ostentatious spell contests instead; \\\"any fish you can summon, I can summon bigger\\\", if you will. This kind of duel goes right back to The Bible, if not earlier.\\nCuriously, one trick rarely used is to magically silence the opponent. This may be because it would make the duel too easy...or because an unspoken assumption of the setting is that it would not actually work. (Not all magic depends on incantations, and as long as the caster isn't physically prevented from speaking in the first place an invocation's effectiveness rarely seems to be depend simply on how loud it is, or perhaps all competent magi have some defense against such spells) One exception is in Role-Playing Games, where Silence spells are fairly common.\\nIf the win condition involves the death of an opponent, see Duel to the Death. If the magic users are specifically using Voluntary Shapeshifting spells to get the upper hand, it's a Shapeshifter Showdown."
    },
    "name": "Wizard Duel",
    "rdf_element": "WizardDuel/int_21ff24b7",
    "short_name": "WizardDuel",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/WizardDuel"
  },
  {
    "categories": [
      "FantasticSapientSpeciesTropes"
    ],
    "descriptions": {
      "Willow": "Willow has a scene with a whole swarm of tiny, glowing fairies...and their enormous, hovering queen, Cherlindrea.",
      "general": "Basically all the various kinds of fairies in folklore.\\nFairies today are thought of as little or human sized Winged Humanoid with butterfly wings, that fly around in a sea of sparkles, and have magical powers (including granting wishes). This is not the original concept; genuine folkloric fairies are nasty, dangerous, powerful, and never winged.\\nAlthough these vary depending on the story (hence the trope title). Much like Demons, what classifies as \\\"Fairie\\\" is often as varied as \\\"Mammal\\\". Three standard forms stand out, however:\\n A tiny Winged Humanoid between one and twelve inches tall. Variations include skin or hair colors, type of wings (iridescent or butterfly-like are the most common), what they wear (if anything), and often whether or not they generate their own light. Usually called some variation of \\\"Fairy\\\", \\\"Sprite\\\", or \\\"Pixie\\\".\\n A small, sometimes childlike, humanoid between one and three feet tall. Leprechauns are the most common type seen, but other types such as Brownies, Redcaps or Spriggans are often common. Gnomes and even Goblins may also fall into this category.\\n An impossibly beautiful/graceful human-sized humanoid, often with pointed ears. Usually an Elf in all but name with more overt magical nature or ability than your \\\"standard\\\" Fantasy Elves. Sometimes they are that work's version of Elves. May or may not have wings. Other common variations are water (Often called Nereids or Undines) or tree/forest Fae (usually called Nymphs or Dryads). Others may have animal features, such as a stag's head or fox's tail, or plant features like wooden skin or vines wrapping around their body(especially Nymphs/Dryads). These always seem to be near or at the top of the fairy totem pole.\\nBut these are hardly the full extent of what Fairies can be. Just as Dragons can encompass many related creatures, fairies can include mythological/fantasy creatures such as Satyrs, Nymphs, and Goblins. They often hang around with animals (especially Unicorns), which might possibly be Fey (or the equivalent) themselves.\\nA common form is a Fairy Godmother, who gives characters help with wishes. Although modern stories will heavily add Be Careful What You Wish For.\\nSylphs, the original Elemental Embodiment of wind as envisioned by Paracelsus, are usually depicted as fairies.\\nFairy Tales often involve fairies, at least they do nowadays, but that term comes from Madame d'Aulnoy's Les Contes de F\\u00E9es. The original folk tales seldom involved them, and even if they did, it was only in Western European folklore.note\\u00A0The Brothers Grimm expurgated all the Fees in their first edition on the grounds that they were French, not German, folklore.\\nA Super Trope to:\\n The Fair Folk\\n Fairy Companion (a fairy hanging around giving help)\\n Fairy in a Bottle\\n Fairy Godmother\\n Fairy Sexy\\n House Fey\\n Leprechaun (most common Irish, as well as male fairy in fiction)\\n Spark Fairy\\nOur Elves Are Better is a Sister Trope, as they share much of the folklore.\\nCompare Our Angels Are Different, Our Mermaids Are Different.\\nNot to be confused with a euphemism for homosexuals."
    },
    "name": "Our Fairies Are Different",
    "rdf_element": "OurFairiesAreDifferent/int_21ff24b7",
    "short_name": "OurFairiesAreDifferent",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/OurFairiesAreDifferent"
  },
  {
    "categories": [
      "CostumeTropes"
    ],
    "descriptions": {
      "Willow": "Willow\\n General Kael in his skull-faced helmet that he rarely removes.\\n Inverted when Madmartegan finds some fancy armor that comes with a dorky-looking helmet with a tassel and nasal bar. He loses it pretty quickly.",
      "general": "Helmets of all shapes and sizes.\\nOne thing that makes a helmet cool is a crest of almost any shape and size on it. History is full of Cool Helmets, from the Greek Chalcidian helmet worn by Hoplite to the Roman gladiators' ornate helmets to Japanese Kabuto to the German Pickelhaube. These helmets influenced the designs of various other helmets across medias.\\nOf course, many characters who wear a Cool Helmet may not truly need protective headgear, especially in the case of beings of godlike power who barely have to worry about head injuries. A helmet may have some other practical function, or be worn simply because of vanity.\\nA villain in a Cool Helmet might be a nerd underneath.\\nA Sub-Trope of Nice Hat.\\nA Sister Trope to Cool Crown.\\nCompare Collapsible Helmet.\\nContrast Helmets Are Hardly Heroic."
    },
    "name": "Cool Helmet",
    "rdf_element": "CoolHelmet/int_21ff24b7",
    "short_name": "CoolHelmet",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/CoolHelmet"
  },
  {
    "categories": [
      "ComedyTropes"
    ],
    "descriptions": {
      "Willow": "In Willow Master Swordsman Madmartigan prepares to make a Last Stand against the Evil Army. He does some fancy sword kata and the army rushing at him stops, then starts running away. Madmartigan grins until he notices a shadow and turns to see a giant, two headed dragon that rose up out of the moat behind him.",
      "general": "This is a comedic trope where a character (usually The Hero) believes that they intimidated an enemy, usually complete with said hero getting cocky and/or grinning like a goof until they realize that what was truly scary was either a bigger fish, an Enemy Rising Behind, or The Cavalry arriving Just in Time to save them.\\nDepending on the situation, the hero's reaction is usually either an Oh Crap!, or getting deflated about the fact that they're not as intimidating and badass as they thought.\\nRelated to and often overlaps with Always a Bigger Fish, but not always. May also overlap with Enemy Rising Behind in some cases. Compare and contrast Right Behind Me. May involve Failed a Spot Check on The Hero's part if he really should have noticed something sooner than he did. Compare Framed for Heroism."
    },
    "name": "Scared of What's Behind You",
    "rdf_element": "ScaredOfWhatsBehindYou/int_21ff24b7",
    "short_name": "ScaredOfWhatsBehindYou",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ScaredOfWhatsBehindYou"
  },
  {
    "categories": [
      "JustForPun"
    ],
    "descriptions": {
      "Willow": "Queen Bavmorda did something like this in Willow, rounding up all the pregnant women in her domain and checking each of their children for the mark of the one prophesied to bring about her downfall. The fact that she's defeated not by the the prophesied baby, but by the people trying to keep her safe from her constant attacks makes this a particularly overt Self-Fulfilling Prophecy.\\n Elora's hair was use in the ritual that opened the portal so, technically, she did have part in defeating the Queen.",
      "general": "The Big Bad has just learned that a child that can defeat him has been or soon will be born. The obvious solution to this problem is to Screw Destiny. Nip this danger in the bud and kill the infant Hero before he can become any kind of threat. This is the stage where the problems crop up. Either the Big Bad has no idea who this child actually is, or other characters also aware of this destiny have taken the initiative to hide and protect the child before the Big Bad can actually reach him. Or the would-be killer thinks they've done the deed, but unbeknownst to them, some force or benevolent person intervenes and the child is actually Not Quite Dead. Whatever the mechanism, the upshot is that You Can't Fight Fate.\\nOften the only thing to do in cases where they can't identify the child is to attempt to track down the newborn hero, baby-by-baby if necessary. The Big Bad will investigate or, if impatient, simply kill any child in the proper age range to attempt to secure his safety \\u2014 this may result in a Childless Dystopia if he's thorough enough. Inevitably, it never works, and if innocent children are killed, the resultant crossing of the Moral Event Horizon makes clear just how bad the villain is - and of course karmically seals their fate. Worse yet, this act often directly backfires, giving the hunted newborn a reason beyond mere prophecy to go after the Big Bad after he's grown up enough to take him on; see Self-Fulfilling Prophecy.\\nThis being a form of Villain Ball, it almost never occurs to anyone that a wiser thought might be to try to find and raise the child himself. Though you might occasionally see it among the more Genre Savvy villains, who take the view that the kid might love him too much to finish him or, in the worst case scenario, will be close at hand if he does Heel-Face Turn. This often doesn't work either, though, and is irrelevant if the prophecy is that the child will defeat him. Then again, all that's needed for the Prophecy to be fulfilled is for the would-be slayer turned protege to become The Starscream (and be successful).\\nSister Trope to Genocide Backfire, with which it can and does overlap. The primary difference is that this trope is specific to a Big Bad trying to find a newborn Hero before they can be a threat. No more or less. Genocide need not be a part of the method. The main factor for whether or not such a situation is this trope is if the genocide is merely a means to an end (Kill Tribe A to prevent the rise of Child B) or an end in itself (Kill Tribe A to stop any rising, period).\\nAlso compare Offing the Offspring for those occasions when the child is the son or daughter of the Big Bad. See also Infant Immortality, which is, in writing terms, one of the primary reasons this rarely succeeds.\\nNot to be confused with Nice Job Breaking It, Hero. However, it can be related to Nice Job Fixing It, Villain."
    },
    "name": "Nice Job Breaking It, Herod!",
    "rdf_element": "NiceJobBreakingItHerod/int_21ff24b7",
    "short_name": "NiceJobBreakingItHerod",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/NiceJobBreakingItHerod"
  },
  {
    "categories": [
      "VideogameItemsAndInventory"
    ],
    "descriptions": {
      "Willow": "Willow for the Nintendo Entertainment System has the Fleet spell to get out of caves.",
      "general": "A standard RPG item which allows the player to immediately exit the current dungeon with no questions asked, returning them to a safe harbor so they can treat their party's injuries (and save their game) before attempting another crawl.\\nOf course, the downside is that it may be a long trip to get back to that point in the dungeon, but this can still be preferable to getting killed outright (especially if Continuing Is Painful). Many seasoned adventurers will keep one or two on hand (even if it encroaches on their Inventory Management Puzzle) just in case they run afoul of Demonic Spiders or the Boss in Mook Clothing.\\nThe exact details and restrictions on an Escape Rope will vary depending on the system, but common specifications include:\\n The \\\"safe harbor\\\" is a predetermined location, usually with access to a Save Point and/or Trauma Inn \\u2014 common destinations include the entrance of a dungeon, a nearby town, a Hub Level or the world map.\\n It only works from inside \\\"dungeon\\\" areas: Creepy forests, marshlands, underground caverns, decrepit ancient temples, etc., which the player explores from the outside inwards. \\\"Overworld\\\" locations such as towns, connecting fields/roads between towns/areas, the Hub Level or the world map itself, usually favor the Warp Whistle instead.\\n Note that if the dungeon is inverted, where the player starts in the middle and traverses outwards, the Escape Rope will probably return them to the middle where they started, or it may not even work at all.\\n It generally won't allow the player to flee from Random Encounters or Boss Battles in progress \\u2014 especially if a Fight Woosh is used to transition from field movement into battle. (That is usually the job for an Escape Battle Technique.)\\nCompare and contrast Warp Whistle, which allows instantaneous travel to previously visited locations but generally only works from \\\"overworld\\\" areas like towns; and Escape Battle Technique, which is similar but in battle.\\nSee also Door to Before, where the trip \\\"back\\\" from a dungeon conveniently unlocks a shortcut through the area so the player can make a return trip (and possibly future excursions) without as much hassle."
    },
    "name": "Escape Rope",
    "rdf_element": "EscapeRope/int_21ff24b7",
    "short_name": "EscapeRope",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/EscapeRope"
  },
  {
    "categories": [
      "Plots"
    ],
    "descriptions": {
      "Willow": "Madmartigan's performance in Willow.",
      "general": "Sexual attraction is a funny thing, and sometimes if a character physically appears to be the right gender to appeal to their sexual preference, then they'll become attracted to them, regardless of what that character's actual gender might be. Usually said character's true gender is being kept secret purposefully and they are a male Disguised in Drag or a female disguised as a male, but whether the misunderstanding was intentional or not, due to Rule of Drama, they will find out and it will be awkward, hilarious and possibly traumatizing for all involved.\\nThis can happen to any gender and sexuality. A straight male might be shocked to find the girl he's been crushing on was a male all along. A straight female might be confused to realize that hot guy she's been daydreaming about was actually a woman. Her male Gay Best Friend, who was also daydreaming about the guy (who is really a girl) will probably feel similarly. Almost always there is shock upon The Reveal, probably disappointment and maybe even disgust on the part of the character who was feeling the attraction, but usually the two characters can reconcile by the end and become friends. Other times it might not bother them, or after a period of consideration, they'll decide If It's You, It's Okay.\\nThis is both a reveal trope as well as a character reaction trope, when what initially appears to be compatible gender attraction is later revealed to actually be incompatible gender attraction (Example: Straight boy likes a girl, girl turns out to be a boy). It is a sister trope to the related Sweet on Polly Oliver, which refers to when what initially appears to be inexplicable incompatible gender attraction is later revealed to actually be compatible gender attraction (Example: Straight boy likes a boy, boy turns out to be a girl), although since the unsettling part is averted, this is usually a subversion (usually).\\nIn Real Life, this trope (known in some circles as \\\"trans-panic\\\") can have violent or even lethal consequences - there are numerous cases of people being physically or sexually assaulted, sometimes even murdered, when their sex is revealed.\\nCompare with Shapeshifting Squick, Dude Looks Like a Lady, Lady Looks Like a Dude, Bifauxnen, Gender-Blender Name, Samus Is a Girl and Female Monster Surprise. Often accompanied by Attractive Bent-Gender. Contrast Jumping the Gender Barrier and She's a Man in Japan. A subtrope of Gender Reveal.\\nFormerly called \\\"Dropped A Bridget On Him\\\", a play on the Guilty Gear character and the Dropped a Bridge on Him trope; references back to this title are still scattered around the site.\\nSpoilered pronouns are by definition self-fulfilling, so don't bother doing that.\\n\\nExamples"
    },
    "name": "Unsettling Gender Reveal",
    "rdf_element": "UnsettlingGenderReveal/int_21ff24b7",
    "short_name": "UnsettlingGenderReveal",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/UnsettlingGenderReveal"
  },
  {
    "categories": [
      "SpeculativeFictionTropes"
    ],
    "descriptions": {
      "Willow": "A characteristic of Elora in Willow, necessitating a more complicated process of disposal.",
      "general": "In this type of Immortality, a character is not particularly invincible or unaging. They can be hurt and killed, and they usually age normally. However, if they should die, they will immediately be reborn as a child.\\nThis child may or may not be identical to the original body, but will usually have all the memories of their past life or lives. Note that this is not always Reincarnation - the child may not literally be born, but instead appear or grow on its own.\\nIf they \\\"respawn\\\" as an adult (or at the same age they died, if a child), then it's Resurrective Immortality, instead.\\nThis type of immortality rarely overlaps with the other Immortality tropes. See also The Phoenix, Reincarnation."
    },
    "name": "Born-Again Immortality",
    "rdf_element": "BornAgainImmortality/int_21ff24b7",
    "short_name": "BornAgainImmortality",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/BornAgainImmortality"
  },
  {
    "categories": [
      "LoveInterests"
    ],
    "descriptions": {
      "Willow": "In Willow, Sorsha plays the Mad Sorceress's Beautiful Daughter. With some help from a Love Potion and Heel-Face Turn from her mother.",
      "general": "A traditional character, although something of a Discredited Trope these days: a Mad Scientist almost always has only one child \\u2014 a beautiful but innocent girl in her late teens or early twenties, who loves her father dearly, and whom he has kept cloistered away from the world. Sometimes she has some small doubts about his goals or methods.\\nWhen the question of how a shriveled ugly man has a gorgeous daughter comes up, the response is sometimes \\\"she looks like her mother\\\". Or sometimes because he looked better in his youth.\\nWhen the Mad Scientist is a good guy, the Daughter is not nearly so cloistered, although she is still a prime candidate as a love interest. Sometimes she ends up The Chick or The Smart Girl in a Five-Man Band when a team relies on the Scientist for their Phlebotinum. This latter version is more common nowadays.\\nThis trope is Older Than Feudalism, Medea \\u2014 and many Fairy Tale heroines \\u2014 being a recognizable form of it, even if it's the mad wizard's beautiful daughter.\\nSee also Replacement Goldfish, High Heel-Face Turn.\\nContrast Daddy's Little Villain and Overlord Jr.. who are evil like their parent, don't fall for the hero (or heroine), and almost never really turn good. Also, Overlord Jrs. often aren't that attractive.\\nSee also Defecting for Love. Often overlaps with The Ugly Guy's Hot Daughter.\\n\\nExamples"
    },
    "name": "Mad Scientist's Beautiful Daughter",
    "rdf_element": "MadScientistsBeautifulDaughter/int_21ff24b7",
    "short_name": "MadScientistsBeautifulDaughter",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/MadScientistsBeautifulDaughter"
  },
  {
    "categories": [
      "ILikeSwords"
    ],
    "descriptions": {
      "Willow": "Happen several times in Willow with Mad Martigan against the evil soldiers, especially against the skull-masked General Kael.",
      "general": "Rapiers, Cutlasses, Katanas, Laser Blades, whatever. At times, a goodie and a baddie just have to have a one-on-one fight, with Swords.\\nIn any given story, the main character is fairly likely to be somewhat proficient with a sword. In video games, anime, and certain sci-fi-fantasy stories, indeed, large segments of the population prefer swords as their primary weapons, over any firearms that may be available. This is true even in many cases where it would be far more intelligent to use a firearm.\\nBonus points when it's a modern setting, and using a blade is Awesome but Impractical because you Never Bring a Knife to a Gun Fight and the hero is far less likely to possess the training needed to use a sword. Exactly why this is the case varies. In some settings, swords offer advantages that guns do not. Perhaps the predominant point-defensive system is effective against ranged weaponry and not against blades, \\u00E0 la Dune. Sometimes the enemy and duelists are invulnerable to ranged weapons, such as through using the Force or Implausible Fencing Powers to deflect bullets, which means that they must battle in close-range with formalized sword martial arts that counteract this invulnerability. Perhaps it is a formalized duel where modern weapons are forbidden. Or perhaps the people using swords or edged weapons are just that cool, \\u00E0 la the Jedi. Sometimes, of course, it is left unexplained.\\nA similar trope results when two characters choose to battle each other with their bare hands, for absolutely no reason at all. Even if one of them (usually the hero) has a gun, he will throw it away, preferring the visceral satisfaction (and added chance of failure) of beating his rival's face in. Again, this has no practical value in nearly all cases.\\nUnfortunately, even when use of swords is justified, it is usually done unrealistically. Rule of Cool fight-choreography, and safety guidelines that minimize hazard to actors have led to a wide acceptance of the unrealistic image of swordplay.\\nCommon sub-tropes:\\n\\n Audible Sharpness\\n Barehanded Blade Block\\n Blade Lock\\n Cutlass Between the Teeth\\n Flynning\\n Implausible Fencing Powers\\n Reverse Grip\\n Slice-and-Dice Swordsmanship\\n Sword Drag\\n Sword Limbo\\n Sword Lines\\n Sword over Head\\n Sword Sparks\\n Throwing Your Sword Always Works\\n Twinkle Toes Samurai\\n Weapon Stomp\\n You Fight Like a Cow"
    },
    "name": "Sword Fight",
    "rdf_element": "SwordFight/int_21ff24b7",
    "short_name": "SwordFight",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SwordFight"
  },
  {
    "categories": [
      "MoralityTropes"
    ],
    "descriptions": {
      "Willow": "Fin Raziel (good witch) and Queen Bavmorda (bad witch) in Willow.",
      "general": "In many of the original myths and legends, spirits and monsters are not explicitly said to be good or evil. Often, they're just mischievous or powerful with a sense of \\\"humor\\\", and reasonable people give them lip service but otherwise leave them alone. After centuries of modifying, demonizing and adapting the stories, sometimes certain terms became associated with certain deeds. Sometimes this is a simplification to appeal to or educate young audiences, who supposedly require clear morality in characters.\\nA modern story can get some cred by reverting the depiction to the ambiguous original, although it's possible to annoy an audience who isn't familiar with that (or in some cases is too familiar with that). More commonly, the moral implications of the term are so indoctrinated that a story using it may invent a new piece of jargon or qualifier to imply \\\"goodness\\\" and \\\"badness\\\". For example, white witches and fairy godmothers are considered different from \\\"bad\\\" witches, even though they do the same things in a general sense. Mischievous creatures lumped under \\\"elf\\\" who are not cute tended to get eventually lumped into evil.\\nNaturally a fantasy story using Not So Different may use the same \\\"race\\\" for the hero and the villain, in an effort to be even-handed. Sometimes you have the weaker implication that the other group exists but the story simply doesn't follow them.\\nFriendly Neighborhood Vampires are different, taking a monolithically evil group from folklore and making certain members of it good. See also My Species Doth Protest Too Much.\\nCompare Dark Is Not Evil, The Dark Side and Fantastic Racism."
    },
    "name": "Good Witch Versus Bad Witch",
    "rdf_element": "GoodWitchVersusBadWitch/int_21ff24b7",
    "short_name": "GoodWitchVersusBadWitch",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/GoodWitchVersusBadWitch"
  },
  {
    "categories": [
      "CombatTropes"
    ],
    "descriptions": {
      "Willow": "The battle between Bavmorda and Fin Raziel in Willow is like the distaff counterpart of the Gandalf/Saruman fight cited above, possibly inspired such as it came out first. (The movie version of the fight, not the book.)",
      "general": "The practitioner of Full Contact Magic can literally attack you from across the room; he punches the air, and then you get punched. Each spell cast is punctuated not by a subtle gesture, but by a grand motion. He's a wizard that casts spells by fighting. Dodging opposing attacks or setting up on-the-spot shields is also important. If the wizard can fly, it's a whole new ball game.\\nWhen they exist alongside more traditional wizards, a character of this type can usually perform their spells faster, with fewer requirements, and/or with greater power, but is poor at complex effects and long magical rituals. Depending on the work, this could make them Weak, but Skilled, Unskilled, but Strong, or both at once.\\nContrast with Magic Knight, where a wizard is not squishy, but simply is a trained warrior in addition to casting spells. Contrast with Supernatural Martial Arts, where the martial arts training is what creates the magical effect, rather than the magical spells themselves requiring broad motions. When a character can use both Magic and martial arts separately, it's Kung-Fu Wizard.\\nA Sub-Trope of Magical Gesture. Contrast with the much less physical Pstandard Psychic Pstance. Also contrast Powers Do the Fighting.\\nCan often result in an Elemental Punch or Sword Beam. Also see Air Jousting (which flying users of this trope often indulge in), Hand Blast and Simplified Spellcasting.\\nThis trope is the middle tier of The Law of Power Proportionate to Effort."
    },
    "name": "Full-Contact Magic",
    "rdf_element": "FullContactMagic/int_21ff24b7",
    "short_name": "FullContactMagic",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/FullContactMagic"
  },
  {
    "categories": [
      "SpeculativeFictionTropes"
    ],
    "descriptions": {
      "Willow": "In Willow, Queen Bavmorda's vaguely canine hunting beasts look more like giant furry/scaly warthogs but are consistently referred to as \\\"dogs\\\". Probably because \\\"hunting pigs\\\" sounded silly and they were using dressed-up Rottweilers anyway.",
      "general": "It doesn't look like a duck, walk like a duck, or quack like a duck, but everyone around you insists it's a duck.\\nJust as Speculative Fiction authors like to Call a Rabbit a \\\"Smeerp\\\", they also like to invent wild new creatures, give them the names of familiar animals, and plunk them down into their settings to run amok. The differences between the smeerps and their real-world counterparts can range from mild \\u2014 such as \\\"dogs\\\" that have spiked backs and three tails in addition to all their normally canine traits \\u2014 to extreme, such as bipedal, poison-spitting, frilled reptiles with saddles being referred to as \\\"horses\\\".\\nWhen used in non-visual media, the problem is that unless the author is very explicit right up front about the fact that the animal in question is quite different from what the word normally means, the reader may be hundreds of pages in before he runs across something that just doesn't make sense, which can be jarring. It shatters the Suspension of Disbelief when you have to suddenly change your mental image of the hero's faithful dog to include scales and a forked tongue.\\nA common trope in RPGs, especially when naming monsters.\\nThere is some Truth in Television here\\u2014explorers would name newly discovered animals after the ones they were familiar with due to a resemblance in how it looks, sounds, or acts. This is why, for example, you'd need to distinguish between African, American, and Eurasian buffalo\\u2014Portuguese explorers in the 1580s called African buffalo \\\"big oxes\\\" in their language; French traders in the 1630s independently applied their own cognate term to the large bovines of North America; and then in the early 18th century Europeans applied the term to the water buffalo of Asia (unlike the previous two times, that was probably a deliberate comparison to another \\\"buffalo\\\", namely the African one, rather than simply \\\"big ox\\\").\\nAnd for whatever reason, everyone thought that every animal would have an \\\"alien\\\" equivalent. The closest equivalent to outer space back then was the ocean. Have you noticed how many sea creatures have names like \\\"Sea/Mer + Name of Land Animal\\\", e.g. Sea Lion, Cow, Horse, Slug, and Cucumber? RPGs like to run with this too. Note that quite a few cases are due to translation errors (see Dinosaurs Are Dragons for a specific example of this).\\nNote that in Real Life, this trope can involve the linguistic debate on prescriptivism vs. descriptivism\\u2014if an animal is commonly called something, that is by definition its common name; it's only \\\"wrong\\\" if it doesn't convey what animal is being referred to. Common parlance is not professional taxonomic literature, which has binomial nomenclature to prevent ambiguities.\\nThe inverse of Call a Rabbit a \\\"Smeerp\\\". When already fictional creatures bear little resemblance to their mythological counterparts, it is, depending on the case in question, either Our Monsters Are Different or Call a Pegasus a \\\"Hippogriff\\\". Occasionally might be related to Translation Convention. See also Horse of a Different Color and SpaceX. Not to be confused with In Name Only. Closely related to Non-Indicative Name.\\n\\nExamples"
    },
    "name": "Call a Smeerp a \\\"Rabbit\\\"",
    "rdf_element": "CallASmeerpARabbit/int_21ff24b7",
    "short_name": "CallASmeerpARabbit",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/CallASmeerpARabbit"
  },
  {
    "categories": [
      "ActionAdventureTropes"
    ],
    "descriptions": {
      "Willow": "In Willow, the titular character throws a magic petrifying acorn at Queen Bavmorda. (Willow wasn't actually trying for a Hey, Catch! here - he just missed, but Bavmorda obligingly snatched it out of the air anyway.) Unfortunately for Willow, the magic of his quirky village witch doctor is not up to the task of petrifying the uber-sorceress Big Bad, and she shakes it off rather easily.",
      "general": "This is an action trope. It is performed by a character who throws something to another character (usually an enemy) to make him catch it \\u2014 either to simply distract him or to induce something even more nasty. This can be made to escape a gunpoint situation. \\\"Think fast!\\\" is the same trope, worded differently.\\nA common way to show that a fighter is highly aware of his surroundings is for him to react to this with a No Sell (throw an orange at him and it bounces off his chest) or a Nonchalant Dodge (throw an orange at him and he casually moves out of the way, not remotely distracted from the task in hand).\\nCan also reveal that an impersonator is Not Left Handed. Or is left-handed. Works not only for impersonators, but also for suspects \\u2014 when you know that the crime was committed by a left-handed person."
    },
    "name": "Hey, Catch!",
    "rdf_element": "HeyCatch/int_21ff24b7",
    "short_name": "HeyCatch",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/HeyCatch"
  },
  {
    "categories": [
      "WeaponsAndWieldingTropes"
    ],
    "descriptions": {
      "Willow": "Cherlindrea's wand in Willow.",
      "general": "The Magic Wand, the magician's all-purpose Weapon of Choice.\\nThe Magic Wand is a unique weapon in that unlike swords, bows or guns, this weapon is generally not for use in physical combat, but is instead a purely magical weapon. In general a Magic Wand is any device that enhances magic for producing spells, or aid in combat, or\\u2014less frequently\\u2014enables the use of magic in the first place. Circe used a Magic Wand to convert Odysseus's men to swine, thus making this one Older Than Feudalism.\\nThe Magic Wand may overlap with Simple Staff or Carry a Big Stick, resulting in the hybrid-weapon capable of both magic and melee combat, the Magic Staff. It's not uncommon for either of these forms to be Loyal Phlebotinum.\\nIf the wand in question appears on a fortune-telling card, it's Tarot Motifs - likely either the Magician or the Ace of Wands. Sometimes in Anime and Manga, a staff's powers will be tied to an onusa for use by Miko or onmyoji.\\nThese also tend to be more associated with Fairies, especially Fairy Godmothers, than wizards."
    },
    "name": "Magic Wand",
    "rdf_element": "MagicWand/int_21ff24b7",
    "short_name": "MagicWand",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/MagicWand"
  },
  {
    "categories": [
      "SpeculativeFictionTropes"
    ],
    "descriptions": {
      "Willow": "In Willow, humans are referred to as \\\"Daikini\\\".",
      "general": "In Speculative Fiction, the word \\\"human\\\" can seem out of place in a universe where every other species is named after their homeworld. Unless, of course, they come from Humus.\\nAs a consequence of this, or perhaps just to sound \\\"exotic\\\", alien cultures often come up with their own monikers for Puny Earthlings. Indeed, the word \\\"Earthling\\\" itself is an example, and it also shows that most of the time, oddly enough, they name humans after our own terms for our planet and its surroundings, rather than whatever Earth or the Sun is named in their language.\\nOf course, the word \\\"human\\\" itself originally meant \\\"of earth\\\", arguably making this Older Than Feudalism. The implied contrast, however, was not inhabitants of the Earth as opposed to those of other planets, but mortals walking the earth as opposed to the celestial gods.\\nSometimes indicative of Fantastic Racism, though not as much as Call a Human a \\\"Meatbag\\\" or Son of an Ape.\\nA subtrope of this is Planet Terra.\\n\\nExamples"
    },
    "name": "Humans by Any Other Name",
    "rdf_element": "HumansByAnyOtherName/int_21ff24b7",
    "short_name": "HumansByAnyOtherName",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/HumansByAnyOtherName"
  },
  {
    "categories": [
      "HeelFaceIndex"
    ],
    "descriptions": {
      "Willow": "Sorsha from Willow with Madmartigan.",
      "general": "It's hard to tell what does it exactly. Maybe it's the tendency of good guys to have larger Johnsons than their evil counterparts. Perhaps it's the realization that Good People Have Good Sex. But for some reason or other, sending an evil woman to seduce a hero has a surprisingly high turnover rate. There's a very good chance that's she'll just decide to bat for the other team (moral team, that is) rather than stick to the original plan. The sexier the hero, the more likely this will work.\\nTo make some sense out of this trope, look at this way. Sex Equals Love right? And Love Redeems, right? So sex redeems. If you're a woman, anyway\\u2014this is rarely used with female heroes, making this something of a sexy Double Standard.\\nThe trope may have a foot on reality's ground, for less than intuitive reasons: usually the villain is a villain for everyone, this including his or her female agents (who may get it even worse in their own camp compared with other minions of the Big Bad, for being at the same time female, spies and whores). If the good guys prove their own goodness in bed, but at the same time in their manners, way of acting and treating her, this may be the last straw to convince her it's the proper time to switch boats.\\nThe trope can also be gender inverted, with a male (usually the protagonist) suddenly being a lot more interested in helping some group after sleeping with a woman who's in the group.\\nFor more wordplay on related tropes, think of this as Sex Equals Redemption as opposed to Redemption Equals Sex. Here, the redemption comes after the sexual encounter instead of before.\\nMay or may not be a part of a High Heel-Face Turn and In Love with the Mark. Very common as a result of Go Seduce My Archnemesis, markedly less so in a Honey Trap. If the sex itself doesn't cause redemption, but she gets knocked up and that does, it's Deliver Us from Evil. Also see Villainesses Want Heroes which is basically the same except she doesn't succeed. If initiated by a female character, she is always a Heroic Seductress.\\nFor a darker relative, see Rape Portrayed as Redemption. Related to Sex Is Good."
    },
    "name": "Sex Face Turn",
    "rdf_element": "SexFaceTurn/int_21ff24b7",
    "short_name": "SexFaceTurn",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SexFaceTurn"
  },
  {
    "categories": [],
    "descriptions": {
      "Willow": "Willow was a side-scrolling platform game in arcades, where the player alternates between controlling Willow and Madmartigan and was pretty faithful to the movie's plot. The NES version was an action RPG that took liberties with the source material.",
      "general": "Bringing a game to another platform often doesn't end well; less frequently, the port is better or, at least, nothing that makes you miss the original. Some titles, however, cannot be considered simple ports - they're closer to completely new games. Important features are added (or missing); the mechanics has had substantial changes; most or all levels are changed; the visuals may have undergone a radical facelift; it may even belong to a different genre now. In the end, even if they are supposed to be the same game (and the publisher markets them as such), they share only the basic characters, stories, and maybe the fundamental elements. You may be a veteran of a game and still find a fresh challenge in the new version - the package is the same but the ingredients are not, or are mixed in a way to give a new flavor.\\nThis phenomenon can happen for a number of reasons, but the games it invests can be roughly divided into two categories."
    },
    "name": "Reformulated Game",
    "rdf_element": "ReformulatedGame/int_21ff24b7",
    "short_name": "ReformulatedGame",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ReformulatedGame"
  },
  {
    "categories": [
      "JustForPun"
    ],
    "descriptions": {
      "Willow": "Willow sees the evil Queen Bavmorda come across the prophecy of a child bearing a mark, who will lead to her destruction. Naturally, she scours the land capturing all pregnant women in search for this child. When Elora Dannan is born, all those people who have heard of the prophecy rally to protect the newborn so she can fulfill her destiny... accidentally bringing together a force that can storm Bavmorda's castle, while the queen herself is destroyed by the very spell she intended to kill baby Elora with.",
      "general": "A variation on the Prophecy Twist and, sometimes, the Self Fulfilling Prophecies, the Prophetic Fallacy is different in that the prophecy itself - typically a prophetic dream or glimpse through a time window - is incomplete or deceptive in some way rather than simply vague.\\nFor example, a man might see himself being knocked down by a car and note that the time on a digital display is 10:51, then spend the entire episode trying to avoid going near a road, despite various events conspiring to put him in danger. He eventually makes it to 10:52 and thinks he is safe, but is knocked down an hour or so later and discovers that he saw the digital clock in a mirror and his actual time of death is 12:01.\\nAlternatively, characters might have a vision of a terrible future and give up hope, but discover that the vision was of something fairly innocuous that looked unusually dangerous because of the limits that the vision imposed.\\nThe important factor is that whoever sees the vision is not given enough information to work out the truth. Thus, the Prophecy Twist comes not from the character misunderstanding a vague prophecy, but coming to the only available conclusion given the lack of a full story.\\nThis can be used to deliver a moral about not jumping to conclusions. If this trope is used comedically, then hilarity may ensue.\\nSee also Poor Communication Kills and Unspoken Plan Guarantee.\\nLike most Twist Ending tropes, Beware of Spoilers.\\n\\nExamples"
    },
    "name": "Prophetic Fallacy",
    "rdf_element": "PropheticFallacy/int_21ff24b7",
    "short_name": "PropheticFallacy",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/PropheticFallacy"
  },
  {
    "categories": [
      "LawsAndFormulas"
    ],
    "descriptions": {
      "Willow": "In Willow, where Madmartigan briefly dresses as a woman after a tryst, pretending to be a cousin of the married woman he just bedded, to avoid being pounded by the lunker of a husband. The husband, after looking him over, offers the immortal line, \\\"Wanna breed?\\\"",
      "general": "Whenever a male is turned into a female (or sometimes just when he dresses as one), he/she will almost always be extremely attractive, especially to members of his inner circle and close associates.\\nThis may result in awkwardness for all concerned. The sex-changed character will often examine her new form and find it to be very... attractive. Only to promptly Squick herself out when she realizes what she's thinking.\\nAttractive Bent-Gender operates in tandem with the First Law of Gender-Bending to leave the world more attractive than it had been before. Or at least no less attractive. A handsome man may become a beautiful woman... but so will an unattractive man. In true Gender Bender or Easy Sex Change situations, one rarely encounters a handsome man who becomes an unattractive woman.\\nThe trope may also apply to scenarios where a male is Disguised in Drag or crossdressing. Sometimes this is played straight, but (particularly when the crossdressing is Played for Laughs) it's often a case of Informed Attractiveness. In such scenarios, despite the \\\"new woman\\\" looking mannish and homely to the audience and most characters, someone will unaccountably be smitten with \\\"her.\\\" Hilarity Ensues as the crossdressed hero tries to fend off the advances of an unwanted suitor.\\nThis trope frequently leads up to the Second Law of Gender Bending. Sweet on Polly Oliver is a subtrope where a woman crossdressing is found attractive by straight guys. Frequently accompanies Old Friend, New Gender. See also Rule 63, which basically exists because of this trope. When they actually are both genders, it becomes Everybody Wants the Hermaphrodite.\\nContrary to stereotype, this can be Truth in Television."
    },
    "name": "Attractive Bent-Gender",
    "rdf_element": "AttractiveBentGender/int_21ff24b7",
    "short_name": "AttractiveBentGender",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/AttractiveBentGender"
  },
  {
    "categories": [
      "EvilTropes"
    ],
    "descriptions": {
      "Willow": "Bavmorda from Willow gets uglier the more black magic she uses.",
      "general": "Using certain evil superpowers or evil artifacts will leave characters scarred, disfigured, or deformed. So will committing acts of evil repeatedly.\\nWhen evil makes you ugly, it's often to exhibit the \\\"side effects\\\" of obtaining untold amounts of evil power or of using that power to hurt innocent people. The external form morphs to match the internal form.\\nSince evil super villains care only about obtaining power (typically at the expense of everyone else), they generally shrug it off when they suddenly age by 100 years, have limbs that they didn't have before, or can't go out in public anymore. This is because these changes usually have no negative effects other than the ugliness. A villain that has aged a hundred years, while he may be no wiser, will somehow avoid being physically hindered by the extra years. The villain with the extra limb will find neat uses for it...\\nTrying to hide with makeup is sometimes tried, because Make Up Is Evil.\\nIn video games, such transformations may be caused directly by less-than-honorable actions taken by PCs. The transformation may either grow or shrink in intensity the more evil one becomes.\\nTaken to the extreme, the evil transformation that corrupts the super villain could do them in.\\nSometimes an attempt at this trope fails: The character's new features improve their appearance.\\nWhen Beauty Equals Goodness, this is used to mark Face Heel Turns.\\nCompare The Corruption, Evil Costume Switch, Evil Makes You Monstrous, Power-Upgrading Deformation and What Measure Is a Non-Cute?.\\nContrast with The Makeover, Evil Is Sexy. See also Beauty Equals Goodness, where beauty is seen as proof of being good regardless of whether it's true."
    },
    "name": "Evil Makes You Ugly",
    "rdf_element": "EvilMakesYouUgly/int_21ff24b7",
    "short_name": "EvilMakesYouUgly",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/EvilMakesYouUgly"
  },
  {
    "categories": [
      "Villains"
    ],
    "descriptions": {
      "Willow": "General Kael from the film Willow is an obvious version though not everything is present but he does have the death's head mask and Badass Cape and is brutally hard to kill.",
      "general": "The Darth Vader Clone is a character archetype originating in sci-fi begun by the popularity of the character Darth Vader from Star Wars.\\nArchetype includes the following:\\n Wears a life support mask or a similar mask. Bonus points if he has Vader Breath.\\n Wears Dark Armor, often including a kabuto-like Cool Helmet.\\n Has a Badass Cape\\n May turn out to be related to one of the protagonists.\\n May have been a Fallen Hero.\\n Commonly a Magic Knight or the equivalent.\\n Is sometimes an Archnemesis Dad.\\n Is sometimes The Dragon instead of the Big Bad, as the original Vader was. In this case, the Darth Vader clone often supports a physically weaker, less combative, or more magical evil mastermind.\\n May also have complex motivations that make him/her more of an Anti-Villain, although still somewhat dark.\\n Speaks in a really deep voice. Expect his/her voice to either sound metallic or machine-like as well if possible, which is tied to the mask, armor, and fall from grace.\\n Carries a weapon. Commonly a sword.\\n Possibly Reforged into a Minion.\\nNot surprisingly, many characters of this type are found in Star Wars canon itself. See also May the Farce Be with You. Compare Char Clone, which is a descendant trope. In most cases overlaps with Obviously Evil. See also the Tin Tyrant, which this trope started as the sci-fi version of."
    },
    "name": "Darth Vader Clone",
    "rdf_element": "DarthVaderClone/int_21ff24b7",
    "short_name": "DarthVaderClone",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/DarthVaderClone"
  },
  {
    "categories": [
      "ComedyTropes"
    ],
    "descriptions": {
      "Willow": "In one scene in Willow, a woman shrieks at the sight of mouse-sized humanoid creatures called brownies.",
      "general": "A staple of early domestic comedies in both film and television. The mere sight of a mouse (or sometimes another animal who is the subject of a common phobia) will drive a housewife up onto a chair or a table, where she stands shrieking, stomping her feet, and clutching the hem of her skirt until the rodent is captured or driven away. This is largely a Dead Horse Trope today, rooted in a very specific and sexist image of women dating back to the early part of the 20th Century, but it is still visible in old Looney Tunes cartoons and in the odd ironic reference.\\nCartoons will sometimes play with this trope by crossing it with the old myth (recently deemed plausible by the MythBusters) about mice frightening elephants, resulting in elephants that shriek and leap up onto some (possibly insufficiently-strong) object upon sighting a mouse. Other ways to subvert this trope involve showing the wife standing unmoved while her husband shrieks and leaps to safety.\\nThis trope is arguably justified by evolution. For the vast majority of human existence, the animals commonly associated with this trope\\u2014rodents, snakes, spiders, etc.\\u2014were potentially venomous or carrying disease, and a human's fear of it could be an evolved self-preserving instinct.\\nSee also Cower Power and Why Did It Have to Be Snakes?.\\nNot to be confused with Eek! The Cat. Also not to be confused with the Jamaican reggae artist \\\"Eek-A-Mouse\\\".\\nTruth in Television, as there is an actual condition, called musophobia or murophobia."
    },
    "name": "Eek, a Mouse!!",
    "rdf_element": "EekAMouse/int_21ff24b7",
    "short_name": "EekAMouse",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/EekAMouse"
  },
  {
    "categories": [
      "ThisIndexIsNotAnExample"
    ],
    "descriptions": {
      "Willow": "Madmartigan against the two-headed dragon... thing in Willow.",
      "general": "When Siege Engines are loaded with people rather than rocks/bombs/plague victims. Usually in the context of a siege, so as to get attackers on a walltop quickly, or to give particularly tough characters a Dynamic Entry. See also Fastball Special, Abnormal Ammo.\\nTitle comes from a Darwin Award (that isn't about this, but a Tree Buchet-induced death)."
    },
    "name": "Catapult to Glory",
    "rdf_element": "CatapultToGlory/int_21ff24b7",
    "short_name": "CatapultToGlory",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/CatapultToGlory"
  },
  {
    "categories": [
      "IndexOfExactTropeTitles"
    ],
    "descriptions": {
      "Willow": "In Willow, Madmartigan puts his sword into one head of a two-headed dragon. It splodes.",
      "general": "Stuff Blowing Up is cool enough, but it somehow becomes even cooler when that stuff is human heads. Asploding heads may not be particularly realistic in some cases, but they sure look impressive. If people's heads start blowing up, it's usually a bad sign.\\nThe title is deliberate Engrish from the Strong Bad Email \\\"video games\\\" and subsequent game \\\"StrongBadZone\\\" on Homestar Runner, wherein the head of the person playing the game is presumed not to have actually asploded, although there have been no studies done on the matter so far as we are aware.\\nHead asplosions are typically the result of an Explosive Leash, being shot in the head (resulting in Pink Mist), or absorbing too much knowledge. Often, just before it happens, the unfortunate character clutches their skull.\\nThere's also the metaphorical (and occasionally literal for Mechanical Lifeforms) asploding that is said to occur when one's brain has gone mad from the revelation, or assaulted by a Mind Rape or Logic Bomb, or requires sufficient Brain Bleach.\\nFor less explosive loss of heads, see Off with His Head! For head impacts that aren't as violent, see Cranial Eruption.\\n\\nExamples"
    },
    "name": "Your Head A Splode",
    "rdf_element": "YourHeadASplode/int_21ff24b7",
    "short_name": "YourHeadASplode",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/YourHeadASplode"
  },
  {
    "categories": [
      "DeathTropes"
    ],
    "descriptions": {
      "Willow": "In Willow, when the title character knocks that egg thing into the water, it turns into a two headed hydra like monster and eats several of Sorsha's men and even one of what it used to be's kind.",
      "general": "Being eaten alive. Probably one of our oldest Primal Fears, and quite universal, given that we used to share this planet with some rather nasty predators. In this modern world, we have little to fear from most animals on land (though the sea is another matter), but stories of monsters of all kinds (dragons, aliens, demons, zombies, etc.) keep us very aware that we can become prey quite easily. It's probably the most common fear we have as kids.\\nSometimes the victim is Swallowed Whole, but other times, he or she is savagely ripped apart piece by piece (this is especially common if one is overtaken by multiple creatures out to eat you).\\nSee also Fed to the Beast, where someone is deliberately consigned to this awful fate, and Too Spicy for Yog Sothoth, for when the eater changes its mind. Almost never seen in common media is when the eaten is a vorarephile, those rare individuals for whom being eaten alive is not a fear...but a fetish.\\nIf you were looking for the film Eaten Alive, you'll want this page."
    },
    "name": "Eaten Alive",
    "rdf_element": "EatenAlive/int_21ff24b7",
    "short_name": "EatenAlive",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/EatenAlive"
  },
  {
    "categories": [
      "ComedyTropes"
    ],
    "descriptions": {
      "Willow": "Willow has a live-action version of this.",
      "general": "Some guy is skiing or snowboarding. Suddenly he trips and starts tumbling down the slope, as he tumbles, snow gathers up around him until he's now seen as a giant snowball rolling down the hill.\\nSee also Gravity Is A Harsh Seamstress.\\nCan overlap with Human Snowman"
    },
    "name": "Human Snowball",
    "rdf_element": "HumanSnowball/int_21ff24b7",
    "short_name": "HumanSnowball",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/HumanSnowball"
  },
  {
    "categories": [
      "CharactersAsDevice"
    ],
    "descriptions": {
      "Willow": "Early in Willow, the first and one of the only Nelwyns to volunteer to accompany the titular Willow on his quest is Meegosh. Vohnkar, the best warrior in the village, wasn't far behind though.",
      "general": "The Hero needs help and is urging a dangerous plan on a reluctant group of people. Who's the first to say he'll join in? Why, the youngest (or most seriously aged), the least experienced, the most unskilled, the weakest member of the group. Often results in many, if not all, of the other characters being shamed into joining.\\nIf the character's inexperience and youth are such that he doesn't know what he's getting into, Silly Rabbit, Idealism Is for Kids! may come into play. It may still shame them.\\nOn the other hand, the character can know. This is even more shaming.\\nThis character may find the actual conflict very hard but will stick with The Hero until the bitter end. Sometimes, though, they may pull a Leeroy Jenkins, or become The Load or The Millstone despite their best efforts.\\nContrast Sour Supporter, Who Will Bell the Cat?,. Compare Loser Has Your Back."
    },
    "name": "Least Is First",
    "rdf_element": "LeastIsFirst/int_21ff24b7",
    "short_name": "LeastIsFirst",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/LeastIsFirst"
  },
  {
    "categories": [
      "FateAndProphecyTropes"
    ],
    "descriptions": {
      "Willow": "In Willow, the then-infant princess Elora Danan is prophesied to destroy the evil queen Bavmorda. However, it is Willow and others striving to protect the princess who stop her. On the other hand, novels that continue the story after the movie play The Chosen One straight, as Bavmorda returns and now-grown Elora Danan must fulfill her original destiny.",
      "general": "Where The Chosen One is the ultimate victim of Because Destiny Says So, the Unchosen One is the ultimate perpetrator of Screw Destiny. This is the hero or heroine who stands up, not because of a prophecy, but because they feel the need or desire to stop the Big Bad (sometimes doing so in spite of a prophecy). The Unchosen One is, in essence, a Chosen One who chooses themselves.\\nThe reasons for this can vary. Perhaps the Chosen One Missed the Call, or was killed or incapacitated by a Destiny Screwing villain. Or, in a twist, the Chosen One is the villain and the Unchosen One decides to stop them. If all the prophecies say evil will triumph, the Unchosen One's reply would be \\\"screw that.\\\" Perhaps they were Refused by the Call and decided that they should go on adventuring anyway by their own terms. It could also be nothing more than a simple chance encounter allowing them to intercept the Call to Adventure in place of the real Chosen One. Every so often, the Unchosen is also a Chosen One who's decided to save the world of their own will, regardless of Fate.\\nOf course, because they aren't The Chosen One, things won't be laid out on a silver platter like a proper Chosen Hero often gets. They'll more often have to earn their place as The Hero. If there is a being or force doing the Choosing, they'll eventually have to acknowledge the Hero even if he wasn't the Chosen One. They may also have to deal with the possibility that The Chosen One will get the credit for all of their hard work. On the other hand, even the Chosen One might look in awe of this hero who created great things on his own efforts and is beholden to no one and no destiny.\\nAn Unchosen One has high odds of being a Heroic Wannabe, a Determinator, or any other hero type that is likely to jump at the call. There's also the possibility of the Unchosen One being a Badass Unintentional, someone who actually doesn't want to save the world but may be the only one in a position to do so. A possible fate for those who Missed the Call.\\nSome writers can't escape from this frame of thinking, though, and they occasionally write in that the character really was the Chosen One after all. Another common way to work around it is an ontological argument: someone was bound to eventually take up the sword against Emperor Evulz and lead the revolution to overthrow him. There could even be many heroes working together or independently to take him down. The \\\"Chosen One\\\" just happened to be the one who ultimately succeeded, and could easily have been replaced by any of the others had circumstances been different.\\nCompare Anti Anti Christ where someone is the Dark Messiah for the bad guys and tells them to take a hike."
    },
    "name": "The Unchosen One",
    "rdf_element": "TheUnchosenOne/int_21ff24b7",
    "short_name": "TheUnchosenOne",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TheUnchosenOne"
  },
  {
    "categories": [
      "CreatorSpeak"
    ],
    "descriptions": {
      "Willow": "In Willow, the villain's climactic ritual seems to take weeks. We see her chanting and pouring magical potions, while the heroes gather their forces, march overland to her castle, dig fairly deep trenches... she doesn't seem to sleep, eat, or do anything else for what must be rather a long period of time.",
      "general": "The heroes need to get from point A to point B; occasionally, these things have a specific distance, and other times the distances involved are left fuzzy. Sometimes travelling at the speed of plot is a function of intentionally vague traveling speeds, sometimes of distance.\\nIn Science Fiction, travelling at the speed of plot ensures that the characters arrive Just in Time for a plot point, whether that's in the nick of time or as part of a Downer Ending where the only thing you can do is mop up. If distance and speed are too overused as factors, Phlebotinum Breakdown is a great way to make sure the characters don't arrive early, whether it's due to transporter malfunction or a jump-drive misalignment.\\nThis trope usually goes unacknowledged. If the writers explain it in a way that makes sense, then the trope no longer applies. If the writers explain it in a nonsensical way, Unscientific Science or New Rules as the Plot Demands are in effect.\\nIn Horror or Action series set in the near modern age, travelling at the speed of plot is often enforced by My Car Hates Me.\\nThe trope name comes from J. Michael Straczynski's partly tongue-in-cheek declaration of the cruising speed of the Excalibur on Crusade in June 2000; he said similar about the Starfuries in Babylon 5. In video games, see also Always Close for when a video game universe bends itself to fit this trope, and Take Your Time, which is about detours rather than travel speed.\\nSee also Overdrive, Faster-Than-Light Travel, Conversation Cut, and Transformation at the Speed of Plot. Traveling at the speed of plot may also be why there are No Delays for the Wicked.\\n\\nExamples"
    },
    "name": "Traveling at the Speed of Plot",
    "rdf_element": "TravelingAtTheSpeedOfPlot/int_21ff24b7",
    "short_name": "TravelingAtTheSpeedOfPlot",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TravelingAtTheSpeedOfPlot"
  },
  {
    "categories": [
      "ActionAdventureTropes"
    ],
    "descriptions": {
      "Willow": "Double example: In the climactic fight scene of Willow, Madmartigan and General Kael spot each other across the battlefield at the same moment, and each of them initiates a Foe-Tossing Charge toward the other.",
      "general": "When somebody spots their nemesis or target or temporary #1 foe across a battlefield and they go after them, anyone who comes at them or gets in their way as they charge will be thrown aside without a glance. If it's a good guy going after a bad guy, the emphasis will be on how determined they are; if it's a bad guy going after a good guy, the message will be more that the bad guy's really big and strong and intimidating. If the bad guy is really evil he'll even mow down his own people just to get at his target.\\nBad guys don't always need a battlefield for a Foe-Tossing Charge; they'll just as happily use this tactic in a nightclub or shopping mall, basically any time there are people between them and their target. Another variant is when an ally of the hero stands up to the bad guy and says \\\"If you want to kill him you'll have to go through m-\\\" and gets tossed aside, being Not Worth Killing.\\nAlternatively, the good guy would kick off a Foe-Tossing Charge if he sees someone dear to him surrounded by enemies, in an attempt to get to them. For some reason, it ends badly more often than vice versa, so expect a Slow Motion Fall somewhere along the way.\\nDepending on how Badass the target of this are, this can also end in a massive Oh Crap! from said target.\\nCould be used in conjunction with a Dynamic Entry."
    },
    "name": "Foe-Tossing Charge",
    "rdf_element": "FoeTossingCharge/int_21ff24b7",
    "short_name": "FoeTossingCharge",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/FoeTossingCharge"
  },
  {
    "categories": [
      "FairyTaleTropes"
    ],
    "descriptions": {
      "Willow": "Queen Bavmorda in Willow is not only an evil queen but a bad mother.",
      "general": "A mother is one of the most central figures that a character can have growing up, and her influence can have an impact on that character even as an adult. If the character is lucky, that mother will be a loving one, and if he or she is really lucky, she'll be an Action Mom who can kick ass and take names if the character is ever threatened.\\nBut if the character is really unlucky and isn't suffering from Parental Abandonment, the character's mother will be an Evil Matriarch and chances are, she will make that character's life a living hell.\\nThe Evil Matriarch comes in two forms:\\nComedic: Usually used in the Dom Com, this variety is usually the mother of one of the two parents on the show who comes to visit every so often, and someone on the cast dreads it. Usually (though not always) this variety of Evil Matriarch is a meddling parent, often to an irrational extreme. Classically, this is a Mother-in-Law situation, but from time to time, the kids themselves, or even the child of the mother is the one that dreads it. In some cases, everyone hates the Evil Matriarch, like in Malcolm in the Middle where everyone dreads Lois's mother coming to visit. In other cases, her visit is appreciated by everyone but the daughter or son of the Evil Matriarch, like in Family Ties, where the matriarch is evil because her daughter feels she can't live up to mom's perfection. Expect this variety of Evil Matriarch to have Power Hair and other Fashionable Evil.\\nDramatic: This variety, which shows up in more dramatic media, is truly evil in a traditional sense, and is one of the worst villains one can face, especially if one of the Heroes or Love Interests is one of her children (or if she's married into his or her family as a stepmother). Many such Evil Matriarchs are completely convinced that they, and only they, know what's best for their children, and can be very controlling, manipulative, and perfectly willing to do anything they deem necessary for their children's sake, no matter how evil or destructive it may be. The most vicious examples of this variety of Evil Matriarch despise their children (or at least the one they've singled out as The Unfavorite) and are often physically or emotionally abusive towards them, and many of them are not above Offing the Offspring.\\nIf she's not entirely human, then expect her to be a Hive Queen. If she is also the Queen, expect God Save Us from the Queen!.\\nThe Spear Counterpart of this character type is Archnemesis Dad. The inversion is Antagonistic Offspring. See Abusive Parents and Parental Neglect for the more mundane versions. See Offing the Offspring and/or Matricide for what this might lead to if the kids fight back. If it's not your mother but her replacement who's making your life a living Hell, see Wicked Stepmother."
    },
    "name": "Evil Matriarch",
    "rdf_element": "EvilMatriarch/int_21ff24b7",
    "short_name": "EvilMatriarch",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/EvilMatriarch"
  },
  {
    "categories": [
      "ShowBusiness"
    ],
    "descriptions": {
      "Willow": "Willow follows the adventures of the character of the same name, played by Warwick Davis, and only leaves his perspective to show what the villains are plotting. However, Davis gets third billing to Val Kilmer and Joanne Whalley, both playing supporting characters.",
      "general": "The tendency of a film to be retroactively linked in the public mind with the biggest name in the film or be marketed as \\\"starring\\\" the biggest name, even if that actor is not the main character (at least from the filmmakers' point of view), and occasionally even if his or her character is very minor indeed.\\nThere are several reasons why this might happen: drumming up a newly famous actor to help advertise the movie, a famous actor given a supporting role (Stunt Casting) to help sell the movie, or a secondary or supporting role gaining more hype than the main role which requires a change in publicity (Ensemble Dark Horse). Sometimes the actual lead actor gets an \\\"And Starring\\\" credit. In extreme cases the actor playing the principal character isn't even mentioned on the poster.\\nA variation is caused by the repackaging of an older movie with a then obscure, now famous actor prominently advertised. This happened to Satisfaction (1988) which, after Pretty Woman made her famous, was repackaged as Girls Of Summer \\\"starring\\\" Julia Roberts and featuring a small appearance by Justine Bateman (who, for those who don't get Sarcasm Mode, was in 1988 a major figure as a co-star in Family Ties but is today better known as Jason's sister) as the lead character.\\nSeeing as this is becoming very common, only include examples of where the role is substantially smaller than the actor's billing would suggest, not just where they're not the main protagonist. In an Ensemble feature, this is partially justified provided they are part of the main ensemble and not just a cameo.\\nIn music, it is not uncommon for certain songs to be more associated with a featured guest singer than its official lead artist. Common causes for this include the lead artist being a producer or instrumentalist whereas the guest is providing vocals, a rap song whose chorus is sung by a superstar guest, or just the guest artist being so much more famous than the lead.\\nCompare Billed Above the Title, Spotlight-Stealing Title, and Wolverine Publicity, where a popular character is deliberately added for the sole purpose of selling a product, whether or not the character is actually relevant to the story. Also compare Award Category Fraud, where a minor role is given an award for a major one, or vice versa."
    },
    "name": "This entry is trivia, which is cool and all, but not a trope. On a work, it goes on the Trivia tab.\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\n\\t\\t\\n\\t\\tBilling Displacement",
    "rdf_element": "BillingDisplacement/int_21ff24b7",
    "short_name": "BillingDisplacement",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/BillingDisplacement"
  },
  {
    "categories": [
      "MagicAndPowers"
    ],
    "descriptions": {
      "Willow": "Similarly, Fin Raziel in Willow, when using Elora Danaan's wand to toss Bavmorda around, uses gestures along with some sort of magic words. Abruptly becomes very funny when she shouts \\\"Nananananana!\\\" while twirling the wand to spin Bavmorda in midair.",
      "general": "Whenever someone uses their Psychic Powers, they put a hand up to their head, most traditionally with the middle and fore fingers on the brow and thumb on or very near the cheek. If they're doing something really hard, it takes both hands on their temples. If it's something really difficult, they have to use both hands \\u2014 and quiver, and maybe bleed from the nose.\\nThis is a type of Magical Gesture. Healing Hands is a similar standard-gesture power. Not to be confused with the Face Palm. Compare Blasting Time. Compare and contrast Gotta Get Your Head Together, which generally happens to a person on the receiving end of Psychic Powers."
    },
    "name": "Pstandard Psychic Pstance",
    "rdf_element": "PstandardPsychicPstance/int_21ff24b7",
    "short_name": "PstandardPsychicPstance",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/PstandardPsychicPstance"
  },
  {
    "categories": [
      "IAmAnIndex"
    ],
    "descriptions": {
      "Willow": "Willow: The title character, who has been tasked to bring a future queen (currently a baby) to her empire, has this exchange with the swordsman he's traveling with.",
      "general": "A form of sarcastic rejoinder, responding to an improbable statement with an even more impossible statement.\\nPopular forms include \\\"I'm the Queen of Sheba\\\" and \\\"I'm a monkey's uncle\\\".\\nCan lead to interesting results if Bob takes Alice at her word, which may be because he's constitutionally deaf to sarcasm, doesn't expect her to disbelieve him, or doesn't recognize the improbability of her statement. Or Bob may sarcastically reference Alice's statement when his improbable statement is proved true; see Cue the Flying Pigs.\\nSee also Or My Name Isn't...."
    },
    "name": "And I'm the Queen of Sheba",
    "rdf_element": "AndImTheQueenOfSheba/int_21ff24b7",
    "short_name": "AndImTheQueenOfSheba",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/AndImTheQueenOfSheba"
  },
  {
    "categories": [
      "CostumeTropes"
    ],
    "descriptions": {
      "Willow": "In Willow, Madmartigan dons a full suit of armor complete with helmet in preparation for the battle of Tir Asleen, only to lose the helmet about a minute into the fighting, and never bothers to retrieve or replace it.",
      "general": "Related to In Space Everyone Can See Your Face, in any work where a hero wears armor, either powered or otherwise, the helmet is never worn, even in combat situations.\\nThe reasons for this are various. Humans are good at recognizing faces, and associate faces with personalities. It avoids dehumanizing the characters (see: Faceless Goons). Actors need facial expressions as a main tool of their performancesnote\\u00A0as well as needing to be recognized for professional reasons\\u2014a little ego is admittedly necessary for career advancement. Also, less armour equals more Badass.\\nAlternately, the armor the main character wears might not be distinctive enough to make him stand out from other people wearing armor; we wouldn't want our hero to just be one of the faceless goons, after all. Writers and artists often try to alleviate this by giving main characters almost, but not quite the same uniform as the Faceless Mooks \\u2014 or cheat by giving the hero a helmet, but shows their face clearly, whereas everyone else wears a full face helmet. When this is used to distinguish someone from an identical group of mooks, it's also Uniformity Exception.\\nAnd in video games where you can customize your character's appearance, wearing a helmet will often obscure it and waste all the effort you put into it.\\nThere is some justification for this trope, depending on the type of hero. Generally speaking, helmets tend to be heavy and restrictive, so a person who relies on keen senses or freedom of movement might find them less than ideal. Helmets are also bulky and awkward to carry when not being worn, so a Walking the Earth-type hero is also likely to forego them for the long haul. There's still little excuse not to use them in open battle, however.\\nOn a related note, in virtually every superhero movie in which the main character wears a mask, it will be pulled off during the climax of the movie. Usually it's torn off or so badly damaged that there's no point in keeping it on; sometimes the hero just decides to take it off.\\nContrast Cool Helmet (where the helmet enhances the hero's image) and Fantasy Helmet Enforcement (where the hero is setting a safety-conscious good example)."
    },
    "name": "Helmets Are Hardly Heroic",
    "rdf_element": "HelmetsAreHardlyHeroic/int_21ff24b7",
    "short_name": "HelmetsAreHardlyHeroic",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/HelmetsAreHardlyHeroic"
  },
  {
    "categories": [
      "CharactersAsDevice"
    ],
    "descriptions": {
      "Willow": "Willow: Ethna was just a midwife who was doing her job. The queen Bavmorda ordered a baby with a certain birthmark to be found and killed. Ethna delivered Elora, the baby that the queen feared. Ethna took the baby and fled, despite not having any personal stake or even connection to the child, she risked her life to get the child to safety and sends her down the river so the Queens dogs don't get her, they tear Ethna to pieces.",
      "general": "When something bad happens, most people gape in fear and shock. They are the Innocent Bystanders. But sometimes one person decides to help out, and in the doing, becomes a hero. That's the Heroic Bystander.\\nThe Heroic Bystander is not someone who is normally expected to be a hero in time of crisis, such as a police officer or a lifeguard. Instead, it's an ordinary person, with no special training, who happens to save a life through their own inner courage and resolve.\\nIt doesn't have to be a life that is saved. A Heroic Bystander can also defend a person's reputation, distract a villain with a Defiant Stone Throw or help someone out who needs help, when no one else is doing so.\\nThis can be used as a device to show the growth of a character, such as having a cowardly individual show remarkable resolve in coming to someone's rescue. It can show how someone is transformed from a passive outsider, to someone who gets involved and tries to help others. Sometimes, it can be used to let a wimp have their day in the sun. Sometimes (especially in real life) a whole crowd will get involved, possibly sparked by one person showing courage to ignite the powder keg.\\nOf course, those bystanders live in a world that is basically similar to our own. An Anti-Hero of a Crapsack World (who is usually a bystander, not a Knight in Shining Armor) is something different.\\nSee also I Am Spartacus, which sometimes uses this. If he's the protagonist, then he becomes an Action Survivor. Compare Good Samaritan, Badass Bystander, Civilian Power, and Hero of Another Story.\\nSomewhere between this and a Superhero lie The Real Heroes: ordinary people in jobs that require them to do this day-in, day-out without anyone writing a comic strip about them.\\nContrast Never Be a Hero."
    },
    "name": "Heroic Bystander",
    "rdf_element": "HeroicBystander/int_21ff24b7",
    "short_name": "HeroicBystander",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/HeroicBystander"
  },
  {
    "categories": [
      "Youngsters"
    ],
    "descriptions": {
      "Willow": "Willow invoked this, but for Willow's own child, who stood crying in the middle of the village until Willow grabbed her and they made a run for it, getting to safety before the monster dogs could kill them. Strangely enough, this is one of the few versions where the toddler was not carried to safety - both Willow and daughter ran. This, because they're both midgets little people, and it wasn't possible for him to lift her and run to safety at higher speed than they would both run together.",
      "general": "When a town/city faces disaster, there'll be a small child, usually but not always under 10 years of age, that for whatever reason will have become separated from his/her parents. Luckily, someone steps in the way and saves the child before he/she gets hit/shot/whatever.\\nNot to be confused with the Littlest Cancer Patient, who is often the focus for (often) an entire episode. A Crying Little Kid is only on screen for a few seconds. Although they both try to make the audience go \\\"Aww, that's sad\\\".\\nSee also: Empathy Doll Shot."
    },
    "name": "Crying Little Kid",
    "rdf_element": "CryingLittleKid/int_21ff24b7",
    "short_name": "CryingLittleKid",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/CryingLittleKid"
  },
  {
    "categories": [
      "ArchetypalCharacter"
    ],
    "descriptions": {
      "Willow": "Subverted in Willow, where a baby girl is prophesized to be the one to bring about the evil Bavmorda's downfall, but what actually happens is that all the people trying to protect her end up defeating the evil queen while she's still a baby. This happens in no small part due to a healthy dose of Self-Fulfilling Prophecy on the Big Bad's behalf.",
      "general": "There was an ancient prophecy that foretold one day a very special troper would Describe The Chosen One Here.\\nThe ultimate victim (or beneficiary) of Because Destiny Says So. The oldest and most common Super Hero Origin. The easiest way to turn an Ordinary High-School Student into the only thing preventing The End of the World as We Know It. Take it for granted that they are The Only One.\\nOne would think that the title implies some superior intelligent being or force had to make the Choice, but it's not common practice to expect The Chooser of The One. Other human beings have a lot of trouble just finding The Chosen One. And don't even get started on when they're wrong...\\nBonus points if the character is actually called \\\"The Chosen\\\" or \\\"The Chosen One\\\", or the phrase \\\"Only You Can Save X\\\" appears. The title of Chosen One may prove to be largely unnecessary. See also Only the Chosen May Wield for examples of how the Chosen One is often identified. Compare It Sucks to Be the Chosen One and The Chosen Many. Contrast The Unchosen One and The Chosen Zero.\\nThat said, always be wary about what you are being chosen for. If your job description involves \\\"defeating the darkness\\\" and involves long years of danger and struggle, chances are good that you've been made The Hero. If, on the other hand, your job description involves getting pampered by half-naked temple virgins, then chances are very good that you've been chosen to be a sacrifice instead!\\nNot to be confused with Giving the Sword to a Noob, where there is someone clearly more qualified that is able to do the job."
    },
    "name": "The Chosen One",
    "rdf_element": "TheChosenOne/int_21ff24b7",
    "short_name": "TheChosenOne",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TheChosenOne"
  },
  {
    "categories": [
      "VillainousFashionSense"
    ],
    "descriptions": {
      "Willow": "Similarly, in Willow General Kael's helmet has a skull for a faceplate. Half of it breaks off when swatted with a sword.",
      "general": "Armor with loads of flashy things that look intimidating, but it often looks more useful than it actually is. It has loads of Spikes of Villainy, Shoulders of Doom, possibly Horns Of Villany, and often some skulls. If there is headgear, expect to to be a Rage Helm unless the bearer is a main character.\\nArmor that is meant to be scary exists in Real Life (albeit as more of a side benefit), but this just overloads it, to the point where someone actually wearing this would be... overloaded. In short, this is almost always Impossibly Cool Clothes.\\nAnimated Armor made from this kind of suit of course has none of the mobility problems a human would have, probably due to lacking any structure without the armor to begin with. A Wizard Did It indeed. Similarly made more plausible by Powered Armor in sci-fi settings.\\nSometimes an Evil Overlord will wear this even when not in battle, which creates a variation of Ermine Cape Effect. Many of these are also Tin Tyrants. Bonus points if said armor comes with a High Collar of Doom.\\nCursed variations may become a highly impractical Clingy Costume.\\nCompare 24-Hour Armor, Bling of War, Impractically Fancy Outfit, Impossibly Cool Weapon, Breast Plate, Stylish Protection Gear, Battle Ballgown.\\nCompare/Contrast Pimped-Out Dress."
    },
    "name": "Scary Impractical Armor",
    "rdf_element": "ScaryImpracticalArmor/int_21ff24b7",
    "short_name": "ScaryImpracticalArmor",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ScaryImpracticalArmor"
  },
  {
    "categories": [
      "DisguiseTropes"
    ],
    "descriptions": {
      "Willow": "Madmartigan in Willow tries this briefly to hide from the husband of a lady he's currently boning. It ends up making said husband grossly infatuated with \\\"Hilda\\\", letting him deliver his immortal line:\\n And when his disguise is quickly blown by the bad guys, Lug does not take it well:",
      "general": "Somebody passing for the other gender is a common trope in comedy, all the way back to Shakespeare. However, it usually works only if the actor in question actually makes an effort to look and behave like a member of the opposite sex, otherwise the audience's Willing Suspension of Disbelief is broken and instead of being about, say, a man trying to pass as a woman, the work becomes about how a group of morons didn't realize they were trying to pick up a drag queen. Occasionally it works, if applied side by side with Rule of Funny.\\nCompare Paper-Thin Disguise. A Sister Trope to Larynx Dissonance and (naturally) Disguised in Drag."
    },
    "name": "Incredibly Conspicuous Drag",
    "rdf_element": "IncrediblyConspicuousDrag/int_21ff24b7",
    "short_name": "IncrediblyConspicuousDrag",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/IncrediblyConspicuousDrag"
  },
  {
    "categories": [
      "ArchetypalCharacter"
    ],
    "descriptions": {
      "Willow": "In Willow, Elora Danan's arrival is the start of Willow's journey.",
      "general": "The Herald is a person, message, or crystallizing incident that sets the Hero/Protagonist on the path of adventure. They bring the Call to Adventure. If a story's setup is similar to this:\\nthen \\\"X\\\" is the Herald. Oh, and you'd better hope \\\"X\\\" isn't also the Big Bad, cause that tends to get messy.\\nThe Herald can be non-human (a newspaper or news report, for examples), but a more memorable force has more impact.\\nCommon subtropes include:\\n\\n Almost Dead Guy\\n Come with Me If You Want to Live\\n Damsel Errant\\n Manic Pixie Dream Girl\\n Mysterious Waif\\n Mystical Waif\\n Distress Call\\n Harbinger of Impending Doom\\n I'm Dying, Please Take My MacGuffin\\n Inciting Incident\\n Pursued Protagonist\\n Rescue Introduction\\n Starts with a Suicide\\n Take Up My Sword\\n Vagueness Is Coming\\n\\nNot to be confused with the troper of the same name. The Herald may have to bribe and/or enforce the call."
    },
    "name": "Herald",
    "rdf_element": "Herald/int_21ff24b7",
    "short_name": "Herald",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/Herald"
  },
  {
    "categories": [
      "WerebeastTropes"
    ],
    "descriptions": {
      "Willow": "Bavmorda's \\\"You're all pigs!\\\" spell in Willow cannot be described as pleasant.",
      "general": "Usually, Shapeshifting is done quickly and without undue damage to the shifter. For whatever reason, the body flows from one form to the other without much trouble. But that isn't always the case. Sometimes, those who would take on another form are going to suffer for it.\\nAs the name implies, a Painful Transformation tends to be agonizing. While it may not leave permanent injuries, it's still not pretty.\\nThere are generally two ways transforming can be painful:\\n Physical - The body is tortured during the transformation process. This is rather understandable, as one would imagine the bones and organs shifting around as having some sort of impact on the nerves.\\n Mental/Spiritual - The user's mind is overrun with horrid... whatever. We rarely get into a shapeshifter's head. Externally, it looks like they undergo a Freak Out every time they change shape. This may even be necessary to transform, in cases like that of the Incredible Hulk.\\nIf painful doesn't begin to describe the transformation, see Body Horror.\\nUsually not associated with Voluntary Shapeshifting, where the user generally knows enough to pick a quick and painless method of transformation. Involuntary Shapeshifters and (especially) Baleful Polymorphs, on the other hand....\\nIn cases where the shapeshifter will, once fully transformed, pose a threat to all others present, no one takes advantage of their temporary incapacitation in an attempt to flee or subdue them."
    },
    "name": "Painful Transformation",
    "rdf_element": "PainfulTransformation/int_21ff24b7",
    "short_name": "PainfulTransformation",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/PainfulTransformation"
  },
  {
    "categories": [
      "PersonalAppearanceTropes"
    ],
    "descriptions": {
      "Willow": "In the fantasy movie Willow, the sorceress Fin Raziel claimed that she was a young and attractive woman before she was turned into a a ferret by the Witch Bavmorda. The roguish hero Madmartigan therefore really wants to see her true form. Sadly, she had spent a long, long time in animal form, and when changed back to human, she found herself to now be a hag.",
      "general": "You all know them. That kindly old lady who lives down the street. The tiny, wrinkly, owner of the local dojo. The aged, fading seductress. The crotchety old guy who hardly ever leaves his house. Wrinkled, aged, musty... but they weren't always that way.\\nOnce upon a time they were attractive, very attractive. This will be revealed to the rest of the cast if they ever run into a Fountain of Youth, or via old photographs or perhaps just to us the viewers in a Flashback.\\nCompare Glory Days, The Chains of Commanding (for those who lose their looks due to stressful jobs). Contrast She Is All Grown Up; Grandma, What Massive Hotness You Have; Really 700 Years Old; and I Was Quite a Fashion Victim.\\nRelated to I Just Want to Be Beautiful when the character misses his/her old beauty.\\nNot to be confused with the Pok\\u00E9mon Platinum character."
    },
    "name": "I Was Quite a Looker",
    "rdf_element": "IWasQuiteALooker/int_21ff24b7",
    "short_name": "IWasQuiteALooker",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/IWasQuiteALooker"
  },
  {
    "categories": [
      "ArchetypalCharacter"
    ],
    "descriptions": {
      "Willow": "Fin Raziel, in Willow, is of the rare female subtype.",
      "general": "The Eccentric Mentor is an apparent contradiction, a sagacious figure who seems eccentric and possibly foolish; a font of power and respectability who acts like comic relief. Typically the Eccentric Mentor is an older male character, connected to the back story, who acts as a mentor, protector, and/or guide. They often feign senility and weakness when it is useful to do so, and rarely take pains to avoid such an appearance if it requires effort. Their eccentricity may show itself even in visual appearance, including a quirky clothing style and an aversion to shoes.\\nWhen pushed, the Eccentric Mentor easily demonstrates how they have earned their status. Those who underestimated them are suddenly confronted with heroic badassery, Sherlock Holmes-level insight, moral fortitude in the face of death, and/or staying a step ahead of everyone else. Due to their age, wisdom, and conviction, they fear death far less than a loss of integrity.\\nCombines aspects of Cool Old Guy, The Obi-Wan, Old Master (sometimes), Crouching Moron, Hidden Badass, Bunny-Ears Lawyer, often Cloudcuckoolander, and Zen Survivor into one cranky, tough old biscuit. If they are an authority figure, they are The Wonka. They may fill any of a number of mentor roles, such as Trickster Mentor or Reasonable Authority Figure, related to their personality and their role in the story. As such, no matter how much power they have, they want the heroes to solve the problem. Mentor Occupational Hazard will likely happen at some point."
    },
    "name": "Eccentric Mentor",
    "rdf_element": "EccentricMentor/int_21ff24b7",
    "short_name": "EccentricMentor",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/EccentricMentor"
  },
  {
    "categories": [
      "Trivia"
    ],
    "descriptions": {
      "Willow": "Sorsha and Madmartigan in Willow hooked up in real life. Val Kilmer married Joanne Whalley, who added the hyphenate \\\"Kilmer\\\" to her name. They had two kids together but divorced eight years later.\\n Willow's actor, Warwick Davis, met his wife Samantha Burroughs while she was playing a Nelwyn extra.",
      "general": "A pair of performers fall in love while working together, possibly even getting married and/or having kids over time. This happens quite a bit in Hollywood and is prime tabloid fodder. Such relationships seem to have a high breakup rate, but there are some long-lasting marriages that started this way.\\nWhat is actually being filmed is largely irrelevant. They're often a couple onscreen as well\\u2014when you spend all day pretending to be in love with someone, you may end up Becoming the Mask. However, it doesn't always happen that way. The point of the trope is that behind the scenes the two fall for each other.\\nThe Muse is a Sub-Trope, which is about a male movie director falling in love with his lead actress. Cast Incest is another subtrope, namely the first type where the couple met while playing relatives, which adds a level of Squick before further thought reveals that it's no different from any other role.\\nIn live theatre circles, the phenomenon is known as a \\\"showmance\\\" and tends to annoy their costars to no end.\\nCompare Actor Shipping, where the fans want this to happen.\\n\\nExamples"
    },
    "name": "This entry is trivia, which is cool and all, but not a trope. On a work, it goes on the Trivia tab.\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\n\\t\\t\\n\\t\\tRomance on the Set",
    "rdf_element": "RomanceOnTheSet/int_21ff24b7",
    "short_name": "RomanceOnTheSet",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/RomanceOnTheSet"
  },
  {
    "categories": [
      "NarrativeDevices"
    ],
    "descriptions": {
      "Willow": "Willow has the wizard of the village run a test to find an apprentice. He holds out his hand and asks each applicant to chose the finger that holds the most power. Everybody fails, even Willow, who was going to pick his own finger, but backed out at the last moment. The wizard later confides in him that it would have been the right answer.",
      "general": "The character is undertaking a challenge of courage, strength or skill for some important prize. However, at a critical moment, The Hero is confronted with doing something that is morally unacceptable. Despite being warned about a forfeit if the reprehensible act is not done, the hero reluctantly stands by the decision and accepts that the challenge is lost, expecting no credit for the deed, often not expecting anyone to know.\\nAlternately, the hero may be faced with a task outside of the challenge that is noble, but doing that task will force him to lose the prize\\u2014an innocent stranger to save during a heated race, for instance, or helping a competitor who had become injured rather than just running to the end himself. The hero says \\\"Screw the Rules, I'm Doing What's Right\\\" and goes to help.\\nHowever, the hero is then told that that forfeiting the challenge in this way is exactly what was needed to triumph. It was actually a test of character, and the hero has passed with flying colors.\\nThe hero seldom rejects the tester, the reward, or the whole situation on the grounds that it was an underhanded trick \\u2014 and this is not only when the other character was a Mentor, Threshold Guardian, or otherwise an authority figure, but between equals (such as a Fidelity Test.) More often, the hero is profoundly relieved and/or pleased that his apparent sacrifice to his conscience has been rewarded after fearing they have lost everything.\\nWatch for Exact Words. When a character is told that the prize depends on the \\\"results\\\" or \\\"outcome\\\" rather than the success, it will be phrased in such a manner that no one would, at first glance, take it to mean anything but success, but the character saying it can point out that he is doing exactly what he said. (If more than one character tried, and one succeeded in the ostensible goal but still failed the test, expect bitterness.)\\nSometimes, instead of refusing or doing the act, the hero will Take a Third Option.\\nThis will sometimes occur in the context of a Training Accident or The Game Never Stopped. A reversal of Threshold Guardians. A Career Building Blunder operates on a similar principle.\\nA subtrope of both Sweet and Sour Grapes and Secret Test. Contrast If You're So Evil, Eat This Kitten, which is this trope applied to villainous behavior. Angel Unaware, A Chat with Satan, Honest Axe, Leave Your Quest Test, Nice to the Waiter, and Unwinnable Training Simulation are related types of tests. What You Are in the Dark is related as well: Most Secret Tests involve putting you in the dark to test you.\\nIf it's not a test of moral character, it's just a Secret Test or a Hidden Purpose Test."
    },
    "name": "Secret Test of Character",
    "rdf_element": "SecretTestOfCharacter/int_21ff24b7",
    "short_name": "SecretTestOfCharacter",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SecretTestOfCharacter"
  },
  {
    "categories": [
      "FameAndReputationTropes"
    ],
    "descriptions": {
      "Willow": "In the movie Willow, the group first encounters Finn Raziel, one of the world's most powerful witches, after she's been transformed into a possum by the Big Bad. The two Brownies name a whole bunch of things they were expecting instead, with taller being just one of them.",
      "general": "So it's been a while since you answered the Call to Adventure, and you've had some successes. Spectacular successes, even. Everyone has heard of what you've done and everyone knows your name. . . but they don't know what you look like, and you don't exactly look the part. Maybe you're the Kid Hero, Little Miss Badass, Cute Bruiser, Really 700 Years Old, a Lady of War with a Tomboyish Name, or maybe you just lack the movie-star looks everyone associates with a heroic role.\\nEither way, your reputation precedes you, and every time you introduce yourself, people are going to look at you and say \\\"Oh! I was expecting someone taller...\\\". Or worse, they'll ask you if you've met/heard of/know of... well... you. Then you have to say Actually, I Am Him. Or even worse, they'll think your associate is you, and then you have to say Actually, That's My Assistant.\\nAlternatively, maybe you're just a Dirty Coward with an Astonishingly Appropriate Appearance who happened to be in the vicinity of great events.\\nCan be Truth in Television - research has shown that people make links between people's height and their perceived success, even if they know nothing about them.\\nMay overlap with Shrouded in Myth, where it's the exaggerated reputation or description that causes the disappointment. Can lead into a Warts and All plotline, where they can realize their expectations are wrongheaded.\\nIf someone is simply commenting mockingly on the height of another character with no reference to their reputation, see Acceptable Targets or The Napoleon.\\nSee also Beauty Equals Goodness, Mistaken Age, Recognition Failure, Badass on Paper.\\nNot to be confused with the Tom Holt comic fantasy novel, Expecting Someone Taller.\\n\\nExamples"
    },
    "name": "Expecting Someone Taller",
    "rdf_element": "ExpectingSomeoneTaller/int_21ff24b7",
    "short_name": "ExpectingSomeoneTaller",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ExpectingSomeoneTaller"
  },
  {
    "categories": [
      "VideogameItemsAndInventory"
    ],
    "descriptions": {
      "Willow": "Willow for the Nintendo Entertainment System has the magic ocarina which summons Po to fly you to any previously visited place.",
      "general": "A quick shortcut to enable rapid travel in an open-world setting. Most often, it allows travel between a set of fixed points, or to those points from anywhere in the game world. In a lot of games, these points are co-located with Save Points. In some cases, using the Warp Whistle is the only way to reach certain areas.\\nIn most cases, destinations become unlocked when the player visits them the old-fashioned way first. Why this happens sometimes is justified; when you get there, you do something like opening a portal or activating a teleport machine, allowing you to get back there easily. Sometimes, however, it's never explained why the traveling method only works if you have been there already. It's often necessary to gameplay, as if you could teleport to anywhere in the world from the beginning of the game, you could simply teleport to the villain's lair and there would be no need for all this quest.\\nThere is sometimes a monetary charge for the trip.\\nCompare and contrast Global Airship. While the Global Airship is awarded late in the game, it has wide-ranging freedom of movement. The Warp Whistle has very fixed destinations, more of which become unlocked in play, but it is generally available at an early point. A helpful comparison: The airship is a private helicopter, and the Warp Whistle is a subway pass.\\nIf the Warp Whistle is available as an item, it may be restricted to usage in \\\"overworld\\\" locations only (outdoor settings like towns or the world map), and fail to do anything if the player attempts to use it during Dungeon Crawling. Its in-dungeon counterpart would be the Escape Rope, whose function is limited to teleporting the player out of the dungeon in question (after which, the player may use the Warp Whistle).\\nOften overlaps with Point-and-Click Map, in that a Warp Whistle may call up such map (instead of showing a list of known locations) but is not always required to access it.\\nAlso see Sprint Shoes, Warp Zone, Portal Network, Mook Bouncer, Door to Before. Compare Fast-Forward Mechanic for skipping over time."
    },
    "name": "Warp Whistle",
    "rdf_element": "WarpWhistle/int_21ff24b7",
    "short_name": "WarpWhistle",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/WarpWhistle"
  },
  {
    "categories": [
      "SpeculativeFictionTropes"
    ],
    "descriptions": {
      "Willow": "In Willow, Nelwyns are derisively referred to as \\\"pecks.\\\"",
      "general": "In fiction, racism is sometimes dealt with through metaphor, such as humans treating sentient robots as second-class citizens, Elves vs. Dwarves, Fur Against Fang.\\nSo it's no surprise that many fantastic racists have a wide vocabulary of fictional slurs to use against robots, vampires, etc. It can be very Does This Remind You of Anything? at times.\\nWhen used against humans, Call a Human a \\\"Meatbag\\\" is very popular with robots, while Hairless Apes is widely used by all sorts of aliens, demons, and celestial beings.\\nWhen this happens during times of war or other armed conflict, see Nicknaming the Enemy.\\nCompare Pardon My Klingon.\\n\\nExamples"
    },
    "name": "Fantastic Slurs",
    "rdf_element": "FantasticSlurs/int_21ff24b7",
    "short_name": "FantasticSlurs",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/FantasticSlurs"
  },
  {
    "categories": [
      "SpeculativeFictionTropes"
    ],
    "descriptions": {
      "Willow": "In Willow, the title character defeats the evil Sorceress by using sleight of hand to pretend to have made The Chosen One disappear. Bavmorda is so used to true, actual magic that in her amazement she is Hoist By Her Own Petard.",
      "general": "Fiction generally features two distinct types of magic users:\\nCharacters of the first kind wear robes and pointy hats, have long white beards, and can perform impossible feats such as raising the dead, casting spells, and summoning fabulous creatures. We call these kinds of characters wizards or sorcerers (among other things), and they don't exist in Real Life (at least, not anymore) or at least, that's what we think. Characters of the second kind wear capes and top hats, usually perform their acts before a wide audience, (or a children's birthday party) and can perform simpler tricks like pulling rabbits out of their hats. We call these kinds of characters stage magicians, conjurers or illusionists, and they do exist in Real Life. Their magic is not real; they use misdirection, special effects and optical illusions to create the impression of magic.\\nSometimes, in fiction, the lines between realism and fantasy blur, and magicians really can perform feats of magic that would normally belong strictly in the wizards' territory. There are no smoke and mirrors here; the magic is all real, but the audience may not realize this, and think that the magician is relying on the same old sleights-of-hand. There may be subtle differences - their magic may come from a different source, and/or the two groups may operate at different Power Levels (perhaps magicians can perform spells based on manipulating people's perception, whereas wizards can outright modify reality). If there is rivalry between the two factions, it falls under Unequal Rites. If a legitimate wizard really does use his magic for a magic show, then it's a Mundane Utility. If he uses it only for his show, then it may be an example of Misapplied Phlebotinum.\\nIn other words, some Magicians Are Wizards. See also Magitek which in this case can be called \\\"Engineers are wizards\\\" because they make magical technology. If the wizard-magician hopes no one realizes that real wizards exist, his act is an example of Fiction as Cover-Up. When the Fourth Wall audience (you, the viewer or reader) isn't sure, it's a case of Maybe Magic, Maybe Mundane.\\nCompare Our Mages Are Different for differentiating kinds of mages (especially the first kind mentioned above). Contrast Magician Detective, where training in the art of deception have given magicians an ability to see the mundane solution when no-one else can. Subtrope of this is the Occult Detective. Contrast Impossibly Awesome Magic Trick, which is supposedly not true magic, yet is more spectacular than anything possible in real life."
    },
    "name": "Magicians Are Wizards",
    "rdf_element": "MagiciansAreWizards/int_21ff24b7",
    "short_name": "MagiciansAreWizards",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/MagiciansAreWizards"
  },
  {
    "categories": [
      "ThisIndexWillBeImportantLater"
    ],
    "descriptions": {
      "Willow": "In the beginning of Willow, the title character puts on a stage magic act during the festival, which concludes with a trick where he makes a pig disappear; unfortunately for him, he botches it, and the pig (which he actually transferred under the table using sleight of hand) runs away, resulting in everyone laughing at him). Later, at the climax of the story, when Willow faces Bavmorda alone as is completely outmatched, he still refuses to hand over Elora or deny that he's skilled in wizardry, telling the sorceress that he'll protect the child by sending her to \\\"a realm where evil cannot touch her\\\". What he actually does is perform the same stage trick again, but more dramatically and more competently, using Elora in place of the pig; it's so convincing that Bavmorda is fooled, and in her anger, spills the potion she was intending to use to slay the child, falling victim to it herself.",
      "general": "Whenever you prepare for a story you don't want any plot point to come across as an Ass Pull. But depending on the needs of the story you don't want to spend more time than necessary to establish a vital skill a character may possess that will prove useful, such as an establishing scene that will be used as a Chekhov's Skill.\\nThe solution? Establish the skill of the character through dialogue only. It isn't much, but it gets the job done in much the same way. Along the lines of fiction this inherently goes against the Show, Don't Tell mantra, but if done well it never comes across as an Informed Ability (after all, you do eventually see the evidence of their skill \\u2014 it's just delayed).\\nFor example, before going on the adventure the Plucky Comic Relief apologizes for being late because he had to help his sister who locked herself out of their car. Later, when everyone is detained and bound by shackles, this guy gets a hairpin from The Chick and manages to free himself and the others. It was mentioned he had the talent, but it isn't until now that we see him use it. If we actually saw him unlocking his sisters car then it would be a Chekhov's Skill.\\nCompare Suddenly Always Knew That when a character suddenly reveals that they had the skills as they are using it, instead of any sort of foreshadowing.\\nCompare Pastimes Prove Personality, Let's Get Dangerous.\\n\\nExamples"
    },
    "name": "Chekhov's Hobby",
    "rdf_element": "ChekhovsHobby/int_21ff24b7",
    "short_name": "ChekhovsHobby",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ChekhovsHobby"
  },
  {
    "categories": [],
    "descriptions": {
      "Willow": "Willow",
      "general": "The setting of the stereotypical High (or \\\"epic\\\") Fantasy, a collection of tropes, often boiled down from The Lord of the Rings, which has been the foundation for many a series of doorstoppers.\\nBasically, the Dark Lord, thought defeated millennia past, has returned to his Dark Tower in the Dark Land, gathering around him Dark Forces. The free lands have only one hope, a small band of lost heirs, princes, and simple village folk gathered together by a mysterious wandering wizard. However, it's not essential to stick so closely to the model.\\nMost core elements of high fantasy can be found in seminal literature from the 19th and early 20th century, but it was Tolkien that codified the genre.\\nOften flanderized as Medieval European Fantasy, though alternatives exist.\\nThe core elements of High Fantasy are:\\n Setting - A world other than ours. It may have a nominal connection with present day Earth, such as being our remote past or future, but this plays no role in the plot. Mythopoeia is often put into play to define the very metaphysics of the world. Nevertheless it often resembles medieval Europe, and is often peopled by People of Hair Color.\\n Scale - Epic. Power politics, wars, the death of nations, gods walking the earth, and the real threat of The End of the World as We Know It. This is what distinguishes High Fantasy from Heroic Fantasy.\\n Great evil - An enemy which is near enough Evil incarnate or fundamentally abhorrent\\n Methods - Victory is not achieved through force of arms, the main feature distinguishing High Fantasy from Heroic Fantasy. If Aragorn had killed Sauron in hand-to-hand combat, that would have been Heroic Fantasy. In short, a Supporting Leader or the Reluctant Hero will be offered up instead of the rough-hewn barbarian of, say, Conan the Barbarian or Beowulf.\\nOther common elements include:\\n Artifacts of Doom\\n Cool Horse\\n Cool Sword\\n Emerging from the Shadows\\n Functional Magic\\n Hobbits\\n Lost heirs to kings\\n The Chosen One\\n Medieval Stasis\\n Mordor\\n Prophecies\\n The Quest\\nThe boundary between High Fantasy and Low Fantasy is probably impossible to pin down, but the Deverry and Deryni series are near the borderline, and may straddle it. In both, the protagonists are involved in high-level power politics, with the fate of their nation in the balance, but Deverry has superhuman evils which the Deryni series lacks. Another borderline series would be the violent, low-magic A Song of Ice and Fire, which is on an epic scale, in a pseudo-medieval setting, with the looming menace of the Others, but lacks a Dark Lord (so far). The Discworld novels as a whole are another problematic case; they are generally considered Low Fantasy, but several of them tick all the boxes on the core elements noted above and epic-level plots (like Thief of Time) happen just as frequently as street-level ones (like The Truth).\\nNovels which are unambiguously Low Fantasy include Eisenstein's Sorcerer's Son, about a family quarrel among wizards devoid of wider implications, Barbara Hambly's Stranger at the Wedding, where the threat is confined to a single merchant family, and Maskerade, whose villain, a normal human, has no greater ambition than to run an opera house. Not to be confused with Demythtification, which is a myth or legend reimagined as Historical Fiction.\\nThe sci-fi version of High Fantasy is Space Opera, but not vice versa. The quintessential Space Opera doesn't necessarily include a Dark Lord equivalent, but if a Space Opera does, as with Star Wars or Vernor Vinge's A Fire Upon the Deep, it is High Fantasy in space.\\nContrast Heroic Fantasy, a.k.a. Sword and Sorcery.\\nHeroic or High Fantasy of Chinese cultural origin is known as Wuxia.\\nFor other \\\"epic\\\" genres, compare Sword And Sandals and Space Opera."
    },
    "name": "High Fantasy",
    "rdf_element": "HighFantasy/int_21ff24b7",
    "short_name": "HighFantasy",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/HighFantasy"
  },
  {
    "categories": [
      "DeathTropes"
    ],
    "descriptions": {
      "Willow": "In Willow, the village sorcerer gives Willow a pouch of magical acorns and says, \\\"Anything you throw them at, turns to stone.\\\" This turns out to be true.  However, at no point do they actually do Willow any good. He tries to use them in a fight with a troll, but he drops the acorn and instead of turning the troll to stone, it just petrifies the wooden plank it lands on. He actually manages to hit Queen Bavmorda, but it turns out that Bavmorda's magical kung fu is rather stronger than the village sorcerer's, and she shakes off the effect with ease.\\n One of the acorns did Willow some good in the novelization.  After rescuing Fin Raziel from the island; a monster which Bavmorda had summoned or created to guard the lake came after Willow and Raziel, and Willow threw an acorn down its throat.",
      "general": "A character has been petrified \\u2014 literally. Transformed into stone (or another inanimate substance) by someone else, the archetypal result is a perfectly sculpted gray (concrete?) statue, complete with matching gray clothes and accessories, frozen in whatever position they were in when the spell took effect, presumably for all time. Heed well, traveler: Should you ever stumble upon a cave filled with impeccably detailed life-size statues showing expressions of terror on their faces, be Genre Savvy and turn back now.\\nThe ability to transform someone in this manner is a fairly common Stock Superpower, especially if combined with an \\\"Evil Eye\\\". Definitely Older Than Feudalism, being fairly common in Classical Greek myth as well as Fairy Tales. If the victim isn't killed outright, he might be in some sort of stasis. At worst, he'll remain conscious while frozen in a form of locked-in paralysis, sometimes accompanied by inescapable pain or anguish. However, it's generally accepted that shattering the statue kills the person held within... hopefully.\\nMore likely to produce Tears from a Stone than most rock \\u2014 but still not very likely.\\nIt does not count if they transform and untransform on their own (unless they cannot move, such as in Dragon Tails and Super Mario Bros. 3). If the character can transform on their own and remain mobile, then this is an Elemental Shapeshifter.\\nBeing Taken for Granite happens a lot in children's media, because, unlike death, it is usually reversible thanks to No Ontological Inertia.\\nIf a villain knows that this effect can be potentially reversed, you can expect them to consider smashing the \\\"statue\\\" to ensure the person cannot be brought back.\\nThere is often an ambiguity as to whether the petrified person is completely turned to stone, or whether they are 'encased' in a thin layer of stone in a manner similar to Harmless Freezing. You can often see this when a character is only partially petrified - they will seem only to be encased in stone, and may break out. This is probably to avoid the obvious circulatory problems with having a completely petrified limb.\\nIn some works, petrification may also be used as a magical equivalent of Human Popsicle by simply turning a person into stone and wait after a certain amount of time has passed to unpetrify him or her. Your body can't physically age if it's turned to stone.\\nIf character is turned into flora rather than petranote\\u00A0a tree instead of a rock, it's a Transflormation. See Wax Museum Morgue for a similar trope when the monster (or whatever) that petrified the people decides to put them on display in a gallery. Compare Mistaken for Granite."
    },
    "name": "Taken for Granite",
    "rdf_element": "TakenForGranite/int_21ff24b7",
    "short_name": "TakenForGranite",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TakenForGranite"
  }
]