[
  {
    "description": "\"Raiders of the Lost Ark:\"@en .",
    "name": "CuttingTheKnot"
  },
  {
    "description": "\"A \\\"disco\\\" egg appears in pretty much every LEGO game in the series, with the music adjusted for the game's theme (a disco version of the Raiders of the Lost Ark theme in LEGO Indiana Jones, for example).\"@en .",
    "name": "EasterEgg"
  },
  {
    "description": "\"John Rhys Davies takes a break from Egyptian and Scottish characters to play Russian General Leonid Pushkin in The Living Daylights. He's actually Welsh. And not in fact a Dwarf.\"@en .",
    "name": "FakeRussian"
  },
  {
    "description": "\"When Indy leaves San Francisco in Raiders of the Lost Ark, his plane is shown flying over the Golden Gate Bridge. This is sometimes thought to be an anachronism because the film is set in 1936 and the Golden Gate Bridge didn't open until 1937. However, the bridge had been under construction since 1933 and we don't get a clear enough shot of the bridge to tell whether it's finished or not.\"@en .",
    "name": "EiffelTowerEffect"
  },
  {
    "description": "\"Inverted with Raiders of the Lost Ark, as the filmmakers had to add a wall of fire to slightly obscure Belloq in the scene where his head explodes. Otherwise, the film would've gotten an R rating.\"@en .",
    "name": "AvoidTheDreadedGRating"
  },
  {
    "description": "\"Raiders of the Lost Ark has the truck chase, and like most of the movie has gone on to be legend. And in a rare instance of a movie having two, the opening sequence with the giant stone ball serves a similar purpose.\"@en .",
    "name": "TheCenterpieceSpectacular"
  },
  {
    "description": "\"Also: there's the famous ending of the original Raiders of the Lost Ark, which heavily implies that the US government has a secret warehouse of mystical artifacts that other G-men like Indy acquired in previous secret missions. What artifacts are the government hiding? How did they obtain them? What are they planning to do with them?\"@en .",
    "name": "FanficFuel"
  },
  {
    "description": "\"In Raiders of the Lost Ark, the Staff of Ra must be placed in the Map Room at the right time of day in order for it to throw light upon the site of the Well of Souls.\"@en .",
    "name": "SundialWaypoint"
  },
  {
    "description": "\"In Raiders of the Lost Ark, Toht, the slimy Nazi agent, has one side of the head of the Staff of Ra burned into his hand.\"@en .",
    "name": "PowerPalms"
  },
  {
    "description": "\"In Raiders of the Lost Ark, when Indy and Marian are sealed in the Ark's chamber.\"@en .",
    "name": "SealedRoomInTheMiddleOfNowhere"
  },
  {
    "description": "\"In Raiders of the Lost Ark, as Indiana Jones is menacing to shoot a rocket at the Ark of the Covenant:\"@en .",
    "name": "IAmTheNoun"
  },
  {
    "description": "\"The scene from Raiders of the Lost Ark is parodied in American Dragon: Jake Long: as Jake, Trixie and Spud enter a cave, Spud activates a trap and a rock rolls toward them... Only to pass between Jake's legs. Then the rock activates the REAL trap, and that part of the cave start collapsing and burning.\"@en .",
    "name": "IndyEscape"
  },
  {
    "description": "\"At the beginning of Raiders of the Lost Ark the Hovitos Indians have Tribal Face Paint.\"@en .",
    "name": "TribalFacePaint"
  },
  {
    "description": "\"In Raiders of the Lost Ark Marion Ravenwood does it three times and Indy does it twice.\\n She takes out a mook with a burning log to the back of the head during the bar fight in Nepal.\\n In Cairo she's pursued into a building by a mook and knocks him out (off camera) with a frying pan.\\n While Indy is fighting the Nazis around the flying wing, she KO's the pilot with the plane's wheel chocks.\\n Indy knocks out two Nazi guards with the \\\"punch to the jaw\\\" technique to steal their uniforms so he can perform Dressing as the Enemy.\\n In the second of these, there are two clearly audible blows after Dr. Jones hauls the guard over the pile of boxes, so it's \\\"Taps\\\".\"@en .",
    "name": "TapOnTheHead"
  },
  {
    "description": "\"Doctor Ren\\u00E9 Belloq to Colonel Herman Dietrich in Raiders of the Lost Ark.\"@en .",
    "name": "DragonInChief"
  },
  {
    "description": "\"Some of the snakes in Raiders of the Lost Ark are recognizable harmless snakes of types people keep as pets, though there is at least one actual cobra (behind glass). There's also one \\\"snake\\\" being played by a Glass Lizard, which while legless isn't a true snake at all. And of course, some of them are clearly just sections of rubber hose.\"@en .",
    "name": "TerrifyingPetStoreRat"
  },
  {
    "description": "\"Raiders of the Lost Ark famously teases a swordfight when a Indy is faced with a scimitar-wielding baddie, only for Jones to whip out his gun and shoot him. Harrison Ford had dysentery the day of the shoot and did not want to perform the scripted sword fight scene.\"@en .",
    "name": "SwordFight"
  },
  {
    "description": "\"Raiders of the Lost Ark:\\n This is actually more of a subversion, because the Hovitos do in fact know that they are there, it's just that they are following the advice of evil Adventurer Archaeologist Rene Belloq, and waiting for Dr. Jones to retrieve their sacred idol from the Death Course protecting it before ambushing him.\"@en .",
    "name": "IfIWantedYouDead"
  },
  {
    "description": "\"In Raiders of the Lost Ark, whatever's inside the Ark of the Covenant will melt your face off if you look at it when the cover comes off.\"@en .",
    "name": "BrownNote"
  },
  {
    "description": "\"Raiders of the Lost Ark\\n Belloq speaks to the Hovitos in their native language, presumably telling them how great he is to have retrieved their holy object.\\n While Indy is trying to capture the flying wing, the huge guard calls out to the pilot in German.\\n After Indy sneaks into the secret Nazi island base he performs a Mugged for Disguise on a Nazi soldier for the purpose of Dressing as the Enemy. Before he's completely dressed a Nazi officer discovers him and starts criticizing him (in untranslated German) because he's out of uniform.\"@en .",
    "name": "RealityHasNoSubtitles"
  },
  {
    "description": "\"Another unspoken version of this occurs in Raiders of the Lost Ark. Right as the enemy swordsman is wrapping up his pre-fight flourish, Indy pulls a gun and just shoots him. The original script called for an extended sword/whip duel, but Harrison Ford was suffering horribly from dysentery, and so the scene was shortened to a joke.\"@en .",
    "name": "TalkToTheFist"
  },
  {
    "description": "\"The scene in Raiders of the Lost Ark with Indy threatening to blow up the Ark was filmed in the same canyon where R2-D2 was captured by Jawas in Star Wars: A New Hope. The canyon (which is located in Tunisia and is now known as \\\"Star Wars Canyon\\\") also appears in The English Patient.\"@en .",
    "name": "HeyItsThatPlace"
  },
  {
    "description": "\"Hilariously subverted in Raiders of the Lost Ark when creepy Nazi Arnold Toht takes out what looks like a three-part nunchuck only for it to turn out to be a collapsible hanger for his trench coat.\"@en .",
    "name": "FightingWithChucks"
  },
  {
    "description": "\"Raiders of the Lost Ark has Indy in a fight with a group of Major Toht's henchmen. Towards the end of this, he ends up wrestling one of them for a gun. Toht gives his other henchman the order to \\\"Shoot them. Shoot them both!\\\". This backfires, as it gives Indy and the Mook a common enemy to aim at.\"@en .",
    "name": "WeHaveReserves"
  },
  {
    "description": "\"Raiders of the Lost Ark the Wrath of God scene - Toht's face melts with the skin and blood evaporating off his face\"@en .",
    "name": "BloodyHorror"
  },
  {
    "description": "\"Gobler goes over a cliff in a car full of Nazi soldiers Raiders of the Lost Ark.\"@en .",
    "name": "DisneyVillainDeath"
  },
  {
    "description": "\"Raiders of the Lost Ark has a kookaburra in the South American Jungle\"@en .",
    "name": "NoisyNature"
  },
  {
    "description": "\"The infamous scene in Raiders of the Lost Ark where a swordsman does this to show off and Indy just shoots him.\"@en .",
    "name": "WeaponTwirling"
  },
  {
    "description": "\"In Raiders of the Lost Ark, Indy finds himself clambering all over a truck which he's trying to hijack, a process made difficult by the Nazi soldiers who are riding in the back. The Nazis then do it too.\\n There's also the submarine incident of questionable plausibility, in which Indy somehow rides a submarine across the Mediterranean..\\n Indy also clings to the front of a speeding mine cart in Temple of Doom, braking it with the sole of his boot.\"@en .",
    "name": "OutsideRide"
  },
  {
    "description": "\"Subverted in Raiders of the Lost Ark; Marion tries this on board the ship after leaving Egypt, but Indy falls asleep in mid-kiss. It's implied that he woke up later, though.\"@en .",
    "name": "GladToBeAliveSex"
  },
  {
    "description": "\"Raiders of the Lost Ark: Used for comic effect when confronted by a swordsman all clad in black, instead of being intimidated by his fancy swordplay Indy just rolls his eyes and shoots him dead. Never bring a sword to a gun fight.\"@en .",
    "name": "InstantDeathBullet"
  },
  {
    "description": "\"In Raiders of the Lost Ark, the crew that are hired to transport Indy, his Doggone Partner and the Ark pretend to be these to try and prevent the two of them being captured by Nazis (claiming they killed Indy and planned to sell her into slavery). Interestingly it fails, but not for the reasons you'd think.\\n Most likely not, cause the Nazis were such good guys, but cause the pirates have the wrong skin color.\"@en .",
    "name": "RuthlessModernPirates"
  },
  {
    "description": "\"Raiders of the Lost Ark ends with Indy together with Marion Ravenwood. This is followed by Indiana Jones and the Kingdom of the Crystal Skull, which begins with Indy and Marion having been separated for the intervening seventeen years.\"@en .",
    "name": "DowntimeDowngrade"
  },
  {
    "description": "\"An example of this happening in the middle of a story is in Raiders of the Lost Ark where Indiana Jones could be seen as clinging to the outside rail of a Nazi submarine, underwater the entire time, for a distance far enough to display a map. Not helped any by the next scene where he steals a uniform. Presumably it went along the surface when there wasn't any danger and/or Indiana hid inside at some point. U-boats stayed on the surface unless there was a reason to dive, either attacking a convoy or being attacked themselves. However, they did put men in the conning tower to watch, and there isn't exactly a lot of hiding space on a U-boat's deck.\"@en .",
    "name": "OffscreenInertia"
  },
  {
    "description": "\"For Raiders of the Lost Ark, footage of the airplane flying over Nepal was taken from the 1973 version of Lost Horizon and the Establishing Shot of 1930s Washington, DC was from The Hindenburg.\"@en .",
    "name": "StockFootage"
  },
  {
    "description": "\"Indiana Jones in Raiders of the Lost Ark is already an experienced and capable Adventurer Archaeologist who has survived the events we would later see in Temple of Doom.\"@en .",
    "name": "ExperiencedProtagonist"
  },
  {
    "description": "\"In Raiders of the Lost Ark, Indy is dragged under the truck. Of course, being Indy, he is barely scratched. For filming the scene, they dug a trench in the road and the driver had to be careful to keep it in the center of the truck and the stunt man had to be lucky. If you look closely, you can see the trench.\"@en .",
    "name": "WhatADrag"
  },
  {
    "description": "\"Raiders of the Lost Ark. Despite the occasional creepy scene, this is a fun action-adventure movie for the most part...that is, until the end, when the Nazis open the Ark of the Covenant. (Watch at your own risk.)\"@en .",
    "name": "SurpriseCreepy"
  },
  {
    "description": "\"Raiders of the Lost Ark: Harrison Ford is about to smack you with his bullwhip!\\u25CA\"@en .",
    "name": "SeanConneryIsAboutToShootYou"
  },
  {
    "description": "\"Happens to some unfortunate Nazis in the climax of Raiders of the Lost Ark: \\\"Whatever happens, KEEP YOUR EYES SHUT!\\\"\\n Used again in The Last Crusade when the villain drinks from the wrong grail.\"@en .",
    "name": "ImMelting"
  },
  {
    "description": "\"Carolina Jones And The Broken Covenant. Indy's daughter is up to some interesting shenanigans. It's basically Carolina trying to retrieve the Ark again... which has shrunk considerably. It's like a sequel to the first, but not, and with a ton of sex and shrieking. \\\"Indiana\\\" even makes an appearance at the end to save the day. Thankfully, he does not actually have sex with anyone.\\n Carolina Jones and the Temple of Poon.\"@en .",
    "name": "ParallelPornTitles"
  },
  {
    "description": "\"The scene in the original Raiders of the Lost Ark, where Indy shoots the giant, black-draped swordsman in the Cairo marketplace, was originally to have been a complex whip-and-sword duel. It was cut due to a general ailment among the cast and crew that day.\"@en .",
    "name": "RuleOfCool"
  },
  {
    "description": "\"Raiders of the Lost Ark: Our heroes are captured by the big bad and all seems lost. Then, Nazis meet Ark of the Covenant, Ark of the Covenant, meet Nazis. Also includes the villain destroying power of the Sankara Stones and the Holy Grail. One could wonder why Indy needs to do anything when the various artifacts of doom seem perfectly capable of taking care of themselves... then one would realize that the Nazis were all killed by a divine artifact belonging to what the Nazis most hated. You could say they got what was coming to them.\"@en .",
    "name": "GodIsGood"
  },
  {
    "description": "\"This argument in Raiders of the Lost Ark:\\n By Indiana Jones and the Kingdom of the Crystal Skull, they must have at some point.\"@en .",
    "name": "DidTheyOrDidntThey"
  },
  {
    "description": "\"Marion Ravenwood knocks out a mook from behind with a burning log during the bar fight near the beginning of Raiders of the Lost Ark just as he's about to shoot Indiana Jones.\\n She does this sort of thing again later during the fight on and around the Nazi plane. A German pilot is about to shoot Indy when he's hit over the back of the head, and we see Marion Ravenwood lifting some airplane wheel chocks triumphantly.\"@en .",
    "name": "ConvenientlyTimedAttackFromBehind"
  },
  {
    "description": "\"Raiders of the Lost Ark examples:\\n While teaching a class on archeology, Indiana Jones writes on a chalkboard and has difficulty spelling the word \\\"Neolithic\\\".\\n While talking to the Army Intelligence agents, he uses a chalkboard to draw the Staff of Ra and its headpiece.\"@en .",
    "name": "TheBigBoard"
  },
  {
    "description": "\"Occurs in Raiders of the Lost Ark.\"@en .",
    "name": "BinocularShot"
  },
  {
    "description": "\"The scene in Raiders of the Lost Ark where Indy just shot the bad guy would never have happened had Harrison Ford not been suffering from a nasty case of dysentery. The exact sequence of real-life events is disputed, but the scene as finally filmed replaced an elaborate \\\"whip vs. sword\\\" duel that Ford wasn't up to shooting.\\n According to the Making of Indiana Jones book, they did actually finish shooting the fight, but a test screening where the audience loved the shooting the swordsman bit convinced George Lucas to use it.\\n The Temple of Doom's darker tone was due to Lucas' and Spielberg's real-life breakups with their wives. Which explains having a bad guy who rips out people's hearts.\"@en .",
    "name": "RealitySubtext"
  },
  {
    "description": "\"Raiders of the Lost Ark: After Marian is captured by the Nazis, Belloq is very affectionate with her and even gives her a beautiful dress to wear.\"@en .",
    "name": "IHaveYouNowMyPretty"
  },
  {
    "description": "\"In Raiders of the Lost Ark, the Ark is apparently capable of generating an effect that jumps from person to person.\"@en .",
    "name": "ChainLightning"
  },
  {
    "description": "\"Raiders of the Lost Ark - after Indy stoically endures getting dragged behind a truck, shot in the shoulder, and generally beaten while retrieving the Ark, he and Marion are ensconced in the captain's quarters of a freight ship. As he achingly examines himself in a floor mirror, she pivots it from the other side, smacking him on the chin. Cut to long shot of ship and pained yell.\"@en .",
    "name": "TheScream"
  },
  {
    "description": "\"At one time, aircraft propellers were actually started by a man going up, grabbing a propeller blade, and shoving it down. Many observers were terrified of what might happen. (Compare with the Raiders of the Lost Ark scene.)\\n There is at least one instance of this happening to a dog during the early days of flight. An English pilot was preparing to do a Channel crossing, when a dog ran onto the tarmac and in front of the plane as the pilot was throttling up. There was not much left of the unfortunate pooch.\"@en .",
    "name": "HelicopterBlender"
  },
  {
    "description": "\"Raiders of the Lost Ark (even in the right accent):\"@en .",
    "name": "WeHaveWaysOfMakingYouTalk"
  },
  {
    "description": "\"In the opening sequence of Raiders of the Lost Ark, Indiana and Satipo run across several dessicated corpses inside the ancient shrine. Most memorable of all, Indy's old rival, Forrestal.\"@en .",
    "name": "ThisWayToCertainDeath"
  },
  {
    "description": "\"The Nazi-controlled island in Raiders of the Lost Ark. Submarine docks, and an area where you can perform Jewish rituals. Watch out for exploding heads.\"@en .",
    "name": "IslandBase"
  },
  {
    "description": "\"Raiders of the Lost Ark: Marion does this to Toht. Bad idea.\"@en .",
    "name": "SecondFaceSmoke"
  },
  {
    "description": "\"Raiders of the Lost Ark invokes the trope twice; first Indy drowns his sorrows when he thinks Marion was blown up by the Nazis, then Belloq thinks he's drowning his sorrows with Marion, but as we already know, she's drinking him under the table trying to escape.\"@en .",
    "name": "DrowningMySorrows"
  },
  {
    "description": "\"Marion's bar in Raiders of the Lost Ark, the great big rope bridge in Temple of Doom and the Grail Temple in The Last Crusade. And the temple blowing apart in Indiana Jones and the Kingdom of the Crystal Skull,  when the aliens take off.\"@en .",
    "name": "ItsGoingDown"
  },
  {
    "description": "\"Raiders of the Lost Ark has a white specter appear near the ending.\"@en .",
    "name": "MonochromeApparition"
  },
  {
    "description": "\"In Raiders of the Lost Ark, a drunk and defenseless Marion and Belloq are cornered in a tent by Toht, who menacingly takes out a long, chained object...which folds into a coat hanger.\"@en .",
    "name": "NotSoDire"
  },
  {
    "description": "\"In Raiders of the Lost Ark, just before Indy enters the temple at the beginning, one of his \\\"partners\\\" (Barranca) pulls a gun. The sound of him cocking the revolver tips Indy off that he's about to get shot in the back. Cue the bullwhip...\\n Justified in that the revolver is single-action and has to be cocked each time it's fired.\"@en .",
    "name": "DramaticGunCock"
  },
  {
    "description": "\"In the climactic scene of Raiders of the Lost Ark, Indiana and temporary love interest Marion are tied to a stake in the middle of things as the Nazis are about to open the Ark of the Covenant. Indy tells Marion not to look at whatever power or entity comes out - sound advice, as it turns out, as nasty, Nightmare Fuelish things happen to the Nazis, including one guy getting his face melted off.\"@en .",
    "name": "PerilousPowerSource"
  },
  {
    "description": "\"Raiders of the Lost Ark has one created by The Ark of the Covenant.\"@en .",
    "name": "PillarOfLight"
  },
  {
    "description": "\"First was Belloq in Raiders of the Lost Ark, then Walter Donovan in Indiana Jones and the Last Crusade.\"@en .",
    "name": "PiggybackingOnHitler"
  },
  {
    "description": "\"Raiders of the Lost Ark has a comedic example on the ship out of Egypt. Marion rotates a mirror \\u2014 banging Indy in the face. Hard. Cut to a shot of the ship from the outside with Indy's scream audible.\"@en .",
    "name": "ScreamDiscretionShot"
  },
  {
    "description": "\"A similar tale is told of dealing with the monkey in Raiders of the Lost Ark, which took a violent dislike to the actor playing its best buddy in the movie.\"@en .",
    "name": "AllAnimalsAreDomesticated"
  },
  {
    "description": "\"The Hovitos underground temple from Raiders of the Lost Ark.\"@en .",
    "name": "Mayincatec"
  },
  {
    "description": "\"In Raiders of the Lost Ark, Paul Freeman played Indy's Evil Counterpart Rene Belloq, a corrupt French archaeologist. In the prequel series Young Indiana Jones, Paul Freeman has a guest role in \\\"The Phantom Train of Doom\\\" as Captain Frederick Selous, a historical English army officer and big game hunter who fought in German East Africa in World War I.\"@en .",
    "name": "YouLookFamiliar"
  },
  {
    "description": "\"Raiders of the Lost Ark: After he has seen Indy buried alive in the Well of Souls, Belloq looks around at the burning airfield and destroyed plane.\"@en .",
    "name": "FollowTheChaos"
  },
  {
    "description": "\"Inverted in Raiders of the Lost Ark, with Indy being the one holding the gun (or in this case, the RPG launcher), and Belloq calling his bluff to blow up the Ark of the Covenant (with the Nazis present strongly objecting).\"@en .",
    "name": "PutDownYourGunAndStepAway"
  },
  {
    "description": "\"Happens by accident during the scene with the flying wing in Raiders of the Lost Ark due to a series of minor \\\"oops\\\"es. Indy unchocks the wheel of the flying wing to use the chocks as a weapon against a Giant Mook, and the plane starts to turn in place and its wingtip punctures a fuel truck. Next, Marion uses the plane's machine gun turret to keep Nazi reinforcements at bay and stuff catches fire. The fuel pouring out of the truck eventually reaches the blaze, Indy rescues Marion and they run for cover, and then the whole airstrip explodes.\"@en .",
    "name": "VaporTrail"
  },
  {
    "description": "\"In Raiders of the Lost Ark, a flock of birds emerges from the mouth of a statue in the jungle, scaring one of Indy's porters.\"@en .",
    "name": "BatScare"
  },
  {
    "description": "\"Toht of Raiders of the Lost Ark wears his longcoat like this while digging for the Ark in Egypt.\"@en .",
    "name": "CoatCape"
  },
  {
    "description": "\"Raiders of the Lost Ark: ...A mountain in the film via a dissolve.\"@en .",
    "name": "LogoJoke"
  },
  {
    "description": "\"In a famous scene from Raiders of the Lost Ark, Indiana Jones is confronted by a formidable sword wielder. He just shoots him.\\n Allegedly a hasty rewrite. An epic Sword Fight was planned but Harrison Ford had a minor back injury when it was due to be filmed. Comedy and pragmatism took the day.\\n Another version has Ford suffering from diarrhea that day.\"@en .",
    "name": "GunsVsSwords"
  },
  {
    "description": "\"Going back a few years, you have \\\"Free Hat\\\" (Raiders of the Lost Ark) and \\\"The Return of The Fellowship of the Ring to the Two Towers\\\" (The Lord of the Rings).\"@en .",
    "name": "ParodyEpisode"
  },
  {
    "description": "\"In Raiders of the Lost Ark, Indy offers to let the Nazis keep the Ark in exchange for Marion, threatening to destroy the Ark if they don't comply. Belloq calls his bluff (as an archeologist, Indy can't bring himself to destroy the Ark, even to keep it out of the Nazis' hands) and Indy gets captured.\"@en .",
    "name": "AlwaysSaveTheGirl"
  },
  {
    "description": "\"In Raiders of the Lost Ark, Indy gets stopped by a sergeant and told off for having an ill-fitting guard outfit. Indy, being Indy, gets a much better fitting uniform from the sergeant. What makes it especially funny is that this is itself a subversion of a trope \\u2014 Indy's first uniform didn't fit because he got it from a random guy and there's no reason a random guy would be the same size as the hero, decades of film to the contrary.\"@en .",
    "name": "HeyWait"
  },
  {
    "description": "\"On the other hand, the Hong Kong translations follow Raiders of the Lost Ark (\\u596A\\u5BF6\\u5947\\u5175). Toy Story is \\u53CD\\u6597\\u5947\\u5175, Finding Nemo is \\u6D77\\u5E95\\u5947\\u5175, while Cars becomes \\u53CD\\u6597\\u8ECA\\u738B.\"@en .",
    "name": "TranslationMatchmaking"
  },
  {
    "description": "\"Toht in Raiders of the Lost Ark is the torture master. His name is probably a play on the German words \\\"Tod\\\" (death) or \\\"tot\\\" (dead).\\n Dr Elsa Schneider in Indiana Jones and the Last Crusade fills some part of the Noble Scientist role but more likely \\u2014 she is The Baroness. See also Blondes Are Evil and Evil Is Sexy.\"@en .",
    "name": "ThoseWackyNazis"
  },
  {
    "description": "\"South American in Raiders of the Lost Ark.\"@en .",
    "name": "FakeNationality"
  },
  {
    "description": "\"Raiders of the Lost Ark. Ancient South American Indians develop a trap with a trigger that uses a beam of sunlight as an electric eye: when anything interrupts the beam, the trap activates. Question: does the trap work when the light isn't shining through at that exact spot, which would be, I don't know, most of the day and all night?\"@en .",
    "name": "BambooTechnology"
  },
  {
    "description": "\"Toht (the bespectacled Nazi) from Raiders of the Lost Ark is usually smirking and speaks with a halting, breathy delivery as if he's on the verge of chuckling.\"@en .",
    "name": "SoftspokenSadist"
  },
  {
    "description": "\"The very end of Raiders of the Lost Ark has a famous matte shot. When we see the overhead shot of a worker moving down a narrow warehouse aisle, all those sprawling stacks of crates are created as a painting.\\n A more interesting matte shot is the PanAmerican seaplane; the plane, which was not seaworthy (it was, in fact, still being restored) was composited into shots of a loading dock built on the ILM grounds and shots of San Francisco Bay (for the water). The matte was even painted to touch up unrestored areas of the plane and put the PanAm logo on!\"@en .",
    "name": "MatteShot"
  },
  {
    "description": "\"If you'll believe it, a group of teenagers did a shot-for-shot remake of Raiders of the Lost Ark in the 80s. It's really awesome.\"@en .",
    "name": "TheRemake"
  },
  {
    "description": "\"Not to mention the fact that when they meet in the first movie, they've already had a past relationship,  making \\\"Kingdom\\\" the third and final(?) time they hook up!\\\"\"@en .",
    "name": "GirlOfTheWeek"
  },
  {
    "description": "\"How Marion Ravenwood defends herself when Nazis invade her bar in Raiders of the Lost Ark.\"@en .",
    "name": "BoozeFlamethrower"
  },
  {
    "description": "\"The famous scene in Raiders of the Lost Ark where Indy summarily shoots a sword-waving assailant was originally supposed to be a show-offy sword vs. whip duel - but Harrison Ford and most of the crew were weakened from food poisoning so he suggested that he \\\"just shoot the sucker\\\" and Steven Spielberg decided to Throw It In. Interesting as it became an in-joke in the films; in the prequel, he goes to do the same thing... only to find his gun's not there. Cue hilarity. In the third one he pulls it out to try to shoot a plane... but it's out of bullets. So his father comes up with a creative solution involving an umbrella and a flock of seagulls.\"@en .",
    "name": "WrittenInInfirmity"
  },
  {
    "description": "\"Raiders of the Lost Ark  in the Wrath of God scene Belloq's head explodes\"@en .",
    "name": "YourHeadASplode"
  },
  {
    "description": "\"In Raiders of the Lost Ark, the villains are killed when they open the Ark. In Temple of Doom, Mola Ram dies when he tries to catch the stone and his hand is burned, then eaten by crocodiles. (And he had just displayed a bit of Genre Savvy by pointing out to Indiana that if he dropped the stones, they could simply be found again \\u2014 why did he bother trying to grab them as they fall when he was now in actual danger himself?) The Indiana Jones movies ARE this trope.\"@en .",
    "name": "DeathByMaterialism"
  },
  {
    "description": "\"Raiders of the Lost Ark: Marion Ravenwood. She can even drink men twice her size under the table.\"@en .",
    "name": "TheLadette"
  },
  {
    "description": "\"Major Arnold Toht in Raiders of the Lost Ark.\"@en .",
    "name": "AllThereInTheScript"
  },
  {
    "description": "\"Raiders of the Lost Ark: Belloq convinces his captive Marion to put on a fancy dress that he just happens to have with him.\"@en .",
    "name": "GoGoEnslavement"
  },
  {
    "description": "\"Raiders of the Lost Ark (Raider's March)\"@en .",
    "name": "March"
  },
  {
    "description": "\"In Raiders of the Lost Ark, Toht bursts out laughing when the Nazis open the Ark of the Covenant and there's nothing in it but sand. Seconds later, he's screaming because murderous angels have come out of the ark and are killing everyone there.\"@en .",
    "name": "CryLaughing"
  },
  {
    "description": "\"In Raiders of the Lost Ark, during the battle in the streets of Cairo, Marion takes out an assailant with a handy frying pan. It's such a memorable moment that the Marion action figure in the new line comes with a frying pan. The stunt show at Disney's Hollywood Studios features this as well, with Marion using a frying pan on the roof of a building to knock back a mook on a ladder, though her backswing hits Indy as well.\"@en .",
    "name": "FryingPanOfDoom"
  },
  {
    "description": "\"Raiders of the Lost Ark fell victim to this in Germany. When the original German dub was created in 1981, they for some reason screwed up and created a really bad Dolby Stereo mix and managed to lose the original German speech tapes. Due to the bad production of the mix, it proved impossible to separate the speech from it to create a new 5.1 mix (as done with Star Wars) and they were forced to create a new dub in 2009 when the movie went HD, where apart from the voice of Indiana Jones, all voices were new. The old dub is well-loved and the new one caused enormous bad blood, so bad indeed that Paramount decided right away when creating the Blu-Ray that both dubs should be available on it. Thankfully, the sequels had much higher production quality in the dubs and they were spared this fate as a re-mix was trivial (access to 6-channel magnetic sound made it easy).\\n The exact same thing happened in Italy too, except that the Italian redub changes Indiana's voice too... weird thing, since the original voice actor was still available (and came back on the character for Indiana Jones and the Kingdom of the Crystal Skull too).\"@en .",
    "name": "DuelingDubs"
  },
  {
    "description": "\"In Raiders of the Lost Ark, as Indy and Satipo are exploring the South American temple, Satipo's back becomes covered with tarantulas, which Indy brushes off. Tarantulas are usually solitary.\"@en .",
    "name": "SpiderSwarm"
  },
  {
    "description": "\"In Raiders of the Lost Ark, Indy encounters a very large German (called \\\"the Nazi mechanic\\\" by most movie buffs) who wants to do some Good Old Fisticuffs with him. Indy opens with a Groin Attack, which is subverted rather painfully when the guy shrugs it off and decks him with one punch. He's finally defeated by judicious use of a Turbine Blender.\"@en .",
    "name": "BossInMookClothing"
  },
  {
    "description": "\"Raiders of the Lost Ark. Toht, even when Dr. Jones threatens to destroy the Ark with a panzerfaust (the German army's bazooka equivalent).\"@en .",
    "name": "SlasherSmile"
  },
  {
    "description": "\"Raiders of the Lost Ark: Belloq, a French archaeologist working for the Nazis. He deserved having his head asplode.\"@en .",
    "name": "FrenchJerk"
  },
  {
    "description": "\"In Raiders of the Lost Ark, the famous scene where Indy shoots the swordsman. As the story goes, there was to be an extended sword fight, but Harrison Ford (playing Indy) was sick with dysentery, and suggested that he just shoot the swordsman. They decided to go with it.\\n Indiana Jones and the Temple of Doom has a Shout-Out to this scene in which Indy is confronted by two swordsmen. He reaches for his gun...only to find an empty holster, as he'd forgotten that his pistol was confiscated earlier in the movie.\"@en .",
    "name": "NeverBringAKnifeToAGunFight"
  },
  {
    "description": "\"Raiders of the Lost Ark\\n By the Nazi agent Toht on the captive heroine. Marion is willing to confess when she sees the instruments, but Toht wants to torture her anyway.\\n Later wryly subverted when Toht has Marion at his mercy again. He whips out an ominous-looking assemblage of rods and chains, she gasps in shock...and he snaps it together to form a coat-hanger, drapes his leather greatcoat on it, and asks her with a polite smile what she knows.\"@en .",
    "name": "ColdBloodedTorture"
  },
  {
    "description": "\"Raiders of the Lost Ark. Indy throws sand in the eyes of the Giant Mook German mechanic during the flying wing fight.\"@en .",
    "name": "AHandfulForAnEye"
  },
  {
    "description": "\"When the Boggart turns into a giant snake in Prisoner of Azkaban, John Williams quotes the snake theme from Raiders of the Lost Ark.\"@en .",
    "name": "RecycledSoundtrack"
  },
  {
    "description": "\"Raiders of the Lost Ark first plays with this trope and then subverts it in the last scene. After performing the invocation ritual, Belloq opens the Ark and finds it to be just a box full of sand. Toht walks away laughing... and then God's fury comes out of it unleashed.\"@en .",
    "name": "MockGuffin"
  },
  {
    "description": "\"There's a blink-and-you'll-miss-it moment in Raiders of the Lost Ark: If you look closely as they disembark from the submarine you'll notice that the Nazi soldier guarding Marian is heavily bandaged and he has an arm in a sling.\\n Another Indiana Jones example in Temple Of Doom. While on the mine cart chase, a mook manages to down Indiana for a few seconds. Sick to death of being chased, Willie promptly slugs him so hard he goes flying off the cart.\\n Subverted in another portion, where Willie grabs a large constrictor snake and flings it away into the brush, thinking it's the trunk of the elephant that's been irritating her all evening.\"@en .",
    "name": "BadassDamsel"
  },
  {
    "description": "\"After the release of Quest for Glory III: Wages of War, Sierra's legal team found out that another videogame company had already trademarked the title \\\"Wages of War.\\\" So Sierra made plans to reissue the game as Seekers of the Lost City (a nod to Raiders of the Lost Ark). Before the re-release was completed, though, the company that had trademarked Wages of War closed its doors. While QFG3 was never released with the new name, the QFG4 in-game documentation uses the revised QFG3 title in its descriptions of the prior installments (though the CD version refers to it properly).\"@en .",
    "name": "WritingAroundTrademarks"
  },
  {
    "description": "\"Raiders of the Lost Ark (an action-adventure film) and Scanners (a horror film) were both released in 1981, both feature Body Horror in the form of faces getting melted and/or heads exploding, and both received the 'FSK 16' rating in Germany. However, in the UK and Australia the former is rated 'PG' whilst the latter is rated '18'.\"@en .",
    "name": "SameContentDifferentRating"
  },
  {
    "description": "\"In Raiders of the Lost Ark an Arab working for the Nazis pours poison on dates in Sallah's house in the hope that Sallah and/or Indy will eat them. (The monkey steals the poisoned dates instead.)\"@en .",
    "name": "TamperingWithFoodAndDrink"
  },
  {
    "description": "\"Happens twice in Raiders of the Lost Ark. Near the beginning, Indy's companion in the underground area carries a torch. Later, while Indy and Marion are in the Well of Souls they have a bunch of torches. A minor aversion occurs when Indy's and Marion's torches burn out.\"@en .",
    "name": "HollywoodTorches"
  },
  {
    "description": "\"Raiders of the Lost Ark. While exploring the underground temple, Indy uses them to his guide Satipo when he sees that his back is covered with tarantulas. He signals to Satipo to \\\"Come here\\\" and \\\"Turn around\\\" so Indy can brush them off.\"@en .",
    "name": "HandSignals"
  },
  {
    "description": "\"Steven Spielberg rented the exterior set for Raiders of the Lost Ark; someone forgot to tell the German production crew, leading to a bit of panic when they found it was missing.\"@en .",
    "name": "PropRecycling"
  },
  {
    "description": "\"Raiders of the Lost Ark\\n The monkey looks like another Capuchin. At least the monkey was a pet, and not necessarily native.\\n The big, hairy spiders that climb all over Jones and his guide are Mexican red-kneed tarantulas, native to deserts and scrublands, not rainforests.\\n The boa constrictor that falls on Marian, even though constrictors aren't found in the arid regions of Egypt.\\n In the scene with the tomb full of snakes, one reptile that's visible is not only not Egyptian, but not a snake. It's a European glass lizard.\\n Indy is treated to the threat display of a beautiful... Indian Cobra. note\\u00A0Also known as Monocled Cobra, and one eyeglass away from the Egyptian Cobra or asp, whose markings resemble a pince-nez.\"@en .",
    "name": "MisplacedWildlife"
  },
  {
    "description": "\"The entire climax of Raiders of the Lost Ark is a massive Deadly Fireworks Massacre.\"@en .",
    "name": "DeadlyFireworksDisplay"
  },
  {
    "description": "\"In Raiders of the Lost Ark, Indy hijacks the truck carrying the Ark of the Covenant from horseback, then uses it to bust up the rest of the convoy.\"@en .",
    "name": "HighSpeedHijack"
  },
  {
    "description": "\"Rene Belloq from Raiders of the Lost Ark, the Evil Counterpart to Indiana Jones, is probably the closest thing he has to this.\"@en .",
    "name": "ArchEnemy"
  },
  {
    "description": "\"Used in Raiders of the Lost Ark, in which the guide at the beginning runs away with the treasure.\"@en .",
    "name": "EvilAllAlong"
  },
  {
    "description": "\"A much nicer version appears in Raiders of the Lost Ark:\\n Parodied in the Mad Magazine spoof, where Indy is beating up the truck full of German soldiers:\"@en .",
    "name": "AndThisIsFor"
  },
  {
    "description": "\"The Hovitos in Raiders of the Lost Ark were manipulated by Belloq into believing that Indiana was stealing their fertility idol and that Belloq simply wanted to protect it for them. They stopped Indiana from escaping with the idol and then attempted to kill him, during which time Belloq made off with the idol.\"@en .",
    "name": "UnwittingPawn"
  },
  {
    "description": "\"The head-peace of the Staff of Rah in Raiders of the Lost Ark.\"@en .",
    "name": "AudibleGleam"
  },
  {
    "description": "\"The plot-driver in Raiders of the Lost Ark is that the Ark of the Covenant is some sort of magical weapon, and would make its owner invincible. In fact, one instance in 1 Samuel where the Israelites tried to use it as a weapon merely caused the Ark to get very angry at their disrespect and let them lose the battle. Given the Ark simply wiped out the Nazis who opened it, though, perhaps the part of retaliating against its owners was indeed noted.\\n The \\\"Holy Grail as granter of eternal life\\\" plot of the third movie is not based on the Bible or later Christian tradition either. The writers came with it after toying with the idea of having Indy retrieve the Holy Grail in the Action Prologue, then go to look for some version of the Fountain of Youth in the movie proper. Somebody suggested to mix the two, and the rest is (movie) history.\"@en .",
    "name": "SadlyMythtaken"
  },
  {
    "description": "\"Raiders of the Lost Ark. At the beginning of the movie Indiana is leading an archaeological expedition in the Peruvian jungle. They find a dart and one of the bearers, Satipo, tastes the tip and determines how close the local indigenous tribe is.\"@en .",
    "name": "FreshClue"
  },
  {
    "description": "\"Major Gobler in Raiders of the Lost Ark, to Colonel Dietrich. He carries out a variety of menial duties and later shows some hands-on initiative by driving the escort car during the truck chase himself, rather than being chauffeured like Dietrich and Belloq.\"@en .",
    "name": "MookLieutenant"
  },
  {
    "description": "\"Raiders of the Lost Ark: When the tramp steamer captain is trying to bluff the Nazis into thinking he killed Indiana Jones in order to get Marion, he takes a lock of her hair and sniffs it.\"@en .",
    "name": "PervertedSniffing"
  },
  {
    "description": "\"In Raiders of the Lost Ark, Marion Ravenwood's back in seen in the mirror by Belloq and it is lampshaded on the journey to the U-Boat pen.\"@en .",
    "name": "ToplessnessFromTheBack"
  },
  {
    "description": "\"Raiders of the Lost Ark: Indy and Marion are trapped in a tomb of poisonous snakes, and their torches are running out.\"@en .",
    "name": "TentativeLight"
  },
  {
    "description": "\"Raiders of the Lost Ark (1981).\"@en .",
    "name": "AnythingButThat"
  },
  {
    "description": "\"Interestingly, at least in Raiders of the Lost Ark, the common grunt soldiers were shown as simply Punchclock Villains, with Indy sharing a smile with one - right before punching his lights out - and even engaging in an honorable one-on-one duel.\\n They were still Punchclocks in The Last Crusade. It's just that the Big Bad used locals (that he hired of course), so for the most part you didn't see it as much.\"@en .",
    "name": "VillainByDefault"
  },
  {
    "description": "\"In Raiders of the Lost Ark Marian Ravenwood actually made money by beating the rowdy Tibetians at her bar in drinking contests. (Which she was doing when Indy came in, and she still seemed sober enough after that to deal with him.)\"@en .",
    "name": "NeverGetsDrunk"
  },
  {
    "description": "\"Marian Ravenwood from Raiders of the Lost Ark, consistently winning drinking contests with rowdy Tibetans. Though the story implies (and the novelization confirmed) that she's primarily interested in the money she makes winning drinking contests.\"@en .",
    "name": "HardDrinkingPartyGirl"
  },
  {
    "description": "\"There's a cursed jewel on during the Raiders of the Lost Ark scene on The Great Movie Ride at Disney's Hollywood Studios. A bandit or gangster (depending on the ride) will attempt to steal it, which results in them getting roasted into a skeleton.\"@en .",
    "name": "ArtifactOfDeath"
  },
  {
    "description": "\"Raiders of the Lost Ark. The first reveal of Indy.\"@en .",
    "name": "DeathGlare"
  },
  {
    "description": "\"He does this in Raiders of the Lost Ark against a gigantic Nazi bruiser. How he finishes the fight is disturbing.\"@en .",
    "name": "PunchPunchPunchUhOh"
  },
  {
    "description": "\"Raiders of the Lost Ark: Belloq and his Nazi cohort opened the Ark of the Covenant themselves and its powers then disintegrated them a very painful manner.\"@en .",
    "name": "SelfDisposingVillain"
  },
  {
    "description": "\"Near the end of Raiders of the Lost Ark, vile Nazi toad Toht and all-American hero Indiana Jones both find humor in the fact that the Ark which so many people have fought and died over appears to be filled with nothing but sand.\"@en .",
    "name": "ActuallyPrettyFunny"
  },
  {
    "description": "\"Similarly, the video/DVD releases of Raiders of the Lost Ark retroactively retitled it \\\"Indiana Jones and the Raiders of the Lost Ark\\\" on their packaging, in line with the titles of the sequels. The title at the start on the movie was left unchanged though.\"@en .",
    "name": "Retronym"
  },
  {
    "description": "\"The now-iconic \\\"rolling boulder\\\" sequence at the beginning of Raiders of the Lost Ark was, according to George Lucas, an homage to a similar scene in the Carl Barks comic book The Seven Cities of Cibola.\"@en .",
    "name": "Homage"
  },
  {
    "description": "\"Raiders of the Lost Ark and Indiana Jones and the Kingdom of the Crystal Skull qualify. Indiana Jones and the Last Crusade was originally going to be Indiana Jones and the Holy Grail, but director Steven Spielberg thought it sounded too much like Monty Python and the Holy Grail\"@en .",
    "name": "MacGuffinTitle"
  },
  {
    "description": "\"Raiders of the Lost Ark: Marion Ravenwood drinks the large man under the table during a drinking competition at her bar, and is subsequently confronted by Nazis looking for an amulet her father owned. Even though her drunkenness was an act to turn the betting odds, she shows no sign that she'd just downed what had to be more than a dozen shots of hard liquor.\"@en .",
    "name": "SuddenlySober"
  },
  {
    "description": "\"Raiders of the Lost Ark was later renamed to Indiana Jones and the Raiders Of The Lost Ark.\"@en .",
    "name": "FranchiseDrivenRetitling"
  },
  {
    "description": "\"After Marion is kidnapped in Raiders of the Lost Ark, Belloq, tries to be civil, bringing her a nice dress and then talking to her over wine; unfortunately, the far less civil Toht comes in and breaks this up.\"@en .",
    "name": "CaptiveDate"
  },
  {
    "description": "\"Raiders of the Lost Ark features a scene at the beginning where Indiana Jones, rushing to escape a Collapsing Lair, runs straight into his traitorous \\u2014 and now karmically impaled \\u2014 former guide, Satipo, who forgot about the trap they discovered moments earlier. But this scene had nothing on the most pants-voidingly traumatic Peek-A-Boo Corpse gangbang ever filmed \\u2014 the scene where Marion attempts to escape from a crumbling Egyptian tomb only to find herself being MASS ATTACKED BY A MOB OF HORRIBLE ROTTING MUMMIES WITH SNAKES CRAWLING OUT OF THEIR FACES OH GOD SPIELBERG AND GEORGE LUCAS I HATE YOU (Ahem. Didn't mean to yell there. But it's a testament to the effectiveness of that scene that it can still conjure up such revulsion and ire after 20+ odd years...)\"@en .",
    "name": "PeekABooCorpse"
  },
  {
    "description": "\"Belloq in the last few minutes of Raiders of the Lost Ark is clearly seen to have a fly crawling across his face and into his mouth.\"@en .",
    "name": "SwallowedAFly"
  },
  {
    "description": "\"The Ark of the Covenant in Raiders of the Lost Ark is a Grade A Lost Superweapon.\"@en .",
    "name": "LostSuperweapon"
  },
  {
    "description": "\"Raiders of the Lost Ark. Indy shoots out the lock on the plane's cockpit so Marion can escape.\"@en .",
    "name": "ShootOutTheLock"
  },
  {
    "description": "\"The famous \\\"Well, dammit, Indy, where doesn't it hurt?!\\\" scene in Raiders of the Lost Ark\"@en .",
    "name": "AfterActionPatchup"
  },
  {
    "description": "\"The Ark theme from Raiders of the Lost Ark.\"@en .",
    "name": "EtherealChoir"
  },
  {
    "description": "\"A variant occurs in Raiders of the Lost Ark. Indy threatens to shoot the Ark of the Covenant with a panzerfaust if the Nazis don't release Marion. Belloq refuses, taunts Indy to blow it up, and points out how Indy can't do it because of the Ark's archaeological value. Indy thinks about it, realizes Belloq is right, and gives up.\\n To prove his point, Belloq even helps Indy by holding the German soldiers at gunpoint with a submachine gun when they try to shoot Indy or get in the way of Indy's line of fire.\"@en .",
    "name": "YouWouldntShootMe"
  },
  {
    "description": "\"Subverted in Raiders of the Lost Ark, where Indy has to push his way through a Mobstacle Course to get to the truck where the Action Girl is supposedly being held hostage.\"@en .",
    "name": "ExcuseMeComingThrough"
  },
  {
    "description": "\"Raiders of the Lost Ark. The running battle between Indiana and the Nazi convoy that's trying to get the Ark to Cairo. Indiana chases after it on a horse, eventually boards the truck and fights everyone involved.\"@en .",
    "name": "ChaseFight"
  },
  {
    "description": "\"Raiders of the Lost Ark (1981) features a chase scene at the market in Cairo, involving fruit carts and many other stalls.\"@en .",
    "name": "FruitCart"
  },
  {
    "description": "\"Raiders of the Lost Ark is granted the suspension for toughness. The tough heroine Marion Ravenwood smokes during her meeting with Todt in her saloon, and blows smoke in his face and makes him cough. Watch it on YouTube here, starting around 4:40.\"@en .",
    "name": "GoodSmokingEvilSmoking"
  },
  {
    "description": "\"Used for a throwaway joke in Raiders of the Lost Ark. One of Indy's female students has penned \\\"LOVE YOU\\\" on her eyelids so that they're visible when she oh-so-fetchingly bats her eyelashes at him. Indy loses his train of thought in mid-lecture and is visibly unsettled.\\n There's also a less lighthearted treatment of it in the film. Marion was the daughter of one of Indy's mentors, and had such a crush on him, which apparently led to the two becoming involved. The fallout from that resulted in the destruction of Indy's relationship with Marion's father and quite a fair bit of bitterness on Marion's part, hence why when Marion sees Indy one of the first things she does is hit him and scream \\\"I was a child! I was in love! It was wrong and you knew it!\\\" Word of God is that she was definitely underage at the time.\"@en .",
    "name": "PrecociousCrush"
  },
  {
    "description": "\"Raiders of the Lost Ark: The Giant Mook German mechanic winds up in the spinning propeller of an airplane, but we just see blood sprayed onto the plane's rudder.\"@en .",
    "name": "GoryDiscretionShot"
  },
  {
    "description": "\"Raiders of the Lost Ark.\"@en .",
    "name": "AncientEgypt"
  },
  {
    "description": "\"In Raiders of the Lost Ark, Indy is pursuing a pair of Egyptian men who are carrying a basket holding Marion Ravenwood. He runs into an open area filled with men, all dressed like the guys he's pursuing and carrying identical baskets.\"@en .",
    "name": "LostInACrowd"
  },
  {
    "description": "\"This is alluded to in Raiders of the Lost Ark, since both the US government and the Nazis might want to use it as a weapon (although it's more of a powerful spiritual artifact than lost technology).\"@en .",
    "name": "ArchaeologicalArmsRace"
  },
  {
    "description": "\"The famous scene in Raiders of the Lost Ark where Indiana faces the Master Swordsman has the swordsman demonstrating just how skilled he is by throwing his scimitar from one hand to the other, and then spinning it in his hands. Indy promptly puts an end to it by just shooting him.\"@en .",
    "name": "IntimidationDemonstration"
  },
  {
    "description": "\"As in the scriptures, the Ark of the Covenant in Raiders of the Lost Ark is an inherently dangerous artifact. Indy and Marion only survive the movie because Indy remembers the Bible saying not to look upon the open Ark. Those Wacky Nazis aren't as lucky.\"@en .",
    "name": "HolyIsNotSafe"
  },
  {
    "description": "\"Raiders of the Lost Ark. After an Egyptian pharaoh took the Ark of the Covenant to the city of Tanis, the city was destroyed by a sandstorm that lasted an entire year (note that this did not occur in Real Life).\"@en .",
    "name": "PerpetualStorm"
  },
  {
    "description": "\"In Raiders of the Lost Ark, upon meeting the expert swordsman about to cut him to ribbons, Indiana Jones simply draws a gun and shoots him. Harrison Ford was ill due to the previous night's dinner disagreeing with him, so the planned action scene was abbreviated into a quick joke.\"@en .",
    "name": "MundaneSolution"
  },
  {
    "description": "\"In Raiders of the Lost Ark, Indy does this for a bit while chasing the basket Marion is in, as soon as he realizes she's Lost in a Crowd.\"@en .",
    "name": "MobstacleCourse"
  },
  {
    "description": "\"Played straight in Raiders of the Lost Ark, where a burly German mook is fighting with Indy and ends up getting hit with an airplane propeller.\"@en .",
    "name": "DeadlyRotaryFan"
  },
  {
    "description": "\"Similarly, in Raiders of the Lost Ark, the Ark of the Covenant is confiscated by the US government and put in a crate with multiple locks marked \\\"Do Not Open Under Any Circumstances.\\\" Yet again, however, getting the girl and the opportunity to see Rene Belloq die in his moment of supposed triumph is still a plus.\"@en .",
    "name": "NoMacGuffinNoWinner"
  },
  {
    "description": "\"Raiders of the Lost Ark: If you look closely as they disembark from the submarine you'll notice that the Nazi soldier guarding Marian is heavily bandaged and he has an arm in a sling.\"@en .",
    "name": "DamselOutOfDistress"
  },
  {
    "description": "\"In Raiders of the Lost Ark, during the opening scene in the dungeon when the stone door is about to close down in front of Indy, time seems to stand still until Indy manages to sneak through under the door.\"@en .",
    "name": "MagicCountdown"
  },
  {
    "description": "\"The spirits that come out of the Ark in Raiders of the Lost Ark were filmed in a tank to get a ghostly flowing effect on their hair and clothes.\"@en .",
    "name": "WetForDry"
  },
  {
    "description": "\"An interesting variation occurs in Raiders of the Lost Ark when Indy and the mook he's struggling with briefly cooperate to shoot another mook that Todt just ordered to \\\"Shoot them both.\\\"\"@en .",
    "name": "GunStruggle"
  },
  {
    "description": "\"German agent Major Arnold Ernst Toht in Raiders of the Lost Ark. The moment he says \\\"We... h-huh... we are... heh-heh... not thirsty...\\\" in that stuttering, breathy sex offender's voice, you know nothing's beneath him. He lets more giggles rip when Indy and Marion are sealed in a tomb.\"@en .",
    "name": "GigglingVillain"
  },
  {
    "description": "\"In Raiders of the Lost Ark, one of Indy's students blinks at him, and has \\\"LOVE YOU\\\" written on her eyelids. Several other girls are shown dreamily staring at him.\"@en .",
    "name": "TeacherStudentRomance"
  },
  {
    "description": "\"In Raiders of the Lost Ark, Indiana Jones throws a handful of change at panhandlers mobbing him.\"@en .",
    "name": "MoneyToThrowAway"
  },
  {
    "description": "\"Raiders of the Lost Ark:\\n When a Nazi soldier falls out of the back of the truck and lands on Gobler's car.\\n When another Nazi falls off of the side of the truck.\"@en .",
    "name": "StockScream"
  },
  {
    "description": "\"The Nazi flying wing from Raiders of the Lost Ark never existed in real life. The Nazis did finally come up with a working flying wing towards the end of the war (eight years after the film takes place), but it had a different design than the one seen in Raiders so apparently it's an outright fictional aircraft instead of just an anachronism.\"@en .",
    "name": "StupidJetpackHitler"
  },
  {
    "description": "\"Variation: In the opening sequence of Raiders of the Lost Ark, Indy whips the gun out of someone's hand when he tries to shoot him.\"@en .",
    "name": "BlastingItOutOfTheirHands"
  },
  {
    "description": "\"The huge swordsman in Raiders of the Lost Ark has a Big Fucking Scimitar and the Thugs in the sequel brandish curved swords too.\"@en .",
    "name": "SinisterScimitar"
  },
  {
    "description": "\"Raiders of the Lost Ark has lots of swarthy Arabs in turbans who keep trying to slice Indy up with their swords. Somewhat averted by the character of Sallah, Indy's trustworthy Egyptian friend...who is played by a Welshman.\"@en .",
    "name": "AcceptableEthnicTargets"
  },
  {
    "description": "\"In Raiders of the Lost Ark, Indy is hiding in a Nazi base when he beats up a Nazi for his uniform. Unfortunately, the uniform's too small for him, becoming more awkward when another officer shows up and berates him for his appearance until Indy beats him up, taking his better-fitting uniform.\"@en .",
    "name": "DoubleSubversion"
  },
  {
    "description": "\"Of course, a monkey appears in several scenes of Raiders of the Lost Ark until its greed gets the better of it.\"@en .",
    "name": "EverythingsBetterWithMonkeys"
  },
  {
    "description": "\"Pretty much played straight in Raiders of the Lost Ark with Marion jumping into Indy's arms (and then climbing onto his shoulders) when they realize they are standing in a snake pit.\"@en .",
    "name": "SecurityCling"
  },
  {
    "description": "\"Raiders of the Lost Ark: When Indiana Jones is on a seaplane about to leave for Asia, a man lowers the Life magazine he's reading and reveals his face, with ominous music to let the audience know he's a Villain. He later turns out to be a Nazi agent.\"@en .",
    "name": "NewspaperThinDisguise"
  },
  {
    "description": "\"During the opening of Raiders of the Lost Ark, Indy is accompanied by two random native guides. They don't make it.\"@en .",
    "name": "RedShirt"
  },
  {
    "description": "\"Variation in Raiders of the Lost Ark when Indy is fighting the massive German mechanic at the airfield. The mechanic obviously feels the punches and grunts with each hit, but he doesn't even move despite Indy throwing his fists full-force into his jaw. Then the mechanic delivers a single jab that knocks Indy on his ass.\"@en .",
    "name": "NoSell"
  },
  {
    "description": "\"Also shown in a documentary reel about the making of Raiders of the Lost Ark were George Lucas' problems with the snakes. During one scene, Lucas had set up a ring of torches to keep the snakes away, but being cold-blooded reptiles they are naturally drawn to sources of heat and kept slithering nearer. At one point, he just grabs one by the 'neck' and stares it in the eyes, yelling:\"@en .",
    "name": "NeverWorkWithChildrenOrAnimals"
  },
  {
    "description": "\"Raiders of the Lost Ark:\"@en .",
    "name": "OneLinerNameOneLiner"
  },
  {
    "description": "\"In Raiders of the Lost Ark, Indy gets cornered in Marion's bar by a Nepalese thug, and a gunshot is heard. Indy jumps and grabs for his stomach, only to find no bullet. The thug slowly lowers his gun, some blood trickles from his mouth, and he falls to reveal Marion behind him with a smoking gun.\"@en .",
    "name": "BaitAndSwitchGunshot"
  },
  {
    "description": "\"Raiders of the Lost Ark: The Adaptation was one of these. A bunch of teenagers took about a decade of summers to hack together a nearly shot-by-shot remake of Raiders of the Lost Ark. They had to make five or six giant boulders and nearly burned down the house where they filmed. On the other hand, the final film is a Crowning Moment of Awesome for everyone involved.\"@en .",
    "name": "MovieMakingMess"
  },
  {
    "description": "\"One rather memorable scene in Raiders of the Lost Ark is where Indy encounters a really big German guy (called \\\"the Nazi mechanic\\\" by most movie buffs) who wants to do some Good Old Fisticuffs with him. Indy opens with a Groin Attack, which is subverted rather painfully when the guy shrugs it off and decks him with one punch. He's finally defeated by judicious use of a Turbine Blender.\"@en .",
    "name": "GiantMook"
  },
  {
    "description": "\"In Raiders of the Lost Ark, once opened, the Ark of the Covenant seems empty and therefore is thought to be worthless to the Nazis seeking its supposedly divine powers... until the wrath of God comes pouring out of it and utterly destroys the Nazis present.\"@en .",
    "name": "WorthlessTreasureTwist"
  },
  {
    "description": "\"Marion gets frustrated trying to treat Indy's wounds in Raiders of the Lost Ark thanks to this. This is after the poor guy got the crap beat out of him by a Giant Mook, shot in the shoulder, beat up again by a different mook including being punched in said shoulder repeatedly, dragged behind a truck, and then had Marion inadvertently hit him in the chin with a mirror.\"@en .",
    "name": "BandageWince"
  },
  {
    "description": "\"Raiders of the Lost Ark.\\n And Indiana Jones and the Kingdom of the Crystal Skull. Heck, since Indiana Jones is a franchise based on the movie serials of the 30s-50s it's not a surprise that this trope also arises once in the TV series and quite a few more in the comics.\"@en .",
    "name": "ChasedByAngryNatives"
  },
  {
    "description": "\"And in Raiders of the Lost Ark, Satipo's betrayal of Indy leads immediately to a case of multiple spikes through the head. \\\"Throw me the idol, I'll throw you the whip.\\\"\"@en .",
    "name": "ImpaledWithExtremePrejudice"
  },
  {
    "description": "\"Raiders of the Lost Ark - Marian, who can drink a huge Himalayan under the table, plays drunk with Belloq long enough to (try to) make a break for it.\"@en .",
    "name": "PlayingDrunk"
  },
  {
    "description": "\"Raiders of the Lost Ark\\n The main weapon of the German soldiers is the MP 40, despite the movie taking place in 1936. The MP 40 was the MP 38 slightly redesigned to be cheaper to manufacture and a little safer to carry, and the two are visually nearly identical, but still falls 2 years too short. Of course, as the Germans were collecting paranormal technology, they obviously must have gotten a hold of a short duration time-machine.\\n Something more jarring: Near the finale, Indiana Jones threatens the bad guys by aiming at them with a rocket launcher. The goof is that the rocket launcher is not of German manufacture, but actually a 1950s model of the Soviet RPG series, the RPG-2. A smaller, but still present issue is that the film takes place in the mid 1930s, even though no militaries at the time had developed rocket launchers yet. They only came about in the 1940s, as a more powerful successor to the anti-tank rifles used up until then.\\n Another, smaller goof, is that Indy is at one point seen with an Inglis Hi-Power, a Canadian variation of Browning's design that didn't begin production until 1944. Even having the original FN Hi-Power, like he does in the bar shootout,note\\u00A0Indy was originally envisioned as having the Colt 1911 for at least this scene, but as above, since 9mm blanks were more reliable they went with the Hi-Power instead would have been a bit of a stretch, since it would have only been in production for a year at best at the time of the film. Moreover, the initial sales were almost all for military contracts and FN had an agreement with Colt at the time to not sell its guns in the United States. So Indy would've needed to meet up with an FN sales agent in Europe and special-order the pistol.\"@en .",
    "name": "ImproperlyPlacedFirearms"
  },
  {
    "description": "\"Once at the beginning of Raiders of the Lost Ark, complete with absurdly out of place tarantulas. (\\\"Never too-covered\\\" is avoided: as Indy runs from the giant boulder, he goes through a door-wide web)\"@en .",
    "name": "CobwebJungle"
  },
  {
    "description": "\"Belloq in Raiders of the Lost Ark.\"@en .",
    "name": "ManInWhite"
  },
  {
    "description": "\"In Raiders of the Lost Ark, Indiana Jones drags a Nazi guard offscreen and steals his uniform, but it's too small, so when another guard berates him for his slovenly appearance, he beats that guard up and steals his (better-fitting) uniform.\"@en .",
    "name": "MuggedForDisguise"
  },
  {
    "description": "\"Raiders of the Lost Ark. The Germans have an agent in Cairo man who wears an eye patch and has a pet monkey. The monkey sees an escaping Marion trying to hide in a basket, jumps on the basket and screeches, calling the German agents to capture her. Also, at one point it gives a Nazi salute.\"@en .",
    "name": "TimmyInAWell"
  },
  {
    "description": "\"The first and third Indiana Jones films. Just to be on the safe side, the first one gives one of its Nazi villains a few antisemitic comments about the Ark of the Covenant.\"@en .",
    "name": "PoliticallyIncorrectVillain"
  },
  {
    "description": "\"In Raiders of the Lost Ark, Marian's introduction comes as she is winning a drinking contest.\"@en .",
    "name": "DrinkingContest"
  },
  {
    "description": "\"Subverted in Raiders of the Lost Ark. Indy finding Marion coincidentally in the first tent he happens to stumble in? Lame. Him deciding to leave her there since he can't take her that easily out of the camp? That's a new twist.\"@en .",
    "name": "ContrivedCoincidence"
  },
  {
    "description": "\"In Raiders of the Lost Ark, they discover the Ark of the Covenant, which turns out to be a super weapon. The plan, led by main antagonist Rene Belloq, backfires because the power is too great to control and thus wipes out the Nazis trying to secure it.\"@en .",
    "name": "EvilPlan"
  },
  {
    "description": "\"In Raiders of the Lost Ark, Indiana Jones's friendship with his mentor Abner Ravenwood fell apart after he was romantically involved with his daughter Marion.\"@en .",
    "name": "WeUsedToBeFriends"
  },
  {
    "description": "\"In Raiders of the Lost Ark, Indiana Jones hijacks a Nazi truck, runs the rest of the convoy off the road, and knocks almost everyone else off the sides of the truck. But one Nazi manages to shoot him in the arm, and the last Nazi manages to throw him out after punching him in his arm wound several times.\"@en .",
    "name": "GameBreakingInjury"
  },
  {
    "description": "\"Raiders of the Lost Ark: Marion's dress from Belloq gets dirtied from being in the Well of Souls, and Indy tears up most of the skirt.\"@en .",
    "name": "DoomedNewClothes"
  },
  {
    "description": "\"The conclusion of Raiders of the Lost Ark is one of the most famous uses of this plot device: the ending of the film is a shot of the Ark of the Covenant, in a crate, being filed in a massive warehouse. Filled with identical crates. This same warehouse was eventually revisited in the opening of Indiana Jones and the Kingdom of the Crystal Skull. Three guesses where this warehouse was located...\"@en .",
    "name": "SecretGovernmentWarehouse"
  },
  {
    "description": "\"At the end of Raiders of the Lost Ark, the Nazis open the Ark and have their skin and flesh blasted away, leaving the bones behind.\"@en .",
    "name": "StrippedToTheBone"
  },
  {
    "description": "\"A famous goof in Raiders of the Lost Ark has Indy shove a loose cubical stone the size of a compact car hood out of a wall, and the shadow shows it bouncing several times as it hits the sand.\"@en .",
    "name": "StyrofoamRocks"
  },
  {
    "description": "\"A natural Snake Pit occurs in Raiders of the Lost Ark, where the heroes fall in a dried-up well full of various snakes.\"@en .",
    "name": "SnakePit"
  },
  {
    "description": "\"Marion Ravenwood and Indiana Jones. Willie Scott and Indiana Jones.\"@en .",
    "name": "BelligerentSexualTension"
  },
  {
    "description": "\"In \\\"Read it and Weep\\\" most of the episode is spent recounting a book that Rainbow Dash is reading. The book is essentially Raiders of the Lost Ark, with ponies.\"@en .",
    "name": "WholePlotReference"
  },
  {
    "description": "\"Used by the Hovitos in Raiders of the Lost Ark in the opening sequence.\\n Also seen in Indiana Jones and the Kingdom of the Crystal Skull in the tomb sequence. Indy does the \\\"blow the dart back\\\" trick.\"@en .",
    "name": "BlowGun"
  },
  {
    "description": "\"He also said similar in regard to snakes in the beginning of Raiders of the Lost Ark.\"@en .",
    "name": "ItsXIHateX"
  },
  {
    "description": "\"Raiders of the Lost Ark briefly has a Nazi machine-gunner try to kill Indy with it by firing in his general direction with it. Not only did he miss cleanly, the angle was such that he sprayed the cargo compartment of the truck in front of him (the mooks in the truck are shown hitting the deck to avoid the gunfire).\"@en .",
    "name": "ArtisticLicenseGunSafety"
  },
  {
    "description": "\"Subverted with Raiders of the Lost Ark: After beating the asses of several opponents, Indy is sick of fighting. So when another opponent steps up with swords, Indy just pulls a revolver on him.\"@en .",
    "name": "HeroesFightBarehanded"
  },
  {
    "description": "\"Indiana Jones ripped off part of Marion's dress in Raiders of the Lost Ark.\"@en .",
    "name": "ActionDressRip"
  },
  {
    "description": "\"Tanis, Egypt from Raiders of the Lost Ark is a real place. It could not have been rediscovered by the Nazis in 1936 because it was never lost in the first place. In fact, there were numerous archaeological digs in Tanis before the Nazis even came to power. Egypt was also under British influence in 1936, when the movie is supposedly set.\"@en .",
    "name": "ArtisticLicenseHistory"
  },
  {
    "description": "\"Raiders of the Lost Ark: The Nazis decide to \\\"try out\\\" the Ark of the Covenant as a weapon of mass destruction, only to be destroyed themselves for not reading the fine print.\"@en .",
    "name": "MeaninglessVillainVictory"
  },
  {
    "description": "\"In Raiders of the Lost Ark, Belloq leaves Indiana Jones trapped inside the Well of Souls, the underground temple where the Ark was hidden. He taunts Indy thusly: \\\"You're about to become a permanent addition to this archaeological find. Who knows? In a thousand years, even you may be worth something.\\\"\"@en .",
    "name": "ThrownDownAWell"
  },
  {
    "description": "\"Raiders of the Lost Ark is quite a bit more well known than its sequels, especially the very first scene. References to Temple of Doom and most importantly The Last Crusade do pop up infrequently, especially the latter's earlier parts. Why Did It Have to Be Snakes? indeed. (Also, It Belongs in a Museum.)\"@en .",
    "name": "FirstInstallmentWins"
  },
  {
    "description": "\"Raiders of the Lost Ark has Major Arnold Toht, who we see offering Marion a chance to play with a red hot poker:\\n Later, in a subversion, he whips out a bizarre contraption of metal bits and chains which looks like it would be quite nasty... and then reveals it to be a collapsible coathanger.\"@en .",
    "name": "TortureTechnician"
  },
  {
    "description": "\"In Raiders of the Lost Ark Indy fights a Giant Mook next to a Nazi flying wing whose engines are running. Its wheels become un-chocked during the fight and it starts to rotate around. Indy dives for cover, Giant Mook looks behind himself, and cue Gory Discretion Shot.\"@en .",
    "name": "TurbineBlender"
  },
  {
    "description": "\"The first Indiana Jones film was titled \\\"Raiders of the Lost Ark\\\". It has been renamed as \\\"Indiana Jones and the Raiders of the Lost Ark\\\" to fit better with the later movies, although the onscreen title is still Raiders of the Lost Ark.\"@en .",
    "name": "TitleConfusion"
  },
  {
    "description": "\"Raiders of the Lost Ark. When Indiana Jones finds the Well of Souls, he discovers that it's full of snakes, which is a problem because he has a severe phobia of snakes. He decides to go in anyway because it's the only way he can get the Ark of the Covenant.\"@en .",
    "name": "FaceYourFears"
  },
  {
    "description": "\"Done most famously in Raiders of the Lost Ark, where Indy is challenged by a hopelessly larger fighter; Indy kicks him the groin in desperation\\u2014 in response to which the fighter just challenges him again.\"@en .",
    "name": "BallsOfSteel"
  }
]
