[
  {
    "categories": [
      "GunsAndGunplayTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Die Hard with a Vengeance has McClane puts his pistol in his waistband instead of in the shoulder holster he is wearing! It takes a little longer to draw a gun out of a shoulder holster than from the hip; given how his day had been going thus far...",
      "general": "When a character stores or conceals a weapon, typically a gun, in a place which is not suited for such a purpose, typically the waistband or sometimes pocket of his/her pants. There, or loose in a civilian briefcase. Anywhere but a holster. Often as not, the safety isn't on and the gun is loaded, too. Perhaps it's another source of the term \\\"going off half-cocked\\\". He means shooting his penis.\\nAlthough aversions aren't uncommon, the weapons rarely fall down the pants leg (provided you are wearing a belt or pants at least as sturdy as blue jeans), and only occasionally will the weapon accidentally discharge and injure someone in an intimate place. As of the 1950s firearm actions are required to be \\\"drop-safe\\\", so the not going off part is Truth in Television. Even when the weapon is drawn suddenly, like for combat, and leaves the pants with the user's finger on the trigger, it typically only happens for comedic purposes. Because what's funnier than someone shooting themselves in the foot? That's right.\\nSubtrope of Artistic License \\u2013 Gun Safety. See also I Just Shot Marvin in the Face, Hidden Weapons, Trouser Space, Unorthodox Holstering, and Victoria's Secret Compartment."
    },
    "name": "Pants-Positive Safety",
    "rdf_element": "PantsPositiveSafety/int_691166df",
    "short_name": "PantsPositiveSafety",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/PantsPositiveSafety"
  },
  {
    "categories": [
      "DisguiseTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "In Die Hard with a Vengeance, McClane gets in an elevator with several terrorists disguised as cops and security. He notices they're using terminology incorrectly, referring to the elevator as a \\\"lift\\\" (a European/British term) and a weather report as raining \\\"dogs and cats\\\" (the wrong order). McClane is visibly suspicious, but what confirms it is when he spots \\\"Detective Otto\\\" is wearing a police badge that belongs to a friend of his. McClane being McClane, things inevitably get violent.",
      "general": "This is when an impersonator has an almost perfect disguise, only to ruin it with a seemingly inconspicuous mistake. Perhaps the imposter blurted out something out-of-character (or a personal catchphrase), or accidentally revealed that they're left-handed. \\nThis can more easily occur during a round of Bluff the Impostor, and can be a sub-trope of Spot the Impostor except that their target generally has no advance knowledge that there is an imposter in the first place.\\nRelated to Pull the Thread as this is often what leads to it. Compare Saying Too Much, a more incriminating version. See also Conviction by Counterfactual Clue, when this gets even more unrealistic. Often overlaps with Imposter Forgot One Detail. Compare For Want of a Nail.\\nWhen applied to a dream test, it's A Glitch in the Matrix."
    },
    "name": "Spotting the Thread",
    "rdf_element": "SpottingTheThread/int_691166df",
    "short_name": "SpottingTheThread",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SpottingTheThread"
  },
  {
    "categories": [
      "WeaponsAndWieldingTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Die Hard with a Vengeance has both a Red Herring bomb the size of a vending machine (the explosive liquids are actually maple syrup), and the actual bomb that takes a major part of a ship's basement and leads to an impressive blast.",
      "general": "Any bomb that is at least as big as a car (either as one explosive or a cluster), is truly made to make a huge blast.\\nThe reason is that when you have Stuff Blowing Up, it's often good to have bigger explosions. But that doesn't necessarily mean the actual bomb has to be large, especially these days with high yield explosives. Before then, huge bombs were the easiest way to make it clear the blast would be huge (in fiction and Real Life). With high yield in a large amount, the blast goes Up to Eleven.\\nMay overlap with the Incredibly Obvious Bomb, because it's going to be hard to hide something this big.\\nCompare BFG, BFS, More Dakka, Wave Motion Gun, Kill Sat, Macross Missile Massacre, There Is No Kill Like Overkill, Awesomeness Is Volatile, Outrun the Fireball.\\nNot to be confused with a work that flops horribly.\\nThis is about the size of the bomb. The actual explosion, its effects, or even the materials of the bomb, are irrelevant to whether an example counts."
    },
    "name": "Big Bulky Bomb",
    "rdf_element": "BigBulkyBomb/int_691166df",
    "short_name": "BigBulkyBomb",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/BigBulkyBomb"
  },
  {
    "categories": [
      "Plots"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Subverted in Die Hard with a Vengeance with \\\"Simon\\\" playing a Simon-Says type game with the main character through the first half of the movie in order to prevent a bomb from being detonated. Subverted in that  it's shown to simply be a way to get McClane (and the entire NYPD) out of the way while Simon pulls off a heist of the federal reserve.",
      "general": "The detectives are on the heels of a very unbalanced criminal who has left them a trail of clues to follow \\u2014 these clues aren't meant to cover the criminal's tracks, but, for the criminal's (and the audience's) entertainment, are usually intended to be a test of their intellect, or their investigatory skills, as though the criminal wants to see if the detectives are worthy of catching him.\\nNot only do the detectives oblige the nutter and follow his breadcrumb trail, they tend to give up all conventional routes of investigation. Usually they are the minutest step behind their quarry right until the end. Sometimes the criminal wishes to distract or trap the detectives, sometimes they want them to uncover some other truth along the way, but usually they're just being a real smartass. Sometimes the clues are hidden in the Serial Killer's Calling Card or in its gruesome souvenirs. There is often a Breaking Speech (or \\\"The Reason You Suck\\\" Speech) and a Kirk Summation (or \\\"World of Cardboard\\\" Speech) exchange between The Protagonist and antagonist some time before the climax.\\nThe criminal will often warn the investigators that there will be consequence for cheating on the game.\\nCan overlap with Absurdly High-Stakes Game.\\nThese people often enjoy wordplay. Anagrams abound, as well as sentences with a carefully designed second meaning, and proper nouns which are conveniently also real words (\\\"wait a minute, does he mean Jim Trashcompacter?\\\").\\nSee also Linked List Clue Methodology for a number of non-(or at least less) criminal scavenger hunts. Compare The Walrus Was Paul.\\n\\nExamples"
    },
    "name": "Criminal Mind Games",
    "rdf_element": "CriminalMindGames/int_691166df",
    "short_name": "CriminalMindGames",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/CriminalMindGames"
  },
  {
    "categories": [
      "DeathTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "In Die Hard with a Vengeance, we get one of these when one of the Mooks is sliced in half by a snapping cable. We see the cable whip towards him, we see him catapulted backwards by the hit, but cuts away before we see him bisected. Then McClane and Zeus come across his body. \\\"I'll get his arms, you get his legs.\\\" They start out carrying the body normally, until Zeus turns until he's side-by-side with McClane.",
      "general": "Blood or brains are seen splattering against a wall and the rest is left to the imagination.\\nMost often used with women and children, because it's more okay to hurt men in Hollywood, but available for everyone to control the tone/rating of the work. Often found in the form of a Reaction Shot as the reacting characters' expression (or lack thereof) can serve as a commentary on the action, the character, or the world they inhabit. Sometimes combined with Blood Spattered Innocents, as the gore splatters on or near them.\\nA Japanese variation of this trope involves seeing the silhouettes of the participants from behind a translucent washi screen, typically a shouji sliding door, on which the blood gets spattered. The form has since been widely adopted by the west and is often used to give a sense of art. A similar variation is to have the splatter hit the other side of a pane of glass or a window. Another variation shows blood seeping out under a door, through an opening or across a sill or a threshold to imply that violence has occurred on the other side.\\nA Gory Discretion Shot can serve to keep the rating PG-13 to reach a wider audience. It may also be done for budgetary reasons: red dyed corn syrup splashed over a window: cheap. Showing someone's head explode: expensivenote\\u00A0Although Scanners managed an effective budget version by filling a rubber head with chicken giblets and blood and firing a shotgun at it from below and behind. Still more expensive than the syrup/dye, though. Note that it could also be done to keep the truth hidden from the viewer. Showing the murder in question straight out, so the viewers can see the culprit, doesn't make a good murder mystery in most shows or movies after all.\\nCombine it with Bloodless Carnage, and you get the Sound-Only Death \\u2014 the audience hears the gunshot and the body hitting the deck, but what they see is (for instance) the victim's hat falling to the ground with a hole through it. Or the killer walks through a door and we hear gunshots and screams after it closes behind him. Also crosses paths frequently with Scream Discretion Shot.\\nA related trope is the camera cutting away when things get nasty. Say if someone is getting whipped, we'll only see their face contorting in pain. Alternately, a cut similar to a Screamer Trailer may be used, showing a split second worth of the carnage. In the same vein, the aftermath of a murder may be demonstrated minimally with a Dead Hand Shot, hopefully one still attached to the body.\\nContrast Gorn. Compare and contrast Battle Discretion Shot and Nothing Is Scarier; though this may be less \\\"scary\\\" than not showing anything at all in a less overtly violent work, in Gornographic works this can be used for horror\\u2014with all this overt violence running around, what is so horrible you don't get to see it...? See also Empathy Doll Shot and Pink Mist. May precede a Mortal Wound Reveal, especially if it's unclear who exactly got injured\\u2014note that this is a Subversion of sorts, when it does happen."
    },
    "name": "Gory Discretion Shot",
    "rdf_element": "GoryDiscretionShot/int_691166df",
    "short_name": "GoryDiscretionShot",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/GoryDiscretionShot"
  },
  {
    "categories": [
      "GunsAndGunplayTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "An alternate ending to Die Hard with a Vengeance includes John McClane playing a variant of Russian roulette with Simon Gruber using a Chinese rocket launcher without the pin. He asks Simon a series of questions, and eventually asks a question that Simon gets wrong.  Turns out that the answer to the question is that he forgot to bring a flak jacket, which is what McClane is wearing and this would have protected Simon from the blast of the rocket, and the rocket fires on Simon, killing him instantly.",
      "general": "Russian Roulette: A game of suicide and/or luck for one to six players.\\nEquipment:\\n 1 revolver\\n 1 round of ammunition\\nSetup:\\n Load one chamber.\\n Half-cock the hammer to free the cylinder.\\n Spin it.\\n Fully cock the hammer to stop it.\\n (Alternative for double-action revolvers) With the cylinder swung out to the side, spin it and slap it back into the frame.\\nRules:\\n Each player, in turn, puts the gun to his head and pulls the trigger.\\n First player to die loses.\\n Portrayals of the game differ as to whether the cylinder is spun after each trigger pull. If it is, the game can continue indefinitely with a 1 in 6 chance of hitting the loaded chamber each time. If not, there are a maximum of 5 chances to not die, assuming the cylinder has 6 chambers and the ammunition round isn't a dud.\\nHistory: The game was allegedly invented by the Russians either during World War One or by those assigned to Siberia. If the latter, to deal with the extreme boredom, as their assignment was often referred to as 'counting trees', while the former was to try and get out of the extremely bloody and inglorious war. There are no indication however that this is true (and such outlandish behaviour would have most likely been recorded as suicides and duels were usually described in length) as the first mention of this game (as well as the name 'Russian roulette' itself) appears in a 1937 short story of the same title by Georges Sundez, a Frenchman. Also, the most common revolver issued by the Russian army at the time had a cylinder that could not be freely spun (and also had seven chambers, but that's not really important).\\nToday, it's seen as the one of the more manly stunts available because of the risks involved, reduced somewhat by the common one-round-six-chambers setup. Perfect for proving you're not afraid to (or want to) die, you're a real man, or you're just Too Dumb to Live.\\nSome claim that if the original game existed, it could be a largely harmless entertainment - if there is a single round and a gun is well oiled, the full chamber will end at the bottom.\\nIt can also be used to scare information out of prisoners, as a form of psychological torture.\\nNeed we say it: Don't Try This at Home. Besides the risk to your life if you lose, if you play with others you can be charged with murder if someone dies (at least in common-law jurisdictions, under the theory of depraved-heart/grossly reckless murder\\u2014see for instance the Pennsylvania case Commonwealth v. Malone), and in some jurisdictions you can be tried for attempted murder even if everyone lives. One notable case in 1984, was American actor Jon-Erik Hexum who died a Russian roulette stunt, despite only loading the revolver with blanks. Despite his belief that this made it harmless, the overpressure wave from the discharge of the blank propelled the round's wadding into his temple, shattering his skull, and causing brain trauma. Six days later he was declared brain dead and was taken off life support.\\nSee also False Roulette. For the wider trope of lethal \\\"games\\\" that don't involve handguns, see Absurdly High-Stakes Game. The Other Wiki also has an article. One of the reasons why Revolvers Are Just Better.\\nFor the TV game show, click here."
    },
    "name": "Russian Roulette",
    "rdf_element": "RussianRoulette/int_691166df",
    "short_name": "RussianRoulette",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/RussianRoulette"
  },
  {
    "categories": [
      "JustForPun"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Die Hard with a Vengeance features a Wall Street subway bombing. (And subverts it by using the explosion to break into the Federal Reserve.)",
      "general": "Even though there are 4.85 other boroughs in New York City (if you count Staten Island), Lower Manhattan is used disproportionately often in many films and shows because it's easier to film in; the Financial District empties out like a Ghost City on the weekends. Many of the streets are already blocked off, and there are few residents to complain if an entire neighborhood is overrun by camera crews and catering trucks.\\nAs a result, anything which is nominally set (or could be set) in other parts of the city will still have scenes filmed downtown even if there's no compelling reason for the characters or action to be there. A story about stock brokers makes sense, but for everything else, it's because it's an easy shooting location.\\nThe corner of Wall and Broad Streets is a popular spot because it's been closed to traffic for years. It's also the location of Federal Hall, which easily doubles for any other columned government building. Hardly a weekend goes by without something being filmed there.\\nThe trope name comes from Robert Fulton, whose 1807 steamboat the Clermont was contemporaneously ridiculed as \\\"Fulton's folly\\\"note\\u00A0Previous steamboats had been woefully underpowered, leading the Unwashed Masses\\u2122 to believe the technology was completely infeasible, and who has a prominent local street named for him and is buried at nearby Trinity Church.\\nA subtrope of Big Applesauce, where things happen in New York even though they could be reasonably set in any other city, state or country.\\nNot to be confused with Fulton Street Foley, the sound of urban combat and mobilized emergency vehicles as Lower Manhattan falls under lockdown."
    },
    "name": "Fulton Street Folly",
    "rdf_element": "FultonStreetFolly/int_691166df",
    "short_name": "FultonStreetFolly",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/FultonStreetFolly"
  },
  {
    "categories": [],
    "descriptions": {
      "DieHardWithAVengeance": "In Die Hard with a Vengeance, the trucks loaded with looted gold bullion would not have been able to drive uphill. The producers admitted to just ignoring the issue.  The trucks wouldn't have been able to drive at all. In 1995, 150 billion dollars worth of gold should have weighed around over 9,000 tons. 13 trucks? 130 would have had trouble carrying that load. One thief tosses a gold bar to another thief. The way it hits him when he catches it, it should've ruptured a few organs. On the other hand, Zeus is very surprised at how heavy a single gold brick is.",
      "general": "Writers frequently misapply, distort, or outright forget about the concept of density and its implications. This results in such oddities as most metals, including gold, being treated as weighing the same as an equivalent volume of iron or steel, with the possible exceptions of aluminum (famous for weighing less) and lead (famous for weighing a lot). The only thing typically treated as denser than lead is matter from a neutron star, by orders of magnitude \\u2014 there's apparently nothing in between.\\nBy the same token, anyone can lift as much of a \\\"light\\\" object, such as feathers, Styrofoam, or in the worst cases even stacked flat paper, as can be made practical to carry (though, interestingly, if the paper is in another form, this doesn't seem to apply as much, as characters will frequently acknowledge that stacks of books or newspapers are heavy.)\\nWhat's worse, even if the writers get it right, sometimes the actors won't, due to not compensating for the difference between the weight of the prop and the weight of the object it's supposed to represent through acting.\\nGenerally, the only exception to \\\"people carrying around big gold ingots with ease\\\" comes when the density of gold relative to other substances is itself a major plot point. Especially since gold is actually 70% more dense than lead. To say nothing of the fact that gold's status as a dense substance is rather well known; anyone who's ever worn a gold ring can tell that it's heavier than a silver one.\\nSometimes an Acceptable Break from Reality, sometimes not. It helps to be in a fantasy setting, and consistency is key. Keep in mind that sometimes reality can make something incredibly boring. (One of the most common house rules for most tabletop games is that gold is weightless, because having a weight penalty for your character's money would detract from the fun of the game.) Balloonacy is a subtrope dealing with wild over- and under-estimations of the lifting capacity of Helium, Hydrogen or hot air. Soft Water follows this trope, and Briefcase Full of Money is closely related."
    },
    "name": "Hollywood Density",
    "rdf_element": "HollywoodDensity/int_691166df",
    "short_name": "HollywoodDensity",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/HollywoodDensity"
  },
  {
    "categories": [],
    "descriptions": {
      "DieHardWithAVengeance": "Die Hard with a Vengeance: \\\"Say 'Hello' to your brother.\\\" (\\\"Yippee-ki-yay\\\" is uttered after the kill).",
      "general": "What's better than killing your most hated enemy? Sending them into the afterlife with your voice in their ears and the knowledge of your badassery in their head, that's what.\\nAnother common staple of the Action Hero, this finishing quote need not be a One-Liner, but the longer your little speech goes, the more likely the bad guy will find some way to evade your intended killing blow or worse, make you Talk to the Fist. Consequently, Genre Savvy heroes are advised to just Kill Him Already and save the pithy quotes for immediately afterwards. Of course, sometimes (as in the Heroes and Matrix examples) it seems that a Pre-Mortem One-Liner somehow paralyzes your enemy while you deliver it, or maybe they're just courteous.\\nThe monstrous equivalent is less articulate. Not to be confused with a Pre Ass Kicking One Liner, which is used at the beginning of a fight; these quotes are used to end the fight. Also related but different is a one-liner delivered when escaping from battle.\\nGive My Regards in the Next World and See You in Hell are subtropes. Compare Bond One-Liner (aka Post-Mortem One-Liner) which is a humorous aside for the audience. If the victim is the one speaking, it's Defiant to the End."
    },
    "name": "Pre-Mortem One-Liner",
    "rdf_element": "PreMortemOneLiner/int_691166df",
    "short_name": "PreMortemOneLiner",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/PreMortemOneLiner"
  },
  {
    "categories": [
      "DiscreditedTrope"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Played with by the villain in Die Hard with a Vengeance.",
      "general": "A horror and police procedural trope where the police set up a phone trace to catch a criminal but they need them to stay on the line for a certain amount of time. The amount of time will vary, yet somehow the criminal will know the exact amount of time and purposely hang up just before the police can get a trace. If it's a particularly high-tech setup, expect to see a computer generated map showing the tracing process.\\nEven if the person on the other line is encouraged to keep the other person talking, it never seems to work. The criminal will say everything they want and still always hang up a few seconds shy of the minimum time to trace the number. In some cases, the criminal will say they're aware of the phone trace or say how many seconds the call took. This trope is often used by serial killers or any particularly clever character. A common subversion is to stay on the line just long enough for a trace, but the purpose is to lead the police somewhere else as part of the criminal's elaborate plan.\\nUp until perhaps the late 1970s and early 1980s this was somewhat accurate. Telephone switches were racks of mechanical switches in which, when you dialed a number - using a rotary phone, a line selector used the clicks to determine which frame in the next digit to connect your call to. You dialed a 3, and the relay went to the 3xx-xxxx rack, then the next digit of 7 would connect to 7 rack in the 3 series, and so on, until you got to the last digit of the subscriber's number. If it was in use, you got dumped to the busy generator. Otherwise, you got to hear the ring tone as the line was rung. All these connections were created to make a physical connection between your phone and the destination phone. That means, to trace a call on a mechanical switch, they had to see where the wire ran to, then trace what that one was connected back to. This also meant, if the trace wasn't finished before the call was, the \\\"sickening sound\\\" of a call collapsing as the circuit was released for another call to go through.\\nIf the call was long distance, they'd have to send someone to the central office that connected the call to the city, then trace it back to wherever it was connected from, and so on. This is why if someone was making obscene phone calls long distance, it would require many repeated calls to trace back the caller because of the time involved to trace, say, a call over mechanical switches from Pasadena, California to Ellicott City, Maryland. Traces from major cities, say, Los Angeles to Baltimore or Chicago, even over mechanical circuits would be much faster, however because the calls didn't have to go through intermediate cities.\\nAs digital computers became more powerful, a switch basically was a mainframe computer with a bunch of phone lines plugged into it instead of a bunch of racks connected by mechanical relays. As a result, tracing a call means nothing more than going to the console, entering the phone number and asking who is connected to it. Eventually with the development of SS 7 switches, it got to be sophisticated enough you could get it yourself in real time for a few dollars extra through Caller ID.\\nAn essential part of The Calls Are Coming from Inside the House.\\nAs technology marches on, this trope has morphed into tracing the computer connection, but the essence remains the same. Is often a source of artistic license, since (unless the work is set in the 1960s or earlier) the phone company can use their computer records tell the cops what numbers called a given phone, and when, even months after the call.\\nNot counting Caller ID, which landline phones can get at a fee, and which is included on cell phones as part of the service, giving you the caller's number (and possibly name) before you even answer the phone."
    },
    "name": "Phone-Trace Race",
    "rdf_element": "PhoneTraceRace/int_691166df",
    "short_name": "PhoneTraceRace",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/PhoneTraceRace"
  },
  {
    "categories": [
      "OlderThanSteam"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "In Die Hard with a Vengeance, McClane is chasing Simon Gruber through the half-finished aqueduct, when the latter blows a dam and floods it. The water pressure shoots McClane out of a drainspout literally the moment Zeus passes it, allowing him to pick him up and continue the plot. Had the two missed each other and taken any time to reconnect, they would have missed their opportunity to later board the boat and Gruber's plan would have gone off without a hitch. Not to mention, of the hundreds of schools in New York City, the one Simon has planted his bomb in is the one where Zeus (who only entered the story randomly) has his two kids enrolled.\\n The school may not be so much of a contrived coincidence, just not explained. McClane only met Zeus because Gruber forced him to be in that area. It makes a sort of sense that Gruber picked the area because he was already there to plant the explosives in the school there. So the chances of a local having kids at that school is much much higher.",
      "general": "In order to keep a story moving, things need to happen a certain way. Sometimes everything is carefully set up and orchestrated, so that events unfold in an organic, natural fashion. More often than not, though, things happen the way they do simply Because Destiny Says So.\\nThere's just one tiny little problem with that theory: Sometimes, Destiny doesn't say so.\\nContrived Coincidence describes a highly improbable occurrence in a story which is required by the plot, but which has absolutely no outward justification \\u2014 not so much as a character saying There Are No Coincidences. The concept of \\\"destiny\\\" is glossed over altogether, and the events in question are simply disguised as mere happenstance. This would be jarring, but most of the time no attention is drawn to the event at all. It's just a narrative convention designed to skip over lots of irrelevant stuff by putting the important events all together, leaving the audience to forget the improbability of the event.\\nFor example, when two characters are separated in a huge battle involving millions of combatants, they will bump into each other again just in time for one to save the other's life. This is not highlighted as an example of destiny or fortuity in any way, and in fact the improbability of the two people meeting again at such a convenient moment is ignored altogether. If the coincidence is noted, it will be in the form of \\\"lucky you showed up when you did\\\" as if it provides some justification to the events that just transpired.\\nIn many an action/adventure show or movie, the protagonists are introduced to at the very beginning or portrayed to retain various gadgets that invariably play perfectly into a dire situation they find themselves in later on. It has the potential to be reasonable, such as bringing hiking equipment to a mountainous terrain mission, but more often than not it's just a flat-out Asspull. Honestly, what didn't Batman \\\"just so happen to\\\" carry in that little belt of his? (For that matter, RPGs and Adventure games are particularly common offenders, as inventory coincidences are often used to maintain the progression of gameplay.)\\nIt's not Destiny, it's not By Design; heck, the writer may not even bother calling it a coincidence. It just happens. Deal with it and move on.\\nIn cases where the coincidence is acknowledged, it's likely a Lampshade Hanging. Characters may invoke Maybe Magic, Maybe Mundane for that.\\nCan be justified to a limited extent by the Anthropic Principle (see also The Other Wiki). Unlikely coincidences are bound to happen once in a while. Exceptional things don't happen to the main characters because they are main characters; rather, they are designated main characters because exceptional things happen to them. In other words, there would be no story without this first exceptional coincidence. The earlier in the story the plot-driving coincidences occur, the more leeway the writer has with them.\\nExcept for Farce. Contrived Coincidence is one of the driving forces of Farce, decreed by the Rule of Funny. This is a major reason why wariness is needed in other genres; too much of it will make the story farcical.\\nOne, less justifiable use for it is Doing In the Wizard. When the creator requires a coincidence, or worse, a combination of them, not to move the action forward but to say that it really could happen mundanely, it's not magic or the supernatural, the effect is usually not pleasing. Audiences disliked it as far back as the ancient Greeks, and Aristotle deplored it in Poetics.\\nMake note that like its sister trope Theory of Narrative Causality, this is one of the most pervasive tropes out there. Remember though, that just because a work uses this trope is not an automatic black mark against it. Even the greatest works out there sometimes need a great leap to get the plot to go in an interesting direction.\\nFor a more grandiose or plot-wrapping version, see Deus ex Machina. See also Fridge Logic for the moment it sinks in, and Not My Driver for the vehicular version.\\nIt's a Small World After All is a subtrope of this. A person who is a Weirdness Magnet tends to be a walking contrived coincidence. So is the variant of Framing the Guilty Party where the one doing the framing didn't know that party was guilty. Too many contrived coincidences may result in One Degree of Separation. Often, these can disguise a Gambit Roulette as The Plan."
    },
    "name": "Contrived Coincidence",
    "rdf_element": "ContrivedCoincidence/int_691166df",
    "short_name": "ContrivedCoincidence",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ContrivedCoincidence"
  },
  {
    "categories": [
      "NarrativeDevices"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Although not involving poison, the alternate ending to Die Hard with a Vengeance plays with this trope. John McClane faces off with Simon Gruber, a rocket launcher with the sights removed on the table between them. They play the Simon Says game, with the rocket being turned each time Simon Gruber answers a question correctly. Eventually he gets a question wrong, so John tells him to pull the trigger. However Simon turns the rocket launcher one more time before doing so, convinced the muzzle will then be facing towards John. He's wrong.",
      "general": "Two enemies are sharing a drink and one of the glasses contains poison. At least one of them will attempt to poison the other by switching glasses while the other's back is turned. Common joke is either that someone poisons a chalice, then they get switched over, or someone knows he's got a poisoned drink, and tries to find a chance to dispose of it without being obvious, or pretending to swap the glasses, waiting for the enemy to really swap them and drink. A common trick (most famously seen in The Princess Bride) is to poison both drinks.\\nA less lethal variation is to shake up a bottle or can of soda or beer.\\nA Discredited Trope, more often parodied (or made fun of) than played straight these days. When switched and switched back, this is Two Rights Make a Wrong."
    },
    "name": "Poisoned Chalice Switcheroo",
    "rdf_element": "PoisonedChaliceSwitcheroo/int_691166df",
    "short_name": "PoisonedChaliceSwitcheroo",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/PoisonedChaliceSwitcheroo"
  },
  {
    "categories": [
      "BossBattle"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "The end of Die Hard with a Vengeance: McClane kills the Big Bad's helicopter, and thus the Big Bad.\\n In Live Free or Die Hard, he kills a helicopter. With a car.",
      "general": "The someone or something has run up against an enemy. It's time to do battle, just the heroes, and... a vehicle?\\nThis is when someone has to go up against what essentially amounts to a vehicular foe. Maybe the Big Bad is too weak to just attack on foot, and does it from the protection of his vehicle. Maybe it's just a bunch of Mooks in a helicopter. Worst yet, the vehicle itself is the villain, either through malevolent AI or spiritual possession. In any case, the battle isn't between individuals or groups so much as between people.\\nThe end result is that the heroes have an opponent that's faster, more durable, and deadlier than just an ordinary, squishy human. Furthermore, the villain(s) can usually take shots at the heroes, either by shooting at the heroes from the safety of their vehicle or by using weapons mounted on the vehicle itself. Failing that, there's always the old standby of Car Fu. Helicopters in this situation are rather liable to become makeshift blenders, whether or not the helicopter or its occupants have a better way of dispatching the heroes.\\nWhen this appears, there's usually three ways it'll play out:\\n The hero takes out the vehicle directly, either by hitting a weak point, manipulating it into a trap, or just using a very big gun.\\n The hero takes out the driver, thereby causing the vehicle to crash, or at least stop moving and attacking.\\n The hero can't take it out, and is forced to run away.\\nNote that just a character killing a vehicle does not qualify it for this trope, nor does two vehicles duking it out with each other. The attacker must be fighting the victim from or with the vehicle for it to qualify. It can qualify for this trope if the victim does have a vehicle, but one which is at a severe disadvantage against the attacker's vehicle and can't fight off the attacker (jetpack versus spaceship, motorcycle versus helicopter, car versus helicopter, etc.). As a general rule, things like jetpacks and skateboards do not qualify as a vehicle.\\nHelicopters tend to be a particular favorite for this trope, but anything from a motorcycle to a spaceship can qualify. Also, while this trope is not limited to villains, it's considerably rarer to see heroic examples since it's one of the dirtier techniques in the book.\\nPops up frequently in Video Games, though not uncommon in other media. Also Truth in Television; see pretty much any vehicle designed for combat purposes, or any crime where the weapon was a car or other vehicle.\\nCompare Vehicular Combat, where the emphasis is on the vehicles fighting each other, and Vehicular Sabotage, when a character's vehicle is maliciously tampered with before they drive it. Not to be confused with Car Fu, which is when the vehicle is turned into a makeshift weapon. However, the two are likely to overlap."
    },
    "name": "Vehicular Assault",
    "rdf_element": "VehicularAssault/int_691166df",
    "short_name": "VehicularAssault",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/VehicularAssault"
  },
  {
    "categories": [
      "NarrativeDevices"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "In Die Hard with a Vengeance, like the Terminator example above, Zeus could hotwire the car since as an electrician he knows how - or just stick his pocketknife in the ignition and turn.",
      "general": "A very exotic device or problem, against which all manner of intricate, powerful devices or strategies fail, is counteracted by something incredibly simple and mundane. It can't be solved by their conventional solutions of More Dakka, Attack! Attack! Attack!, diplomacy, or other Rule of Cool applications. Applied Phlebotinum, it seems, often turns out to have a weakness to some household product.\\nSupernatural beings in both Eastern and Western mythology have a tendency for strange weaknesses, like a demon's obsessive-compulsive need to count dropped grains of rice or a vampire's vulnerability to garlic and sunlight.\\nCan be preceded by someone Stating the Simple Solution, followed by a Face Palm and/or a Glad I Thoughtof It moment.\\nCompare Cutting the Knot. Contrast with Mundane Utility, where something exotic is used to solve something mundane, and Weaksauce Weakness, where a no less powerful individual gets strange weaknesses or power. Related to Muggles Do It Better."
    },
    "name": "Mundane Solution",
    "rdf_element": "MundaneSolution/int_691166df",
    "short_name": "MundaneSolution",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/MundaneSolution"
  },
  {
    "categories": [
      "GunsAndGunplayTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "An alternate ending to Die Hard with a Vengeance includes John McClane playing a variant of Russian Roulette with Simon Gruber using a Chinese rocket launcher with the sights removed, so they can't tell which end is the muzzle. He asks Simon a series of questions, and eventually asks a question that Simon gets wrong.  Turns out that the answer to the question is that he forgot to bring a flak jacket, which is what McClane is wearing and this would have protected Simon from the blast of the rocket, and the rocket fires on Simon, killing him instantly.",
      "general": "In the world of fiction, rocket-propelled weaponry create negligible, if any, backblast. The characters shown using such weapons are thus able to use rocket launchers with their backs to a wall or within an enclosed space; as if the rocket just levitates away instead of being accelerated by the thrust of a strong jet.\\nIn Real Life, if you fire a recoilless rifle or rocket launcher in an enclosed space it will create so much pressure that you have a high chance of being killed by it. Additionally, firing them with your back to a wall will result in the hot rocket exhaust being deflected back at you and severely burning or possibly killing you. Not to mention that standing immediately behind them will result in grievous injury or death. And then there's the fact that the huge flash of flame and cloud of smoke coming out of the back of the weapon (and maybe even a big black triangular scorch mark on the ground behind you, pointing directly at you, depending on the weapon and the terrain) will probably be highly visible to anyone looking in your direction, no matter how well camouflaged you were a moment ago, so you will gain the immediate, sincere, and complete attention of everyone on the battlefield.\\nNote however, that this does not apply to all recoilless weapons: there are some rocket launchers which utilize some kind of \\\"soft launch\\\" to eject the rocket from tube before the rocket motor ignites. Others may utilize counterweight or frangible material that counterbalances the effect of recoil and/or reduces the effect of backblast. Nevertheless, many contemporary and most past rocket launchers or recoilless rifles lack these sort of features, and among their number are those that are most often portrayed in media.\\nSee the Law of Inverse Recoil for a related weapons trope and Toasted Buns for another trope involving missing rocket exhaust. Real Life aversions may be related to Too Dumb to Live.\\nThis trope is so common that only aversions and subversions should be listed."
    },
    "name": "Missing Backblast",
    "rdf_element": "MissingBackblast/int_691166df",
    "short_name": "MissingBackblast",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/MissingBackblast"
  },
  {
    "categories": [
      "ActionAdventureTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Subverted in Die Hard with a Vengeance, where the bomb squad guy is cutting wires left, right, and center, but nothing happens at all... he stays to the end. When the timer hits 0, he finds it's a fake.",
      "general": "In fiction-land, disarming just about any bomb is a matter of cutting the right wires in the right order \\u2014 usually each wire will be given a distinctive color, and an assistant will read from a manual: \\\"Clip the red wire, then the blue wire, then the yellow wire...\\\" The implication is generally that if the wrong wire is cut, the bomb will explode instantly, killing the person disarming it and everyone else in the blast radius. Combines Race Against the Clock with the need to make absolutely sure you're making the right decision for dramatic tension. Of course it's never as easy as just following the manual \\u2014 generally some kind of subversion is used to heighten tension.\\nKnown permutations:\\n The red wire isn't there.\\n All the wires are the same color.\\n Cutting any wire at all is a bad play.\\n The hero is colorblind, or the lighting makes him effectively colorblind.\\n The guy reading from the manual changes his mind between maybe red, maybe blue ... are any of 'em green?\\n The guy with the manual says \\\"red\\\", the hero says \\\"Frack it!\\\" and yanks out the whole snarled-up mess of wires, or cuts the blue one and... there is a big explosion.\\n The guy with the manual tells the hero to cut the red wire. He goes on to do so, but just as he's about to cut it (sweat in his eyes and all) \\u2014 or already has \\u2014 the guy says \\\"NO!! STOP!! It's not that one!\\\". Even if there's no manual guy, the hero will usually change his mind about which wire to cut at the last second.\\n The color is one the cutter doesn't know: taupe, ochre, turquoise, umber, etc.\\n The guy reading from the manual says something like \\\"It says to cut the blue wire..\\\" * snip* \\\".. after cutting the red one..\\\"\\n The hero just throws the bomb out the window.\\n An expert arrives and simply flips the OFF switch on the bomb to deactivate it.\\n The hero/expert futilely tries to defuse the bomb. The other person watching (usually another member of the team if the hero is trying to defuse the bomb, or if the expert is defusing the bomb, then the hero is watching) gets frustrated and shoves the hero/expert out of the way and punches the control panel. This may result in two different endings. One is that the bomb shuts down to the hero/expert's surprise, or two, the bomb skips the timer and just detonates, Hilarity usually ensues.\\n The bomb explodes... harmlessly (with a shower of confetti or powder, maybe a large \\\"BANG\\\" sign), and we're shown it was all a test that the hero just failed.\\n There is more than one bomb. If the bomb goes off, the next guy knows to cut a different wire.\\n There ARE no wires.\\nAt no point is there a plausible explanation as to why a homemade bomb should conform to any color-code standard at all, especially since the designer obviously never intended for it to be disarmed in the first place. The Fridge Logic as to why he would be using multiple-colored wires also never comes up, even though in a home-made bomb, all the wire should have come from the same single-colored spool.\\nNaturally, a bomb intended for air-dropping (or a missile warhead) really shouldn't have any trick wires to start with. Still, it makes you wish there were an Override Command.\\nExample of a Dead Horse Trope, partly since in real life the electronics of a bomb are both simpler and more fragile than Hollywood would have you believe. The Wire Dilemma has a minor Sub-Trope in the Wrong Wire. See also Bomb Disposal and Cut the Fuse.\\n\\nExamples"
    },
    "name": "Wire Dilemma",
    "rdf_element": "WireDilemma/int_691166df",
    "short_name": "WireDilemma",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/WireDilemma"
  },
  {
    "categories": [
      "StockPhrases"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "In Die Hard with a Vengeance, Simon actively attempts to avoid this trope when he reveals he lied about planting a bomb in a school.",
      "general": "A Stock Phrase often directed towards a Big Bad or other particularly evil character. If a character is saying this, it's a good indication that whoever the statement is directed towards has either crossed the Moral Event Horizon in the character's eyes or just so happened to press their Berserk Button. Variations exist (such as \\\"You're a monster\\\" or \\\"You're rotten to the core!\\\").\\nSee You're Insane! for when a character is calling another crazy rather than evil. This can also lead to an Insult Backfire if a particularly wicked villain takes pride in this label.\\nThis trope can also be used to point out how powerful the character is. Characters who possess that much power are considered monsters by others because of their immense power. Similarly, it can be used in a show of amazement when somebody does something that incredible.\\nIn dramatic situations, this carries the same weight as the Japanese This Is Unforgivable!. Unrelated to You Bastard, but there may be overlap if the work's being fairly Anvilicious. May be the cause or effect (but mostly cause) of a Villainous Breakdown.\\nThis often shows up in What Measure Is a Non-Human? scenarios, often targeted at a character who either is or is trying to be human.\\nCompare Complete Monster, in which the audience feels that the character is irredeemable. Contrast with You Rebel Scum!, where the general populace in-story has been convinced that the protagonists are evil. See also I Am a Monster when they consider themselves to be evil or inhuman."
    },
    "name": "You Monster!",
    "rdf_element": "YouMonster/int_691166df",
    "short_name": "YouMonster",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/YouMonster"
  },
  {
    "categories": [
      "EvilTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Simon Gruber of Die Hard with a Vengeance plays with this trope like a kitten does a ball of yarn. Although he comes from a family of former Nazis, he harbors no bigoted attitudes in particular. Still, he seems to delight in making people think he is bigoted, mostly because he thinks it's fun to anger people and/or fake them out. When first speaking to Zeus Carver, for example, Simon (who is German but can mimic American Accents quite well, and who knows that Zeus is an Angry Black Man because he's been watching him on hidden video cameras) says: \\\"So whot's yowuh name, boy?\\\" in twangy, Corrupt Hick fashion just to irritate Zeus; he then apologizes, explaining that he's fond of tasteless jokes. Later the trope is seemingly played straight when Simon calls John McClane a \\\"dumb Irish flatfoot,\\\" but this is due not to anti-Irish sentiment but to Simon's general bitterness toward John for having killed his brother, Hans, in the first Die Hard movie. Simon admits that he didn't even like Hans, but he is still determined to exact vengeance on anyone who messes with his family, saying \\\"There's a difference between not liking one's brother, and not caring when some dumb Irish flatfoot drops him off a building.\\\"",
      "general": "Want to show that your Evil Overlord, or someone within The Empire is a genuine bad guy, regardless of their rank in The Empire or how minor a character they are? Simple, all you have to do is have them Kick the Dog, right? Well, what if there isn't a handy dog around? Have them kick whatever minority race/species or gender/sexuality or lower class scum is around instead to show that they're a really bad guy. Bonus points if either the heroes or some highly sympathetic character is a member of said minority.\\nDepending on how and with whom this is used, it can sometimes come across as just slightly odd. It generally works best with minor characters who have not had a lot of time in the attention of the audience, since you can easily reveal that their Hidden Depths are really rather unpleasant, thus allowing you to cement them as unlikeable or have the character graduate from being an annoying obstacle to someone the fans will cheer to see put down.\\nIt doesn't always work as well with the Magnificent Bastard Evil Overlord types, particularly if introduced late into their run as an antagonist. Because honestly, if the fandom hasn't turned against the Overlord after the character in question may have murdered thousands or even millions, enslaved people in The Empire wholesale, and so on and so forth, is having the character be a little sexist or racist really going to automatically turn people against them? (In particularly bad cases of Misaimed Fandom where the fans were already using every scrap of evidence and threadbare argument to argue that the bad guys weren't that bad, you may risk the character's fans declaring this to be a Fanon Discontinuity, and possibly even splitting the fanbase). In these cases, to make it work, you might have to do a purposeful Flanderization to your character and make them all about their bias. Of course, that will also mean you've gone and derailed your own plot if you need to do it to that extent...\\nA notable key to this is that the racism, sexism, Fantastic Racism, or whatever displayed by the character is often completely gratuitous or extraneous to the rest of their villainy. Usually, whatever their goal might be, they don't have to be a racist, speciesist, or sexist to accomplish it - but they are.\\nThis is the reason why Those Wacky Nazis and The Klan are at the bottom of the villain food chain, and it's a good bet that the Politically Incorrect Villain will be the one going down in an Even Evil Has Standards team-up.\\nAlso, people might sometimes see this trope where it doesn't exist. Some villains are simply bullying types who go after minorities without really caring whether people will find it politically incorrect or not - and it doesn't have to matter if their targets remind them of themselves in some way. Why do they do this? Genre savviness, primarily; after all, minorities lack the numbers to fight back, and there's nothing to be gained from Bullying a Dragon.\\nCompare Evil Is Petty and He-Man Woman Hater; Contrast Equal-Opportunity Evil. Note however that they are not mutually exclusive; a villain can be progressive towards some groups but intolerant towards others. Compare and contrast the Politically Incorrect Hero. May lead to Felony Misdemeanor if this character type is thought to be more evil than outwardly flamboyant villains. Any and all instances of Those Wacky Nazis qualify automatically, and A Nazi by Any Other Name often does.\\nThis is not when a villain is a minority who is portrayed in a politically incorrect manner. That's Unfortunate Implications, assuming it's unintentional. This should also not be confused with Values Dissonance, where the author apparently has these attitudes."
    },
    "name": "Politically Incorrect Villain",
    "rdf_element": "PoliticallyIncorrectVillain/int_691166df",
    "short_name": "PoliticallyIncorrectVillain",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/PoliticallyIncorrectVillain"
  },
  {
    "categories": [
      "NarrativeDevices"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "In Die Hard with a Vengeance, there is an offhand reports about thirteen dump trucks being stolen the night before. Later in the film, it is revealed that these trucks are being used by the villains to cart off the gold they have stolen.",
      "general": "In a Detective Drama, any time a piece of dialogue comes along which is off-the-cuff, not followed up and unrelated to everything, you can tell it's going to be very important. If a suspect turns up late and says \\\"Sorry I'm late, my car was stolen yesterday\\\", the alleged car theft will be significant. If the detective remarks that the suspect has a nice keychain and the suspect says \\\"Yeah, it's from my old fraternity\\\", the insignia on the keychain will turn up later to reveal that the suspect and victim were in college together. Basically this happens whenever the writer can't find a neat way of dropping an important clue into an existing conversation.\\nSee also Chekhov's Gun.\\nRelated to the Law of Conservation of Detail"
    },
    "name": "Notable Non Sequitur",
    "rdf_element": "NotableNonSequitur/int_691166df",
    "short_name": "NotableNonSequitur",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/NotableNonSequitur"
  },
  {
    "categories": [
      "InfauxmationDesk"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "John McClane has to fake this in Die Hard with a Vengeance, when a madman makes him wear a billboard insulting Afro-Americans while in his underwear. His future partner in adventures saves him by claiming his insanity, and he runs with it. And in general, McClane has his moments where he appears \\\"unhinged\\\". He does this for various reasons, either to fool and confuse his enemies, or to cope with the crap he has to go through.",
      "general": "It's pretty much a given that no-one takes crazy people seriously. It's also a given that a lot of people give crazy people a wide berth lest they flip out on them. A lot of people are aware of this and choose to take advantage of it, although their reasons for doing so vary from one character to the next. Sometimes the apparent nutcase is actually perfectly sane, other times they actually are a little on the Cloudcuckoolander side (or maybe more than a little) but deliberately play it up to the Nth degree so that they appear to be far crazier than they actually are. If they are not the point-of-view character, the question may be left open.\\nNot to be confused with Insanity Defense. Compare Obfuscating Stupidity, where people pretend to be dimwitted instead of crazy.\\n\\nExamples"
    },
    "name": "Obfuscating Insanity",
    "rdf_element": "ObfuscatingInsanity/int_691166df",
    "short_name": "ObfuscatingInsanity",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ObfuscatingInsanity"
  },
  {
    "categories": [
      "Starwars"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Die Hard with a Vengeance has Zeus, who got roped into John McClane's bomb-diffusing adventure after trying to protect McClane from a street gang without realizing what was happening. They become friends by the end.",
      "general": "Most of the hero team is eager and ready to go on another adventure, face peril, and explore new regions. Not this guy. This guy would rather stay home, where it's safe. Maybe he doesn't really think the trip is worth it, maybe he doesn't care, or maybe he just has an aversion to painful, dangerous situations. Yet the team wants him to come, so, kicking and screaming if necessary, he comes along anyway.\\nNone too happy about constantly being dragged along on adventures, you can usually find this one complaining and making sarcastic remarks, but, when push comes to shove, you can bet that he'll show his heroic traits in the clutch.\\nContrast the Sour Supporter, who doesn't believe it will work but will contribute anyway (although with sardonic comments), and The Load or The Millstone, who may or may not be supportive but whose actions and/or very existence work against the heroes' purposes.\\nA variation on The Complainer Is Always Wrong and I Do Not Like Green Eggs and Ham. Most Drag Alongs are also Butt Monkeys or Chew Toys, which may justify their reluctance.\\nCompare Refusal of the Call, Cowardly Sidekick, Cowardly Lion, Grumpy Bear, I Just Want to Be Normal, Dragged by the Collar.\\nContrast The Team Wannabe but do not confuse with the Tagalong Kid. Also not to be confused with Dragged into Drag."
    },
    "name": "The Drag-Along",
    "rdf_element": "TheDragAlong/int_691166df",
    "short_name": "TheDragAlong",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TheDragAlong"
  },
  {
    "categories": [
      "EvilTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Used again the Die Hard with a Vengeance when Simon reveals that McClane killed his brother, Hans, despite Simon revealing that he hated his brother.",
      "general": "Being evil doesn't always mean hatred and negativity 24/7. Even evil characters (and real people) can find someone to love. Often, that love is twisted, a cause for villainy, or an act but sometimes a work can show an evil character's love is genuine and deep. This serves to humanize the character, to give the hero doubts about fighting him/her, or to provide a weakness for the hero to exploit. At an extreme end, can provoke Mama Bear or Papa Wolf reactions if they are threatened, or prompt the loved ones to Avenging the Villain.\\nEven Bad Men Love Their Mamas and Unholy Matrimony are subtropes.\\nCompare Even Evil Has Standards, Morality Pet, Mad Scientist's Beautiful Daughter, Daddy's Little Villain, Villainous Friendship. If the evil character in question is a mook, and said love brings them in conflict with their own boss, that's Even Mooks Have Loved Ones. Can often overlap with Moral Myopia when the villain sees no problem with their own methods, until those methods are turned on the ones THEY love."
    },
    "name": "Even Evil Has Loved Ones",
    "rdf_element": "EvenEvilHasLovedOnes/int_691166df",
    "short_name": "EvenEvilHasLovedOnes",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/EvenEvilHasLovedOnes"
  },
  {
    "categories": [
      "WeaponsAndWieldingTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Mentioned and seen in Die Hard with a Vengeance. As the two heroes are attempting to get from a bridge to a ship passing under it, Zeus says they should jump to the attached crane. John Mc Clane says the cables would cut them in half. Then when they use the winch on an SUV to climb down, the ship pulls the car off the bridge, leaving the hook and cable attached to the crane. As it swings, it hits a henchman. Zeus and John are then seen dragging him by his arms and legs. About eight feet apart...",
      "general": "Razor floss is when any long, thin material \\u2014 string, thread, fine wire, etc \\u2014 is used as a weapon with Absurd Cutting Power. Odd as it may sound, strings can become deadly weapons in the right hands. Besides restraining enemies and even controlling other people's bodies against their will, or triggering traps, they can be pretty handy for cutting. In many works of fiction, one skilled enough, can use strings to cut opponents or even boulders, without hurting themselves. Naturally, monsters of the humanoid arachnid variety can usually be counted on to be using this trope.\\nFantasy settings generally have this type of string made of human hair, while in more modern ones it's probably monomolecular wire. In series less reliant on the Rule of Cool, the wire usually manifests as garrotes or tripwires, with varyingly messy outcomes.\\nWhat the audience sees usually amounts to Sword Lines sans the sword. Can be counted on to inflict an absurdly Clean Cut on its victims.\\nIn reality, cables and metal wires can be used to inflict not so clean but still pretty nasty wounds, provided they are of the right material and/or sufficient force is applied. Cheese slicers frequently use thin metal wires stretched in a metal frame to accomplish this trope, for instance. The monomolecular form is an eternal dream of materials engineering: any material with enough tensile strength to be used as razor floss could be woven into cables of the sort needed to build a Space Elevator. note\\u00A0Carbon nanotubes could fit the bill if some hitches can be solved: production defects involving single atoms out of place can cut their strength by up to 85%\\nA rarely addressed aspect of the trope occurs when the razor floss breaks or is cut. In such situations it may snap back at the user like a rubber band.\\nCompare Whip Sword and Killer Yoyo. Subtrope of Absurd Cutting Power."
    },
    "name": "Razor Floss",
    "rdf_element": "RazorFloss/int_691166df",
    "short_name": "RazorFloss",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/RazorFloss"
  },
  {
    "categories": [
      "HorrorTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "In Die Hard with a Vengeance, Simon makes a phone call to the FBI car after the Wall Street subway station bombing. Despite Cobb making a stern order to the others to not tell Simon where they are, when Simon talks and gives them his bomb threat, he asks them who is in the van with them, and comments about Andy Cross and Phil Jarvis, the two federal agents in the van, and Jarvis's habit of fidgeting with his glasses. Once we see the emergency vehicles move out, we see that Simon is standing on the rooftop right nearby, watching them.\\n Also when he demands to know why McClane didn't answer a certain payphone when he was supposed to. McClane tells him off, only to have Gruber say \\\"All you had do was say that there was a fat woman on the phone and that you couldn't get her to hang up\\\", thus revealing that he's watching them, as that is in fact exactly what had happened.",
      "general": "This is the creepy counterpart to Short-Distance Phone Call. It's when someone calls another person from a cell phone. At first the person being called believes the caller to be far away, but then the caller makes a comment like \\\"nice outfit\\\" or whatever, and the person being called realizes he or she is within line of sight of the caller.\\nNeedless to say, it was even creepier before cell phones came around.\\nAlso related to The Calls Are Coming from Inside the House. See also Harassing Phone Call. Not to be confused with You Can See Me?."
    },
    "name": "I Can See You",
    "rdf_element": "ICanSeeYou/int_691166df",
    "short_name": "ICanSeeYou",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ICanSeeYou"
  },
  {
    "categories": [
      "RaceTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "In Die Hard with a Vengeance , the Big Bad of the film, portrayed by Jeremy Irons, blackmails John McClane into standing on a street corner in the middle of Harlem wearing a sandwich board that reads \\\"I Hate Niggers\\\". He very nearly gets killed by a gang of local street thugs but is saved by Zeus. Note that when they were filming the scene, Bruce Willis wore a sign saying \\\"I Hate Everyone\\\", because they were genuinely worried that he'd get killed. They photoshopped it after.\\n In order to avoid racism the TV edit keeps the \\\"I Hate Everyone\\\" sign. Of course this means the black people in the neighbourhood appear to attack McClane for no real reason leading to some Unfortunate Implications.",
      "general": "A character says or accidentally does something that is interpreted by everyone else as being racist, and they proceed to chew him out for it or start shunning him for it. If it is not the main plot for the story, it can be quickly cleared up, but otherwise, any attempt to prove that he's not really racist ends up backfiring and making him look even more racist. Appearing to look xenophobic in front of foreigners is a common variant.\\nIf the people who believe this person prejudiced are themselves prejudiced, they'll be proud of him, leading to Your Approval Fills Me with Shame. The character may also try (unconvincingly) to deny it by saying \\\"Some of My Best Friends Are X.\\\"\\nCompare Discriminate and Switch, Stereotype Reaction Gag, Calling Me a Logarithm.\\n\\nExamples"
    },
    "name": "Mistaken for Racist",
    "rdf_element": "MistakenForRacist/int_691166df",
    "short_name": "MistakenForRacist",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/MistakenForRacist"
  },
  {
    "categories": [
      "DiscreditedTrope"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Die Hard with a Vengeance",
      "general": "In many sequel names, particularly in schlock horror, the title, or sub-title, describes some kind of return, revenge, reaction, counter-force, backlash, etc. that usually implies it's a direct consequence of one of the previous installments. The movie's tagline might even be something like \\\"And this time, It's Personal.\\\"\\nAlso expect \\\"Son of _____\\\" and \\\"Bride of _____\\\".\\nCompare There's No \\\"B\\\" in Movie. Subtrope of Stock Subtitle."
    },
    "name": "Revenge of the Sequel",
    "rdf_element": "RevengeOfTheSequel/int_691166df",
    "short_name": "RevengeOfTheSequel",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/RevengeOfTheSequel"
  },
  {
    "categories": [
      "FilmTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Die Hard with a Vengeance: In New York City.",
      "general": "Sometimes a sequel is just the same story as the last one (Capcom Sequel Stagnation), or downgraded by being Direct-to-Video (Starship Troopers 2: Hero of the Federation), or a different story set in the same world (The Godfather II, the Star Trek films), or just the next part in an ongoing series (Star Wars, The Lord of the Rings books and movies), or even a Dolled-Up Installment (Super Mario Bros. 2).\\nThis trope, on the other hand, is when a sequel is made to be \\\"bigger and better\\\" than the last film, by taking one or more elements from the first film and expanding upon it. The film makers feel a need to \\\"top themselves\\\" in a sort of way.\\nTake an action sequel, which has more explosions and fist/gun/martial arts fights than the previous film. Or a slasher sequel, which has more deaths, in more gory (and less realistic) ways. Sometimes what get expanded is the plot: What started as a simple and straightforward plot in the first part may become significantly expanded, deeper and more intricate in sequels.\\nHow often this works depends on if the expanded element is the one the audience liked. Choose the wrong element(s), and it will be at the expense of the right element(s), and the audience will not be pleased. Wrong elements can often be the toilet humor, sexual situations, flanderization or meaningless action sequences.\\nHowever, choose the right element(s), and the sequel may even be considered superior to the first film. Usually these elements involve the human element, expanding on the characters we care about, telling a dramatic (or hilarious) story, and making the action sequences revolve around that.\\nUsually, the result is somewhere in the middle, often debated upon by the fans.\\nTo avoid just rehashing examples from Sequelitis, examples here should discuss the expanded element(s) of the sequels.\\nCompare Actionized Sequel, Sequel Difficulty Spike, Send in the Clones, Serial Escalation, Up to Eleven, Sorting Algorithm of Evil, Power Creep. Big Damn Movie is this trope applied to a film adaptation of a serial. Darker and Edgier often, but not always, accompanies the upping of the stakes in sequels.\\nContrast Lensman Arms Race and Plot Leveling (both of which could be seen as symptoms of this trope's presence), Sequel Difficulty Drop (difficulty getting lowered, although that doesn't preclude this trope in other ways)."
    },
    "name": "Sequel Escalation",
    "rdf_element": "SequelEscalation/int_691166df",
    "short_name": "SequelEscalation",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SequelEscalation"
  },
  {
    "categories": [
      "JustForPun"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "In Die Hard with a Vengeance, the terrorists claim they want John McClane to go to Yankee Stadium to collect a clue to stop the bomb that will blow up a school. In truth, there is a sniper at the stadium who will shoot him if he shows up. (Zeus appears at the stadium, but given the orders were to kill both, he lives)",
      "general": "A person getting murdered at a sporting event. Creates a situation where there might be hundreds of witnesses, thousands of suspects, but isn't necessarily easier for the detectives.\\nTitle is a reference to the unofficial anthem of baseball. The quote is Silent Hunter's re-write of the lyrics of the chorus."
    },
    "name": "Take Me Out at the Ball Game",
    "rdf_element": "TakeMeOutAtTheBallGame/int_691166df",
    "short_name": "TakeMeOutAtTheBallGame",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TakeMeOutAtTheBallGame"
  },
  {
    "categories": [
      "WeaponsAndWieldingTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "John McClane does this on Targo in Die Hard with a Vengeance.",
      "general": "Related to Whip It Good and Epic Flail, sometimes the chain link is all you need, without the weight at the end. In less realistic works, skilled users can make Instant Knots with it.\\nA Badass Biker will often do this in a rumble. Also very common in 80s movies with street gangs and among fictional Japanese delinquents. See also Fighting with Chucks, Variable-Length Chain, Chained by Fashion and Whip It Good. Sub-Trope of Improvised Weapon."
    },
    "name": "Chain Pain",
    "rdf_element": "ChainPain/int_691166df",
    "short_name": "ChainPain",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ChainPain"
  },
  {
    "categories": [
      "StockPoses"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Die Hard with a Vengeance: Simon walks like this when entering the Federal Reserve Bank vault he's about to rob.",
      "general": "He's the Big Boss, the Evil Overlord, or some other higher-up either good or bad. When he receives people in his office, instead of looking at them directly, he talks with his back to them while looking out the window, probably with his arms folded behind him.\\nUsually intended to convey that the character is so badass he can't be bothered to look at his audience, this is sometimes used to indicate an internal conflict of some sort (depending on his facial expression). Also has the bonus of keeping his identity a secret, up until the Chair Reveal or Shadow Reveal\\nIf the other character is a trusted lieutenant or confidant, the senior figure may ask them to look out the window and \\\"Tell me what you see\\\" in order to segue into making a point.\\nThis may be part of The Faceless.\\n\\nExamples"
    },
    "name": "Contemplative Boss",
    "rdf_element": "ContemplativeBoss/int_691166df",
    "short_name": "ContemplativeBoss",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ContemplativeBoss"
  },
  {
    "categories": [
      "CharactersAsDevice"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Katya from Die Hard with a Vengeance is mute from an assassination attempt that left prominent scarring on her throat. However, in her final scene, she does scream angrily (and incoherently) while firing on John McClane and Zeus Carver.",
      "general": "Someone who does not speak onscreen because he cannot speak at all.\\nHe is intelligent; he does show signs of sentience to us, the viewers\\u2014just not to the other characters. He may be able to vocalize onscreen, but it won't be in a known language\\u2014probably just the occasional sigh, gasp, or other such non-speech sounds\\u2014and none of the characters will be able to interpret what he says. He will be able to gesture, but this may or may not convey any meaning to the other characters; they may play charades with him to figure out what he has to say. In extremis, may lapse into Talking with Signs\\u2014but only we the viewers get to see the signs.\\nOften surprisingly competent, and tends to understand what's going on better than voiced characters, while being hilariously unable to communicate that understanding.\\nOne popular use of this character is the Silent Snarker: while they never have any lines, they are highly facially expressive and used for many a Reaction Shot, Facepalm or visual This Is Gonna Suck.\\nOne form of He Who Must Not Be Heard. The opposite is The Unintelligible, whom the characters understand, but we don't. Contrast also The Voiceless, who can talk, but just doesn't whenever we're watching. See also Heroic Mime and Cute Mute. May utilize a Voice for the Voiceless or Mouth of Sauron.\\nCompare Pantomime Animal."
    },
    "name": "The Speechless",
    "rdf_element": "TheSpeechless/int_691166df",
    "short_name": "TheSpeechless",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TheSpeechless"
  },
  {
    "categories": [
      "DuoTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "John McClane and Zeus Carver in Die Hard with a Vengeance. Subverted in that neither one of them have much of a respect for authority.",
      "general": "A variation on the Odd Couple, involving a white person and a black person. Usually, the white person is a strait-laced by-the-book type, while the black person is a funky, urban type who doesn't have much respect for authority. Most commonly, they're cops, assigned as partners after their old partners die/get disgusted and walk away. Generally, the two make a fairly good team if they can work out the personality clashes, with the strengths of one covering for the weaknesses of the other.\\nSalt And Pepper seems to be becoming subverted more often today due to increased racial awareness, so that it's the white person who's a rebellious hothead, and the black person is smart and savvy. Another common subversion is for the black guy to be uptight and the white guy to be relaxed. An alternate version is a pairing of a white character with a Hispanic character called a Cafe con Leche. Please note, however, that being two different races isn't enough for this trope. There must be some kind of contrast in their personalities for it to work.\\nFor American media, this may be more common in the movies (Lethal Weapon, Die Hard 1 2 and 3) than on TV as television shows often seem more segregated.\\nSee also Black Best Friend. Irishman And A Jew is an older variation of this trope. If they're not different races, the trope is All Work vs. All Play."
    },
    "name": "Salt and Pepper",
    "rdf_element": "SaltAndPepper/int_691166df",
    "short_name": "SaltAndPepper",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SaltAndPepper"
  },
  {
    "categories": [
      "Dialogue"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Subverted in Die Hard with a Vengeance, as Simon agrees with McClane that Hans was an asshole. But \\\"there is a difference between not liking one's brother and not caring when some dumb Irish flatfoot drops him out of a window.\\\"",
      "general": "Regardless of how disliked or embarrassing a person was in life, no matter how odd they were considered, or what crimes they had committed, the moment they leave this mortal coil, a Nostalgia Filter falls into place causing the deceased to be remembered as being better than they were, for the most part. For some people, the reasoning is that the dead person isn't here to defend themselves anymore, or at the very least cannot continue to do the unpleasant things they were reviled for anymore.\\nAn Asshole Victim can be \\\"spared\\\" this provided they were enough of an asshole. Alternatively, can be a justification for Alas, Poor Scrappy.\\nVillains, particularly ones at the lighter end of the Sliding Scale of Antagonist Vileness, will sometimes extend the same courtesy to fallen heroes (particularly ones they regarded as a Worthy Opponent).\\nDefinitely Truth in Television, as the idea has been around since at least the 4th century. Whether or not it should be is rather contentious. Plenty of people seem to deride it for those they hate but invoke it for public figures they like. An alternative formulation, suggested by Christopher Hitchens (who loved speaking ill of the dead) is: \\\"Never say anything nasty about the dead that you weren't brave enough to say while they were alive. Everything else is fair game.\\\"\\nSee also Treachery Coverup, Unacceptable Targets and Dead Artists Are Better. If people choose to lie to preserve the departed's reputation, they're using The Power of Legacy.\\nContrast with Speak Ill of the Dead for the serious version and The Fun in Funeral for less serious ones.\\nThis is a Death Trope, so expect UNMARKED SPOILERS!"
    },
    "name": "Never Speak Ill of the Dead",
    "rdf_element": "NeverSpeakIllOfTheDead/int_691166df",
    "short_name": "NeverSpeakIllOfTheDead",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/NeverSpeakIllOfTheDead"
  },
  {
    "categories": [
      "ActionAdventureTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "In Die Hard with a Vengeance, McClane flees the water gushing through the aqueduct in a dump truck when the villains attempt to drown him.",
      "general": "The character is chased down a tunnel by something very large, clich\\u00E9dly a boulder or a giant monster. There's only one thing to do: RUN!!\\nThere's no stopping the rolling boulder. You cannot avoid it or reason with it. It will just keep rolling towards you, destroying everything in its path until it makes sure you are a steaming, bloody pancake on the floor. The only way out is to race down the corridor as fast as you can, and finally dive into some passageway that is too small for it to enter when you reach the end. Alternatively, clearing a pit which the obstacle will fall into will also do the trick.\\nIn the event that the chase takes place outside in open space, it sometimes seems that the characters can only run forward.\\nClosely related is a bridge that collapses in the hero's wake.\\nWhile often an extended sequence, an Indy Escape scene can also be used as part of a Death Course.\\nIn video games, it is sometimes possible to get behind the rolling obstacle of doom, making the whole stage much easier. In 3D video games, the camera will often fixate on the boulder and obscure the path you have to run, making the whole stage much harder.\\nCompare with Rise to the Challenge, Escape Sequence and Descending Ceiling. When the pursuing object or creature is full screen height, it's an Advancing Wall of Doom. After the escape is over, expect someone to quip \\\"Wasn't That Fun?\\\"\\nUnrelated, despite the name, to the Indy Ploy. In order to turn an Indy Escape into an Indy Ploy, the character would have to improvise pretty quickly.\\nIf there are some nooks and crannies along the way, but a neverending supply of hazards as well, it's a Corridor Cubbyhole Run. If it's actually possible to evade the danger by moving sideways out of the way, but our character never does, he or she has fallen prey to One-Dimensional Thinking.\\nSee also Raiders of the Lost Parody."
    },
    "name": "Indy Escape",
    "rdf_element": "IndyEscape/int_691166df",
    "short_name": "IndyEscape",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/IndyEscape"
  },
  {
    "categories": [
      "GunsAndGunplayTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "At the end of Die Hard with a Vengeance, McClane asks for a gun and is given a tiny revolver of which he is extremely disdainful. Subverted in that he manages to take out the helicopter attacking him with it by shooting some overhead power lines.",
      "general": "A character treats a small firearm with contempt. The firearm will likely be physically small and will probably fire small-caliber ammunition, which is considered by some users to be weak.\\nThere is a common perception that any round smaller than a .38 Special is essentially a joke bullet unable to do any real damage. The truth is that Bullets Do Not Work That Way. Guns, by definition, are weapons that are designed to kill. Just about any gun made today can inflict a mortal wound in one shot, though a small caliber bullet probably won't drop you on the spot. Even the oft mocked .22 Short can tear deep enough into a human body to tear major veins and arteries, and if the bullet reaches the throat or vital organs the damage will be severe. Even air weapons firing small pellets at low speed can inflict lethal injuries if they hit someone in a critical area such as the temple or the heart. This is exactly why airsoft events have very strictly enforced safety rules about minimum engagement distances and protective equipment. It's also why it's both frequently forbidden and a bad idea to use frozen paint balls.\\nThe idea that small-caliber and/or low-powered weapons are useless in combat probably comes from the somewhat vague notion of \\\"stopping power\\\" and that Bigger Is Better in this regard. Even wounds that are fatal will generally not result in an Instant Death Bullet, and it is not unknown for a target to keep going after having been shot, sometimes not even noticing. So the theory goes that larger caliber weapons are more likely to ensure that a target will actually stop in fewer shots. The other side of the argument is that most of the \\\"evidence\\\" for stopping power is almost purely anecdotal and no scientific mechanism for its function has been confirmed. Furthermore many comparatively smaller guns can have twice the rounds (or more) per magazine versus a massive Hand Cannon as well as far less recoil and weight so are \\\"more likely\\\" to be accurate. While certainly size does matter in ballistics the debate mostly centers around weapons of the same type (pistols vs pistols, rifle vs rifles) not a Derringer next to a .50 BMG sniper rifle thus the differences are comparatively small.\\nSince you can't exactly subject live humans to rigorously controlled lethal testing its doubtful that debate will end any time soon.\\nOften popular as a Hidden Weapon stored in Victoria's Secret Compartment. For the opposite end of the spectrum, see Hand Cannon and BFG."
    },
    "name": "Little Useless Gun",
    "rdf_element": "LittleUselessGun/int_691166df",
    "short_name": "LittleUselessGun",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/LittleUselessGun"
  },
  {
    "categories": [
      "GunsAndGunplayTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "In Die Hard with a Vengeance Zeus (another Samuel L. Jackson character) is holding up the entire bad guy parade with a gun, at which point Simon Gruber walks up to him, promptly explains that Samuel L. Jackson of all people forgot to turn the safety off, then captures him.",
      "general": "The armed victim has the killer in her gunsights and at her mercy (it's usually a woman in these situations), but the killer knows they have nothing to fear. The victim is either unable or unwilling to use her weapon as the killer walks up to her and plucks the gun out of her hands, leaving her a tearful heap begging for her life. Often involves a Breaking Speech. If she had captured him beforehand or otherwise cornered him but doesn't shoot, then it's a Hannibal Lecture.\\nCompare You Wouldn't Shoot Me."
    },
    "name": "Defensive Failure",
    "rdf_element": "DefensiveFailure/int_691166df",
    "short_name": "DefensiveFailure",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/DefensiveFailure"
  },
  {
    "categories": [
      "SoundFXTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "While John McClaine is driving through a park in Die Hard with a Vengeance, he's asked if he's aiming for people. \\\"No...\\\" (Wilhelm scream) \\\"Except for maybe that mime.\\\"",
      "general": "Overused Stock Sound Effects can screw with a TV viewer's attention span \\u2014 repeated use makes them instantly recognizable to those in the know. One of the worst offenders is the Stock Scream \\u2014 one of several vocal effects used when a character has to scream and the sound the actor recorded isn't loud or piercing enough. From the popularity of some stock \\\"scream\\\" effects, you would think they were the only ones in existence. Currently there are about 15 commonly used stock screams, most of which have yet to be named.\\nLooking for an Instant Wilhelm Scream? Look no further."
    },
    "name": "Stock Scream",
    "rdf_element": "StockScream/int_691166df",
    "short_name": "StockScream",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/StockScream"
  },
  {
    "categories": [
      "GunsAndGunplayTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "In Die Hard with a Vengeance, the security guard in the bank vault fires his shotgun about 15 times before coming up empty, nearly twice as many shells as a typical law-enforcement model can hold.",
      "general": "Possibly one of the oldest and most abused tropes when it comes to gunplay is the frequent ignorance of just how many shots the good guys/bad guys have fired from their guns without stopping for a reload. In Real Life, most revolvers hold between 5 to 8 shots, depending on caliber, while semiautomatic handguns have magazines that usually hold 10\\u201315 shots. Pump-action, bolt-action, and lever-action longarms generally hold 5\\u20138 rounds (but the magazine can easily be topped off) and detachable-magazine semi-automatic or automatic rifles generally hold at least 20, if not 30 rounds.note\\u00A0That great big circular magazine seen on the classic Thompson Submachine Gun in gangster movies holds 50 rounds in real life, and an even bigger one holds 100. But keep a running count, and you'll sometimes see a weapon go for much longer without hesitation.\\nAmmo capacity of guns on TV seems to be totally dependent on how much drama and suspense is needed. The hero will always have plenty of ammo to mow down the mooks, but will run out just before reaching the Big Bad, or confront him with One Bullet Left. Reloading is usually only done when it adds to the drama or when you need to show off how badass the gunslinger is. If someone is firing an automatic weapon that's belt-fed or has a large banana-shaped magazine in it, forget it \\u2014 he's never going to run out until you shoot him dead. The only thing that seems to stop a movie or TV gun from firing is the inevitable and dramatic jam.\\nCan be partially explained by editing in some of the less unrealistic movies. If multiple shots of a gunfight flow well together, shot counts might be ignored, rather than breaking the flow by putting in a reload shot.\\nThis is a common characteristic of Energy Weapons; seldom do you see a ray gun run out of zap juice.\\nAn adjunct to this would be the Bottomless Quiver for archers. Many an archer in animation and videogames can pour out a stream of arrows without ever hitting the supply cart.\\nSee also Infinite Supplies, Hammerspace. Unorthodox Reload is an aversion of this trope. Not at all related to Topless Magazines.\\nThis may end up becoming an Acceptable Break from Reality in many Video Games; who wants to pull their fighter plane over to the side to top up on the 20mm ammo in the middle of a Shoot 'em Up?\\nEven in video games where you do have to reload, typically shooters, the game doesn't keep track of individual magazines. You can reload at any point without wasting bullets or having to move bullets from one magazine to another. When the game invokes Universal Ammunition, the rules just get that much fuzzier. If you're unlucky, though, some people's magazines might be more bottomless than others.\\nA common justification in science fiction stories is that future firearms actually fire extremely tiny projectiles (hundreds or even thousands of which can be packed into a single magazine). Since kinetic energy is a factor of both mass and velocity, firing mechanisms that allow the projectile to be shot in a very, very high velocity can compensate (or more) for the size of the bullet. Stronger characters sometimes have the 'cheats' of an absurdly large magazine relative to their body size (e.g. having their gun belt-fed from a backpack) or internal magazines whose capacity cannot be accurately calculated. Neither of these can actually be bottomless, but since viewers can't tell the actual number of rounds, they're less likely to have their Willing Suspension of Disbelief broken.\\nThis trope often goes hand-in-hand with More Dakka. Compare against Counting Bullets, which is about limited magazines.\\nThere's a separate \\\"Exceptions\\\" subsection on the bottom of this page. Please post aversions and subversions there.\\nNOTE: Clips are devices used to help load cartridges into a magazine, such as the en-bloc clips used to help feed the M1 rifle's fixed magazine or \\\"moon clips\\\" used hold multiple rounds in-place for loading revolvers. It's a common and understandable mistake to mix clips and magazines up, especially since most people already refer to magazines as clips in movies or video-games. Regardless, it's a Berserk Button among many firearm enthusiasts.\\n\\nExamples"
    },
    "name": "Bottomless Magazines",
    "rdf_element": "BottomlessMagazines/int_691166df",
    "short_name": "BottomlessMagazines",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/BottomlessMagazines"
  },
  {
    "categories": [
      "DeathTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Before Die Hard with a Vengeance, the Clint Eastwood thriller The Gauntlet has a mob sniper's helicopter explode quite spectacularly after its rotor blades become tangled in some power lines.",
      "general": "Watch enough action movies, and you soon realize that the only thing more dangerous than being on a helicopter is wearing a V-neck Red Shirt or being the slutty girl in a Friday the 13th movie. They've been described as 50,000 parts flying in close formation.\\nObviously, helicopters aren't quite that dangerous in Real Life, or else we wouldn't use them for anything for fear of them haphazardly spinning out of control and crashing into everything all the time. It just wouldn't be a productive way to get around. Indeed, some helicopters, such as the Mi-24 Hind, are incredibly tough. So why do they get knocked out of the air in seemingly every movie they ever appear in? Rule of Cool. Admit it, it's just cool to watch one of these things spin out of control trailing smoke, briefly becoming a Helicopter Blender for anybody unfortunate enough to be standing around on the ground in the general area.\\nIt's particularly unfortunate if that helicopter was our heroes' ride home.\\nThis trope is about that prevalent tendency of helicopters crashing various media, as well as in situations where a helicopter crash wouldn't necessarily be expected. If a military chopper in a warzone gets hit by a rocket launcher and goes down, that's less of this and more of a Short Lived Aerial Escape\\u2014but if half a dozen helicopters get shot down in the same movie, it's probably a textbook case of this trope. If a giant monster smacks the 'copter out of the sky, it's a Helicopter Flyswatter. If a military chopper collides with another aircraft or power lines or something due to remarkably bad luck, then it's this trope. If the chopper goes down because Danger Takes a Backseat, it's this trope regardless of it being a military chopper in a warzone or not. If it's a police or news chopper getting blown up by a rocket launcher over downtown Los Angeles, it's both this trope and Short Lived Aerial Escapenote\\u00A0And for the news chopper, Deadline News as well, as you'd never really expect that sort of thing to happen.\\nIn unusual situations, such as military choppers in a straight-up fight with aliens being taken out in ways that we would consider decidedly unusual (such as the Combat Tentacles example in the Film section), just remember that Tropes Are Flexible.\\nThe fuel for this trope comes from many sources, but the most prominent of which is likely Rule of Cool (combined with Everything's Better with Spinning). Iconic scenes of Blackhawk helicopters getting shot down (an actually rare event) in the famous movie Black Hawk Down are sure to have helped this trope's staying power. It also gives plenty of opportunities for various kinds of drama, badassery, and visceral action, making it as much a tool for creators as a source of entertainment for the audience, if not more so.\\nApplies to pretty much any helicopter or helicopter-analogue (such as tilt-jet military transports in sci-fi films). See also Short Lived Aerial Escape. No relation to Hellish Horse. Subtrope of Anti-Air."
    },
    "name": "Hellish Copter",
    "rdf_element": "HellishCopter/int_691166df",
    "short_name": "HellishCopter",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/HellishCopter"
  },
  {
    "categories": [
      "CharactersAsDevice"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "John McClane in Die Hard with a Vengeance won't take money from criminals, even when it's a hell of a lot easier than getting the shit kicked out of him by them.",
      "general": "For some people, money isn't an issue. Maybe a hero's morals and convictions are so strong that he can never be bought out, not even for all the money and riches in the world. Maybe someone is so committed to a goal he'll spend all the money he has to in order to reach it. Or perhaps there are some people who just don't need the money; the warm fuzzy feeling after doing a good deed is reward enough. Whatever the reason, wealth comes second to personal values. Even a chance at matrimony may not be enough.\\nNote that this does not necessarily mean \\\"wealth comes second to good personal values.\\\" This is a very common trope for Knight Templar types, and outright Chaotic Evil villains can enact it too, as can people who prioritize amusement over personal gain.\\nOf course, it's not unknown for it to be a Secret Test of Character with a Sweet and Sour Grapes\\nCompare Money Is Not Power, Keep the Reward, Honor Before Reason, What You Are in the Dark, Doing It for the Art. The Last DJ is a specific character type who is likely to do this, although he may pay for it, especially in missed opportunities. If the character's refusal includes making the situation even worse for the offerer, that's a Bribe Backfire.\\nContrast Screw the Rules, I Have Money! (the obvious inversion of this trope), Only in It for the Money, and Every Man Has His Price.\\n\\nExamples"
    },
    "name": "Screw the Money, I Have Rules!",
    "rdf_element": "ScrewTheMoneyIHaveRules/int_691166df",
    "short_name": "ScrewTheMoneyIHaveRules",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ScrewTheMoneyIHaveRules"
  },
  {
    "categories": [
      "CharactersAsDevice"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "'Die Hard with a Vengeance: McClane himself is not a bystander this time - he's a target. It's Samuel L. Jackson's Zeus who's the Heroic Bystander.",
      "general": "When something bad happens, most people gape in fear and shock. They are the Innocent Bystanders. But sometimes one person decides to help out, and in the doing, becomes a hero. That's the Heroic Bystander.\\nThe Heroic Bystander is not someone who is normally expected to be a hero in time of crisis, such as a police officer or a lifeguard. Instead, it's an ordinary person, with no special training, who happens to save a life through their own inner courage and resolve.\\nIt doesn't have to be a life that is saved. A Heroic Bystander can also defend a person's reputation, distract a villain with a Defiant Stone Throw or help someone out who needs help, when no one else is doing so.\\nThis can be used as a device to show the growth of a character, such as having a cowardly individual show remarkable resolve in coming to someone's rescue. It can show how someone is transformed from a passive outsider, to someone who gets involved and tries to help others. Sometimes, it can be used to let a wimp have their day in the sun. Sometimes (especially in real life) a whole crowd will get involved, possibly sparked by one person showing courage to ignite the powder keg.\\nOf course, those bystanders live in a world that is basically similar to our own. An Anti-Hero of a Crapsack World (who is usually a bystander, not a Knight in Shining Armor) is something different.\\nSee also I Am Spartacus, which sometimes uses this. If he's the protagonist, then he becomes an Action Survivor. Compare Good Samaritan, Badass Bystander, Civilian Power, and Hero of Another Story.\\nSomewhere between this and a Superhero lie The Real Heroes: ordinary people in jobs that require them to do this day-in, day-out without anyone writing a comic strip about them.\\nContrast Never Be a Hero."
    },
    "name": "Heroic Bystander",
    "rdf_element": "HeroicBystander/int_691166df",
    "short_name": "HeroicBystander",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/HeroicBystander"
  },
  {
    "categories": [
      "GunsAndGunplayTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "An alternate ending for Die Hard with a Vengeance has John McClane threatening Simon Gruber with a Chinese rocket launcher with the sights removed, allowing Gruber to point the rocket whichever way he liked.  Gruber ultimately points the rocket launcher the wrong way.",
      "general": "This is a comedy weapon trope (although there are dramatic examples) featuring a gun designed or modified to fire backwards, tricking the person who uses it into shooting themselves. A common version seen in cartoons is to bend the barrel back into a \\\"U\\\" shape. Note that this trope may still come into play even if the person who might fire the gun would have to be really stupid not to notice the modification.\\nThese guns tend to show up in cartoons and spy genre pastiches.\\nDespite the trope title, other projectile weapons, such as a crossbow or hwacha Hwacha!!!, may be examples of this trope.\\nCompare Had the Silly Thing in Reverse."
    },
    "name": "Backwards-Firing Gun",
    "rdf_element": "BackwardsFiringGun/int_691166df",
    "short_name": "BackwardsFiringGun",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/BackwardsFiringGun"
  },
  {
    "categories": [
      "EmotionTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Die Hard with a Vengeance has two female examples:\\n Action Girl Connie Kowalski is pretty hard-boiled - as are almost all of the NYPD cops - but during the evacuation of the elementary school (when it's believed that a bomb has been planted there) she confesses that she might \\\"pee [her] pants.\\\"\\n Katya, Simon Gruber's Dark Action Girl, never smiles, never speaks, never even makes a sound throughout all her scenes...until the film's climax, when she and Simon are interrupted by John McClane and Zeus Carver at a very inopportune moment - and she completely loses her cool, firing off a machine gun and screaming in rage.",
      "general": "Not So Stoic is what happens when a Stoic is pushed to the edge, and falls off. This is when The Stoic loses his/her fa\\u00E7ade and shows the world (or just their True Companions) that they aren't an emotionless automaton. They may be good at hiding it but they feel just as much as the rest of us. Likely to be very heartwrenching or extremely terrifying or both.\\nIn order to qualify, the show of emotion must be a significant one, not just a small smile or subtle frown. This emotion need not be a \\\"negative\\\" one: Manly Tears over the death of a teammate are certainly un-stoic, but so is unfettered joy over their return.\\nThese outpourings of emotion usually happen only a few times throughout the series \\u2014 if the stoic is showing emotion every other episode in every season, then they aren't much of a stoic. However, these moments can also be used to illustrate a character's growth towards becoming more open to others, in which case displays of emotion \\u2014 overt and subtle \\u2014 would become more frequent over time.\\nCompare with Not So Above It All, OOC Is Serious Business and Sugar and Ice Personality. Contrast with Bad Dreams (where The Stoic can keep it buttoned up \\u2014 while awake), Rage Breaking Point.\\nWhen Played for Laughs or poorly written, it's an Out-of-Character Moment.\\nWARNING: Many Spoilers Ahead!\\n\\nExamples"
    },
    "name": "Not So Stoic",
    "rdf_element": "NotSoStoic/int_691166df",
    "short_name": "NotSoStoic",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/NotSoStoic"
  },
  {
    "categories": [
      "OlderThanDirt"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Subverted in Die Hard with a Vengeance: After being told that a bomb was in a garbage can by the phone booth, both Samuel L. Jackson and John McClane try to push people aside and then dive to the ground; when no one responds and no explosion happens, the terrorist's laughing reveals the joke.",
      "general": "A Time Bomb, superweapon, crashed car, etc. is about to explode. The heroes run as fast as they can and try to leap behind shelter, just as it explodes. Often features a cool shot of the heroes diving towards the camera.\\nVirtually every action series has had its share of these moments. In fact, it is easy to imagine that some remote civilization studying Earth through its television transmissions might conclude that Earthlings running causes Stuff Blowing Up, not the other way around.\\nCan also be done with cars, airplanes, spaceships, snowmobiles, mine carts... anything that moves, or doesn't, for that matter.\\nThough all are related to Non-Fatal Explosions, there are also two more directly related tropes. One is the Rocket Jump: an extremely hard-ass character may exploit the power of the blast as it propels them through the air to reach places they wouldn't normally have been able to. The second is combining this with Out of the Inferno: for a second it seems that the characters won't make it as the flames from the explosion reach and engulf them...Then a few second later they come out bursting through the flames, slightly parched but unharmed.\\nOn rare occasion, the characters will be made to look like fools by there being no explosion after diving into the dust (toward the camera). This will be followed by a four-count beat, to share an embarrassed moment, which will be punctuated by an explosion.\\nThe Badass often showcases just how cool he is by always calmly walking away from the building or car, and perhaps casually putting on his Cool Shades or lighting up a cigarette just as the explosion goes off. Badass characters don't have to run unless it's darned important. Cool guys don't look at explosions.\\nExamined exhaustively at the website The Reality of Running Away from Stuff.\\nFor when a character doesn't outrun the fireball and walks calmly out of and away from the fire anyway, see Out of the Inferno. See also Convection Schmonvection. In Real Life, the accepted reaction to an approaching fireball is to either jump down a deep hole and pull it in after you, or bend over and kiss your posterior goodbye. See also Bomb Disposal when this is done intentionally.\\nThe fireball is often depicted in Slow Motion.\\nContrast Riding into the Sunset."
    },
    "name": "Outrun the Fireball",
    "rdf_element": "OutrunTheFireball/int_691166df",
    "short_name": "OutrunTheFireball",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/OutrunTheFireball"
  },
  {
    "categories": [
      "ComedyTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "The end of Die Hard with a Vengeance involves the hero, John McClane, interrupting Simon, the villain, as he's about to get intimate with his wife. The normally stoic woman suddenly gets very angry at McClane.",
      "general": "A couple is about to have sex, or are in the midst of the act, but another person interrupts somehow. They have to stop to deal with the interruption. This trope can be played for comedy, drama or both. Can often lead to a Relationship Reveal. If they choose to keep going, it's Coitus Uninterruptus. If they try and keep things secret (if there is a knock on the door), it could lead to a Closet Shuffle. A subtrope of Moment Killer.\\nOften followed by a \\\"Don't you people know how to knock?\\\", because no one ever locks their door when they're getting intimate.\\nCompare to Caught with Your Pants Down for the solo version of the trope. A supertrope of Primal Scene and Parents Walk In at the Worst Time. Sister Trope to Sorry to Interrupt.\\n\\nExamples"
    },
    "name": "Interrupted Intimacy",
    "rdf_element": "InterruptedIntimacy/int_691166df",
    "short_name": "InterruptedIntimacy",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/InterruptedIntimacy"
  },
  {
    "categories": [
      "DeathTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Die Hard with a Vengeance: When the bad guys are celebrating the successful theft, they're toasting to several things and then one says along the lines of 'auf gefallen kameraden', which translates something like 'for fallen comrades'. There is a moment of silence and then they all toast in honor of their lost brethren.",
      "general": "Two or more characters gather to grieve for a dead comrade, without a formalized structure. They reminiscence about the fallen, how much he will be missed \\u2014 or has been missed.\\nAn actual wake is possible, as the bereaved can talk and drink without a ceremony to go through. Or they may meet somewhere, and talk. (They may not even intend to grieve, but they end up doing so.) A bar is likely, because the wake often involves alcohol \\u2014 so often that it generally does not appear only if it is impossible. Expect the dead to be toasted. (Drowning My Sorrows may convert into this if the drinker bumps into another friend.) Sometimes the drink is poured on the ground as a Libation for the Dead.\\nSoldiers on a mission may start to talk, and lead to this, if they are waiting for something and have lost a comrade. (The situation in which alcohol is least likely to feature. But the Military Moonshiner may have some.)\\nThe informal equivalent of a Meaningful Funeral. Possibly it immediately precedes or follows it, although that is unlikely, because the two scenes concentrate on the same emotions, and so are likely to duplicate. Also compare Personal Effects Reveal.\\nMay also feature long after the death (or deaths) as characters remember all their dead and tell stories of them. The toast is often \\\"To absent friends\\\". This can overlap with Tell Me About My Father.\\nSuitable for a Bittersweet Ending or a Downer Ending, but can happen anywhere in a story \\u2014 even as a Framing Device at the very beginning of a work that Starts with Their Funeral. Remembering the sacrifice may inspire characters to fight on, lest it have been a Senseless Sacrifice.\\nContrast Forgotten Fallen Friend, Dead Guy Junior.\\nDeath Trope. Spoilers follow."
    },
    "name": "To Absent Friends",
    "rdf_element": "ToAbsentFriends/int_691166df",
    "short_name": "ToAbsentFriends",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ToAbsentFriends"
  },
  {
    "categories": [
      "WeaponsAndWieldingTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Happens to MacClane and Zeus in Die Hard with a Vengeance after they are captured by the Big Bad.",
      "general": "A favorite execution method of Dastardly Whiplash types, this trope involves the villain tying a captured character to an armed explosive device. Cue frantic searches for the Conveniently-Placed Sharp Thing and attempts to disarm the device while still tied up (for example, a memorable scene in a Scooby-Doo, Where Are You! episode where Shaggy and Scooby attempt to put out a bomb fuse with their butts). Generally, though, disaster gets averted by the Big Damn Heroes showing up to get their pal out of Dodge before he/she gets blasted to a pile of thin gruel. Bonus points if the rescue team cuts it so close that they and their rescuee wind up Outrunning the Fireball afterward.\\nIt operates on a similar principle to Chained to a Railway, in that it's essentially a timed Death Trap. However, the myriad ways to trigger a bomb means that villains can have lots of fun with this... for instance, rigging the bomb to go off when somebody tries to rescue the victim (this is sure to mess with the victim's psyche a lot, and can also subvert a Big Damn Heroes moment by turning it into a Senseless Sacrifice.)\\nSee also Death Trap and Bound and Gagged, as this is a Sub-Trope of both, and Explosive Leash and Why Am I Ticking?, which are Sister Tropes. Riding the Bomb is also closely related."
    },
    "name": "Strapped to a Bomb",
    "rdf_element": "StrappedToABomb/int_691166df",
    "short_name": "StrappedToABomb",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/StrappedToABomb"
  },
  {
    "categories": [],
    "descriptions": {
      "DieHardWithAVengeance": "In the movie Die Hard with a Vengeance, the two main characters must solve this type of puzzle in order to disarm a bomb near a public fountain. In the original script, the bomb was a Chekhov's Gun, as the movie would end with McClane planting the bomb on the bad guy's helicopter, and upon discovery one of them asks if anyone has a four gallon jug (in the final script the bomb was used for something else entirely without the puzzle being brought up again).",
      "general": "You have two containers, one that holds 3 liters and one that holds 5 liters, and access to a water source. Place exactly 4 liters of water into a third container (one that holds at least 5 liters, so that you can't simply fill the container to the brim and be done with it).\\nThis puzzle dates back at least as far as the 1920s, and quite possibly earlier still.\\nThe solution is as follows:\\nFirst, fill the 3-liter container to the brim.\\nPour the 3 liters of water into the 5-liter container.\\nFill the 3-liter container again.\\nPour water from the 3-liter container into the 5-liter container until it is filled to the brim. This should leave you with 1 liter of water in the 3-liter container.\\nEmpty out the 5-liter container, then pour the 1 liter of water into it from the 3-liter container.\\nFill the 3-liter container once more, then pour the water from both containers into the third container.\\nAn alternate solution with fewer fills:\\n Fill the 5-liter container.\\n Fill the 3-liter container from the 5-liter container, leaving 2 liters.\\n Empty the 3-liter container. Then, pour the remaining 2 liters from the 5- to the 3-liter container.\\n Refill the 5-liter, then fill the 3-liter from the 5-liter container. Leaving 4 liters in the 5-liter container.\\nAnother alternate solution, though this one requires several assumptions: The containers must have at least one line of symmetry when looking at them from the top, and they must have a constant width. (Cylinders or rectangular prisms meet this requirement.)\\n Fill the 5-liter container, then place one part of the bottom down, and tilt it until the water level makes a straight line from the upper edge of the bottom to the bottom edge of the lip.\\n Do the same thing with the 3-liter container, and pour it into the 5-liter container.\\n 2.5 + 1.5 = 4\\nIt bears noting that this puzzle, like many other stock puzzles, is usually difficult only because the solver is overthinking it. In practice, if you actually have the two jugs, and you just start filling one jug and pouring it into the other, the solution presents itself very quickly. (This is incorporated in some tellings of the riddle, which demand that you come up with the answer in less than a minute, as an Aesop about the value of trying things out rather than just sitting there thinking.)\\nMaths nerd bit: You're looking for the smallest x and y that satisfy 3x\\u22125y=4; then fill the 3-liter x times, pouring it into the 5-liter when full, and emptying the 5-liter when it's full (which you'll do y times). The solution is x=3 and y=1. The alternate solution up there is the dual formulation, 5x\\u22123y=4 (x=2, y=2). From here, two details present themselves: one, that it's easily adaptable to other values other than 3 and 5, and two, that a solution exists only if the target value is either a factor or a multiple of the highest common factor of the container sizes (e.g. you can't get 4 liters from 6- and 3-liter containers)."
    },
    "name": "Three Plus Five Make Four",
    "rdf_element": "ThreePlusFiveMakeFour/int_691166df",
    "short_name": "ThreePlusFiveMakeFour",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ThreePlusFiveMakeFour"
  },
  {
    "categories": [
      "ComedyTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "John McClane is shot out of a sewer pipe 10 feet into the air in Die Hard with a Vengeance.",
      "general": "This is a Comedy trope that can be seen very often in Western Animation. A character comes across a geyser and becomes innately curious about it as he looks directly into it, when the geyser suddenly erupts in a torrent of water that thrusts the character up into the air. This sometimes results in the victim bouncing around on the top of the spray.\\nThis is not Truth in Television, because a person will just get thrown back a few feet from such high water pressure. And be cooked by the superheated water.\\nThis is often a mechanic in video games (usually of the Platformer genre), and the geysers end up being moving and/or slippery platforms.\\nCan go hand-in-hand with: Making a Splash\\n\\nExamples"
    },
    "name": "Water Geyser Volley",
    "rdf_element": "WaterGeyserVolley/int_691166df",
    "short_name": "WaterGeyserVolley",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/WaterGeyserVolley"
  },
  {
    "categories": [
      "IntelligenceTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "In Die Hard with a Vengeance, running into a band of under-aged looters alerts John McClane (Bruce Willis) that the villain's apparent plan is likely a distraction.",
      "general": "All complex problems are solved by sudden epiphany!\\nIn every Locked Room Mystery, the detective can't solve the crime just by examining the relevant evidence. They always need some external inspiration (apparently) completely unrelated to everything, something along the lines of:\\n...or...\\nThis will lead directly to The Summation, unless there's an Evidence Scavenger Hunt in between. Often the character having the epiphany will tell the person whose offhand remark inspired it that they're \\\"a genius\\\" or the like; the remarker will then variously nod in a befuddled manner, ask \\\"I'm what?\\\", or simply demand an explanation.\\nNamed for perhaps the most famous non-detective related example, Archimedes' exclamation of \\\"Eureka!\\\" after jumping into a bath and realizing that held the key to the problem he was trying to solve. (See below for details.)\\nThe Eureka Moment shows up a lot on diagnosis-mystery medical shows, such as House, in which he does it in nearly every episode, and in the first episode of Grey's Anatomy, which isn't even a medical detective show! It may also show up on telenovelas or soap operas with some ongoing secret that defines a character or even the main plot. The truth is often almost revealed several times, by easily overheard conversations or weak evidences, and each time the status quo is kept with some contrived explanation. When the Eureka Moment takes place, The Reveal is not the result of a confession or an evidence that is too solid to be ignored, but instead the result of the hero putting all the small hints together and figuring out the truth by himself. In this case, expect a wave of several flashbacks of those hints before the \\\"Eureka!\\\".\\nNot to be confused with a Bat Deduction. While both can initially appear almost identical, a Eureka Moment leads to a coherent chain of reasoning that the detective can explain to the bystanders later; whereas a Bat Deduction, if it gets explained at all, makes even less sense after the explanation. However, although logically sound, the Eureka Moment may be enough to convince the one who came to it, but not to convince others (specially a court of law). In this case, the character may began a quest to obtain a Smoking Gun to prove things beyond any reasonable doubt.\\nOften used as a Deus ex Machina, albeit one that is acceptable more often than annoying. If the detective actually takes the idea literally rather than uses it as an inspiration, that is I Was Just Joking.\\nCan even happen in your sleep, with Dreaming the Truth.\\nHas no relation to a small town full of scientists. Or mecha with surfboards.\\nCompare Shaggy Search Technique and You Were Trying Too Hard. See Placebo Eureka Moment for when there wasn't any external inspiration, but they act like there was, and Love Epiphany, when the insight gained is that one party loves the other. See also Explain, Explain... Oh, Crap! for a similar situation where instead of finding a solution, someone becomes aware of a problem.\\nMay contain unmarked spoilers."
    },
    "name": "Eureka Moment",
    "rdf_element": "EurekaMoment/int_691166df",
    "short_name": "EurekaMoment",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/EurekaMoment"
  },
  {
    "categories": [
      "TruthAndLies"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "In Die Hard with a Vengeance, John McClane only gets Zeus Carver to help him investigate a spate of bombings by telling him that one bomb was discovered in a black neighborhood. Towards the end of the movie he admits that it wasn't anyplace close to where he'd claimed it was found.",
      "general": "Sometimes, the good guys get into a real jam where nothing seems like it's going to save them. Maybe The Hero is getting his butt kicked by The Rival or the Big Bad. Maybe there's some kind of impassable barrier between the hero and his objective, or some kind of mind bending riddle has bogged them down. Whatever the case may be, it doesn't look good.\\nThen someone Genre Savvy like a friend who's a Guile Hero, the Cynical Mentor or The Lancer comes along, and tells the hero a lie that gets them fired up with a fresh batch of Heroic Resolve. Maybe he tells the hero that the Big Bad killed the hero's parents, despite the fact the bad guy wasn't even in the country that night. (Or pushes a Berserk Button, for example telling The Napoleon that his opponent called him a shrimp.) Maybe you say that the Femme Fatale is waiting naked on the other side of the obstacle if the hero can just get through it, or that the world's greatest chef will make the hero's Trademark Favorite Food if he figures out the puzzle.\\nWouldn't you know it, the hero suddenly manages to turn the tide and start kicking ass.\\nAlthough the person telling the lie usually isn't thinking beyond the short term goal of overcoming an immediate problem, sometimes (especially in the hands of a prophet) this is done with a long term goal in mind, such as forcing Character Development or some other change in behavior or nature. In these cases the lie may even become a form of Prophecy Twist.\\nA Motivational Lie can also be a deadly weapon in the hands of a cunning villain, who can use it to either manipulate the heroes or turn others against them, such as in a Let's You and Him Fight scenario. As such it can be a favorite weapon of the Manipulative Bastard, Magnificent Bastard, and The Chessmaster.\\nCompare and contrast with tropes such as Batman Gambit, Magic Feather, Blatant Lies, Wounded Gazelle Gambit, Unreliable Expositor, Metaphorically True, False Reassurance, and Let Them Die Happy. Closely related to the Placebo Effect."
    },
    "name": "Motivational Lie",
    "rdf_element": "MotivationalLie/int_691166df",
    "short_name": "MotivationalLie",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/MotivationalLie"
  },
  {
    "categories": [
      "Starwars"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Lampshaded a little in Die Hard with a Vengeance, where John McClane, archetypal New York EveryCop, runs into a militant black man played by Samuel L. Jackson. His name? \\\"ZEUS! AS IN FATHER OF APOLLO? MOUNT OLYMPUS? DON'T-FUCK-WITH-ME-OR-I'LL-SHOVE-A-LIGHTNING-BOLT-UP-YOUR-ASS ZEUS!\\\" And, for added yuks, John initially believes his name to be \\\"Jesus\\\" (the Spanish pronunciation) after hearing a character address him with \\\"Hey, Zeus!\\\" (Since \\\"Jesus\\\" and \\\"Zeus\\\" are deities in two incompatible religious systems, that counts as Fridge Humor.)",
      "general": "In some fantasy settings, people will have names that you would expect to see in real life. In others, names are made up to sound exotic.\\nAnd then you have the mixed approach: people named Zelor and Lithnara alongside people named James and Catherine. Don't expect the characters to acknowledge the distinction. Note that this doesn't count if the author is making a distinction e.g. as a Translation Convention for different cultures (cf. The Lord of the Rings, where the hobbits' and the nearby Men's Westron-language names are \\\"translated\\\" as more real-world ones, but no others are), or in a cosmopolitan setting where characters might be reasonably expected to have diverse cultural backgrounds without this necessarily being explicitly stated.\\nThis can also happen within an Overly Long Name, where a Muggle-type name is liable to appear amid a long series of archaic names. Most often, the \\\"normal\\\" name is \\\"Terry\\\", \\\"Scott\\\", \\\"Dave\\\", or \\\"Lyle\\\", because those names are somehow inherently funny.\\nIn stories set in The Future, new names can be assumed to have been invented or become popular over the years, but older names would still exist as well.\\nThe Trope Namer is a combination of Final Fantasy VII, which has the eponymous \\\"Aerith\\\" alongside names like \\\"Vincent\\\" and \\\"Barret\\\", plus a play on Alice and Bob.\\nNot to be confused (or transliterated) with Alice and Bob. When it's played for laughs, it's an Odd Name Out. See also Special Person, Normal Name. Compare Melting-Pot Nomenclature, Sesquipedalian Smith and My Friends... and Zoidberg."
    },
    "name": "Aerith and Bob",
    "rdf_element": "AerithAndBob/int_691166df",
    "short_name": "AerithAndBob",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/AerithAndBob"
  },
  {
    "categories": [
      "ComedyTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Subverted in Die Hard with a Vengeance. McClane gets into an elevator to go down to the Federal Reserve's vault with three security guards and Detective \\\"Otto\\\", and just at the point where uncomfortable silence begins, McClane catches a reflection of Otto's badge and the number \\\"6991\\\", allowing him to suddenly deduce that Otto killed NYPD detective Ricky Walsh and stole his badge, and he's surrounded by a group of Simon's men. Also, he notices that one of them accidentally calls the elevator a \\\"lift\\\". The answer: McClane makes some petty small talk about the lottery, and then when he says he's got the \\\"tickets\\\", a gunfight ensues that ends with Otto getting his head blown off.",
      "general": "(For the proper reading experience, run the music from this video while reading this page.)\\nIn several European cultures, there is an unspoken code of behavior that applies inside elevators, and also sometimes on trains and other modes of public transportation: when someone enters an elevator, the custom is to face the front and stand in silence whilst absentmindedly watching the floor numbers change. If there is any conversation, it amounts only to small talk. An individual who breaks with this custom, for example facing the other passengers, is often a source of considerable unease to the other individuals in the elevator with you. The protocol does vary a lot between cultures, even between neighboring countries; for example, the UK has the elevator protocol, while almost none of Europe does. Depending on where you are, you might be expected to greet the other people in the elevator and/or make light conversation, or to completely ignore them. This is apparently a part of basic animal behavior, too: primates in small enclosed spaces instinctively avoid drawing attention to themselves. The cultural differences in elevator protocol reflect differences in what behaviour is inconspicuous. And yes, primates \\u2014 monkeys go quiet too, but rats tend to fight.\\nParticularly in visual fiction, the Western \\\"protocol\\\" is often milked to generate ironic, uncomfortable silences from characters inside the elevator, when some other reaction might well be expected or justified. In short: an Uncomfortable Elevator Moment.\\nUncomfortable Elevator Moments traditionally take place inside The Elevator from Ipanema. The elevator \\\"music\\\" itself often forms part of the humor and/or tension in the scene, but will get cut off abruptly when the scene ends. It can also take the form of a Mid-Battle Tea Break in a fight.\\nFor added discomfort, cue the fart, with an elevator filled with many, many people.\\nIf it becomes overly long, it may overlap with Leave the Camera Running."
    },
    "name": "Uncomfortable Elevator Moment",
    "rdf_element": "UncomfortableElevatorMoment/int_691166df",
    "short_name": "UncomfortableElevatorMoment",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/UncomfortableElevatorMoment"
  },
  {
    "categories": [
      "StealThisIndex"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "In Die Hard with a Vengeance, McClane hijacks a car to use a car phone which then dies out. Earlier, Zeus needed to answer Simon's call on a payphone another person is using.",
      "general": "John Doe is using a phone, typically now it's a cellphone, but up until about the 1980s it was a Pay Phone or in rare cases, his or another person's home phone. Richard Roe decides he needs to use the phone. Richard will either interrupt the call (for a pay phone or a home phone) or steal or confiscate John's cell phone. If Richard Roe just takes the phone and isn't planning to give it back, that's stealing. If a police officer or public official takes a phone because there's an emergency, that's a confiscation, because presumably the owner will eventually get the phone returned.\\nIn the case of a pay phone or other landline, seizing a phone to use for a call is actually legal in the United States if you have an emergency. Now, how do you know what is an \\\"emergency\\\"? Well, every telephone book in the United States had a notice defining what an emergency is. \\\"An emergency is a situation where life or property is in jeopardy and the prompt summoning of aid is essential.\\\" What that means is if your car got hit and no one is injured, you don't have an emergency, i.e. you can wait until the person finishes their call to get a tow truck. But, if your dog or cat was hit by a car, a dog or cat is \\\"property\\\" and not getting hold of a veterinarian or a cab \\\"promptly\\\" to take them there (for \\\"aid\\\") means your \\\"property\\\" is in jeopardy of dying, and this is a valid reason to demand emergency use of a phone.\\nIn a lot of these cases, it might not be an emergency, it might be Richard Roe just needs a phone in a hurry and steals one. In an older work, when seizing control of the payphone, expect Richard to tell the person on the other end \\\"He'll call you back\\\" before hanging up and dialing their own call.\\nCompare Hero Stole My Bike, where a vehicle is taken in an emergency."
    },
    "name": "Confiscated Phone",
    "rdf_element": "ConfiscatedPhone/int_691166df",
    "short_name": "ConfiscatedPhone",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ConfiscatedPhone"
  },
  {
    "categories": [
      "CombatTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Played with in Die Hard with a Vengeance. The Big Bad's helicopter hits a light pole with its main rotor, producing a shower of sparks; however, instead of this causing the rotor to shatter and the helicopter to simply drop a few metres on the ground, the whole thing just blows up for no clearly defined reason.",
      "general": "The hero is being chased by some Mooks in a helicopter. He's probably on a car or motorbike (rarely running). The baddies are shooting automatic weapons at him, but they've of course attended the Imperial Stormtrooper Marksmanship Academy. But wait, the hero has just gotten himself into a wide open space with no exit! He's trapped!\\nThe helicopter first comes to a low altitude, and you may think the baddies would just open fire en masse and rain hot lead all over the place because, hey, there's only so many bullets a hero can dodge. But no, that'd be too easy.\\nInstead, the helicopter first hovers right above ground, then tilts forward at a very steep angle. It then proceeds to slowly move forward, its rotor becoming a deadly, razor-sharp weapon that slices and dices everything it touches. All sorts of objects, people, even vehicles are thrown aside and shredded to pieces by the Helicopter Blender.\\nThe hero seems doomed, but at the last moment he always finds a way out (bonus points if it involves jumping over the helicopter)."
    },
    "name": "Helicopter Blender",
    "rdf_element": "HelicopterBlender/int_691166df",
    "short_name": "HelicopterBlender",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/HelicopterBlender"
  },
  {
    "categories": [
      "JustForPun"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Zeus from Die Hard with a Vengeance definitely qualifies. In fact, Samuel L. Jackson researched the role to look and act exactly like Malcolm X himself.",
      "general": "A form of Straw Character, this trope is specific to black characters.\\nThese characters are often very far to the left of the political spectrum, and usually militant. These black radicals or activists are depicted as a bunch of hypocritical, irrational, paranoid, unreasonable, lazy, bigoted, race-card-playing, conspiratorial raving loons. Even within black TV shows and movies, they're very rarely depicted as respectable or intelligent people whose opinion is of any real merit. When it comes to black TV and films, this could be an attempt by some black writers to subvert the stereotype of black people agreeing with these particular views. In the process, they ended up creating a Straw Character. Needless to say these characters can easily veer into Unfortunate Implications territory. Some even see these characters as tactics to discredit the image of conscious black people in mainstream media.\\nThe Trope Namer is Malcolm X, who achieved fame during the American civil rights movement for his aggressive and hard-line views on race; however, he was actually a subversion in that after going on his pilgrimage to Mecca he started to promote racial equality and unfortunately got killed for it by hard-line black nationalists.note\\u00A0Unless you believe the conspiracy theories that say otherwise\\nCompare with Straw Feminist, Angry Black Man."
    },
    "name": "Malcolm Xerox",
    "rdf_element": "MalcolmXerox/int_691166df",
    "short_name": "MalcolmXerox",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/MalcolmXerox"
  },
  {
    "categories": [
      "ActionAdventureTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "In Die Hard with a Vengeance, a bunch of German mercenaries impersonate cops. Although the leader speaks English with a flawless American accent, he slips up on a few word choices, such as calling an elevator a \\\"lift\\\" and saying that it's raining \\\"dogs and cats\\\", instead of the usual \\\"cats and dogs\\\". When McClane recognizes that one of them is wearing a friend's badge, and mentions the lottery to figure out if anyone on the elevator is real. None of the fake cops know last night's numbers, though in the beginning it's established that every NYPD cop plays the lottery with their badge number.",
      "general": "The inversion of Something Only They Would Say: When a character is pretending to be someone else, they may unwittingly reveal this by saying something that would be out-of-character for who they're impersonating. Variations include not responding to a well-known Berserk Button, doing things they're normally afraid of (or have a similar excuse for never doing), insisting to be called by a nickname they hate, or otherwise invokes OOC Is Serious Business.\\nOften Invoked in kidnapping and I Have Your Wife scenarios, to let the heroes know that something is amiss. If the Big Bad is demanding a ransom, this is to alert them to the fact that it's a trap; if he wants the kidnapped to \\\"assure\\\" The Hero that the kidnapped is \\\"in fact\\\" okay, this is to secretly convey that they're not. Sometimes serves as a Quiet Cry for Help. If they've pre-arranged such an alert, this is a Covert Distress Code.\\nReal-life military personnel sometimes use hand signals when being taped to communicate in another way with their 'home base'. There are a few documented cases of soldiers giving hand signals (and one case of them just flipping the bird to the camera) to alert the people receiving it that no, they weren't being treated very politely at all. And some have done it just for fun, giving the sign for coercion when forced to shake a politician's hand, for instance.\\nCompare with Lying Finger Cross (a common gesture used in this trope), Not Himself, Ooh, Me Accent's Slipping, and Trust Password (a pre-arranged alert to confirm one's identity and freedom of action). Contrast with Something Only They Would Say (in which a character is identified by a characteristic) and Bluff the Impostor. Sister Trope to You Called Me X, It Must Be Serious."
    },
    "name": "Out-of-Character Alert",
    "rdf_element": "OutOfCharacterAlert/int_691166df",
    "short_name": "OutOfCharacterAlert",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/OutOfCharacterAlert"
  },
  {
    "categories": [
      "GunsAndGunplayTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "In Die Hard with a Vengeance, hero John McClane (Bruce Willis) gives his reluctant ally Zeus (Samuel L. Jackson) a submachine gun lifted from a fallen mook to defend himself as they search the bad guys' boat, even giving him a short primer on how to use the gun. Zeus later comes upon Big Bad Simon Gruber (Jeremy Irons) and holds him at gunpoint; Simon takes the gun away, casually notes (of course) he's got the safety on, flips off the safety and shoots him.",
      "general": "If guns are featured in a movie, and someone inexperienced takes to using one (the Damsel in Distress or similar character), there's a good chance of this phrase being uttered. There are three versions:\\nIn the first case, the character being held up might use it as a ruse to try to wrong-foot his opponent. Usually in this instance the character at gunpoint is a veteran, his savvy attitude being contrasted to his inexperienced opponent. It is extremely rare for the opponent to call his bluff; instead he will usually tilt his gun and look down to check if the safety is on, letting the other person get the drop on him. Note that in this case the safety need not actually be on; all that's necessary is to trick the guy holding the gun into checking.\\nIn the second, the person at gunpoint is generally a villain and the one holding the gun an inexperienced good guy; in this case, the villain will grab the gun after it fails to fire, mocking his opponent for their lack of expertise only afterward.\\nThe third example is when a Magnificent Bastard is on the other end of the gun along with some other villain. Once the other guy is knocked out and the hero is securing him, he'll casually comment that you can't fire a gun with the safety on, and that 'next time' the hero should check first; thus showing that really he was just going along with it because it suited him and enhancing his Magnificent Bastardry.\\nVariations exist; it might be that the gun is recognizably jammed, is physically impossible to fire at the target for some reason, would kill both of them if fired, is not cocked, or even is not loaded. Note that in Real Life, any (competent) gun user or owner will leave the safety on until ready to fire, and especially make sure the safety is engaged if they are going to hand it to someone else. In addition, nearly all revolvers and many automatic pistols (Glock, Sig and others) do not feature a safety catch, relying on internal mechanisms and a strong trigger pull.\\nWhen the safety has been deliberately left on in case the weapon gets stolen, the person stealing it may find It Works Better with Bullets.\\nThe inverse sometimes shows up in movies where a gun is fired with the safety on, presumably to keep actors from death by blank. This annoys gun nuts; the appropriate special effects hide the phenomenon from other viewers."
    },
    "name": "Not with the Safety on, You Won't",
    "rdf_element": "NotWithTheSafetyOnYouWont/int_691166df",
    "short_name": "NotWithTheSafetyOnYouWont",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/NotWithTheSafetyOnYouWont"
  },
  {
    "categories": [
      "Dialogue"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "In Die Hard with a Vengeance, McClane asks Gruber if he has any aspirin. This doesn't help McClane escape his predicament, but it does give them a lead on where to find Gruber later.",
      "general": "Something you request right before you die. The opportunity may be offered to you by your executioner out of personal kindness or cultural tradition."
    },
    "name": "Last Request",
    "rdf_element": "LastRequest/int_691166df",
    "short_name": "LastRequest",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/LastRequest"
  },
  {
    "categories": [
      "ATorturedIndex"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Die Hard with a Vengeance: \\\"Have to take the safety catch off.\\\" Dakka\\n In the next film, the Big Bad again does this to the sidekick.",
      "general": "The act of deliberately damaging someone's knees to incapacitate them or limit their mobility. This can be performed by shooting the victim's kneecaps, or by striking them with kicks, melee weapons, or other up close and personal means.\\nSince this is an extremely painful type of injury, knee-capping can be used as a brutal form of Mutilation Interrogation. This can kill two birds with one stone for the savvy torturer, as the permanently debilitating nature of the injury makes it much more difficult for the victim to escape. Tearing up all that muscle, those sinews and those complicated bones with a bullet would in Real Life probably leave you crippled for life, if you weren't killed by blood loss or shock.\\nKnee-capping can also be used as a tactic in combat to drastically hamper the mobility of an opponent. Needless to say, this type of fighting is a bit too dirty for most upstanding protagonists, so it is often reserved for villains, Anti Heroes, and Combat Pragmatists.\\nIn real life, it is often not the kneecap itself that is the target of these attacks, as opposed to the joint and tissue beneath it. A piece of Common Knowledge is that kneecaps don't repair when broken/shattered. They do when treated properly, it just takes a very long time. Additionally, unlike in film and television, you would never actually aim to shoot out someone's kneecap or leg to disable a target in such a manner (see the Real Life section below).\\nA sub-trope of Trying to Catch Me Fighting Dirty. Compare Agony of the Feet for other mobility hampering injuries, and An Arm and a Leg for occasions when the legs are lost completely."
    },
    "name": "Knee-capping",
    "rdf_element": "Kneecapping/int_691166df",
    "short_name": "Kneecapping",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/Kneecapping"
  },
  {
    "categories": [
      "ActionAdventureTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Die Hard with a Vengeance:\\n Done, coupled with an Ironic Echo, when McClane steals the bike of a shoplifting kid.\\n Done again (And Lampshaded and Played With) when McClane trades up from his Yugo by stealing a Mercedes on the expressway. Zeus points out how pissed the other driver must be, until McClane reminds him that Zeus forgot his bar of gold in the Yugo's back seat.",
      "general": "A character is in a hurry, most likely during a Chase Scene, when he or she sees a bike or some other mode of transportation propped on the side of the road. He or she promptly gets on it and keeps going full-speed. If the owner is present, the character will hastily say something like \\\"I'm just borrowing it!\\\" or \\\"I need your bike! I'll bring it back later!\\\"\\nNote that you usually never see the bike actually get returned, and if it is returned, don't expect the warranty to cover the damage.\\nA Sister Trope to Flashed Badge Hijack. In Real Life, you can get away with this without criminal charges on the plea of \\\"necessity\\\" if you can establish that the harm done by your stealing the vehicle was less than would have occurred if you hadn't.\\nContrast Casual Car Giveaway, in which the hero gives a random soul their vehicle.\\n\\nExamples"
    },
    "name": "Hero Stole My Bike",
    "rdf_element": "HeroStoleMyBike/int_691166df",
    "short_name": "HeroStoleMyBike",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/HeroStoleMyBike"
  },
  {
    "categories": [
      "VideogameSettings"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "In Die Hard with a Vengeance, the hero unwittingly enters an elevator with no less than five mooks disguised as law enforcement. The mooks make a number of gaffes, betraying that they are neither Americans nor cops, before McClane notices that one of them is wearing a familiar badge. An elevator gunfight ensues.",
      "general": "Some places are just designed for epic fight sequences. The lush scenery, the rippling wind in the Badass Longcoat, the Greek choir blaring triumphantly in creepy tone...\\nAnd then there's the Elevator Action Sequence.\\nThere are advantages to the Elevator Action Sequence which make it so common in fiction. The main one is that it forces an arbitrary restriction on the heroes: in a game or movie with many wide-open spaces, elevators (even large, moving ones) tend to be static areas from which it is impossible to escape. The situation forces characters into a fight whether they like it or not, and also moves everyone automatically, so that we can pay more attention to the battle than where they're going. That people on an elevator must be going somewhere is naturally a foregone conclusion.\\nSimilar to the elevator is the funicular, which is like an elevator that moves along a diagonal plane instead of straight up and down. The funicular is also known to attract its fair share of action.\\nThis tropes is most common in early nineties Beat 'em Up games, which often used a moving platform rather than an enclosed elevator, allowing the player to throw enemies off the side. Although those games are out of vogue these days, examples can still be found occasionally in platformers, Action games and RPGs.\\nOften parodied by having two combatants fight their way onto the elevator, then calmly wait for the elevator to arrive to resume fighting.\\nLift of Doom is a specific variant, usually found in Platform Games.\\nThis trope is not to be confused with Elevator Going Down. Its polar opposite is the lack of action in an Uncomfortable Elevator Moment.\\nCompare Elevator Snare, where the action comes from the villain or monster reaching through the closing elevator doors. See also Evil Elevator. Sister trope of Cable-Car Action Sequence. Has nothing to do with the Elevator Action series of video games, which has you fighting people pretty much everywhere except the elevators.\\n\\nExamples"
    },
    "name": "Elevator Action Sequence",
    "rdf_element": "ElevatorActionSequence/int_691166df",
    "short_name": "ElevatorActionSequence",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ElevatorActionSequence"
  },
  {
    "categories": [
      "Media"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "The villain of Die Hard with a Vengeance used Simon Says in his games. His name is Simon, so he has a lot of fun with it.",
      "general": "Before Board Games, Card Games, Tabletop Games, Video Games, and Web Games came along, people just had their own persons to play games with guests. These are known as Parlor Games. In the past, these were used in fiction for the same purpose as Board Games are these days. Nowadays, it's either a Discredited Trope used to show how boring or geeky the people playing are, or it's used as an actual Plot Device.\\n Simon Says, a children's game where someone gives orders (usually silly things like \\\"clap your hands\\\" or \\\"jump up and down\\\"). Everyone playing has to follow the commands as long as they're preceded by \\\"Simon says\\\". So if \\\"Simon says clap your hands\\\" you have to clap, but just \\\"clap your hands\\\", you don't. You're out if you either follow the command without the \\\"Simon says\\\" or don't follow it when they do say it. One variation has Simon do an action in addition to saying one, but you must do what \\\"Simon says\\\". Usually, Simon will do and say the same thing, but it could lead to situations where \\\"Simon says clap your hands\\\" but he physically jumps up and down as a trick; the proper action is to clap your hands. Last of the group still in usually gets to be the next one to call out the orders. This game can be challenging enough that it can still be used legitimately in fiction.\\n Twenty Questions, a game where, counting the first question (usually if it's animal, vegetable, or mineral), the players can ask no more than twenty questions to guess what the active player is thinking of, and all questions after the first must be the \\\"yes or no\\\" kind. Usually parodied now instead of played straight. Computers can play it quite well, e.g. 20Q and Akinator.\\n Who Am I? is an inverted variant where each player has a post-it note on their forehead and take turns to ask the other players questions to figure out what's written on it (normally a famous person's name). Often played straight and used for the silliness of everyone having post-its on their heads. The names on the notes will often reflect or contrast with the person they're given to.\\n I Spy, a guessing game similar to but even more basic than Twenty Questions. The active player thinks of something within their line of sight and tells everyone else its color or first letter. They try to guess what it is. Only ever played by really bored characters.\\n Musical Chairs, is usually just played in children's parties now. Someone sets up enough chairs for all but one of the players to sit on. They walk in a circle while some music is played for a short time. As soon as it stops, everyone tries to sit in a chair, often resulting in a Big Ball of Violence. The one who can't is out, and one chair is removed for the next round, until one chair is left, and the one sitting is the winner.\\n Charades, nowadays the lowest of these games in fiction. Unless it takes place in the past, it rarely is portrayed for any reason other than to show what losers the players are. It is played by acting out the words the active player is thinking, puns and homophones allowed. The only other clue was to hold up a finger for each word in the answer, and fingers for which word is being played. Such improvised Hand Signals are sometimes used by a character to attempt to convey information which for whatever reason, such as being mute, they cannot simply say aloud.\\n Pictionary is Charades with drawings, where one partner must draw the clue instead of acting it out. This variant is more common in animation for obvious reasons. Sometimes the drawings aren't seen by the viewer.\\n Blind Man's Bluff, is usually seen in portrayals of older times. One player is blindfolded, while the others hide. The blind man has to find the other players. This game is sometimes depicted as a flirtatious man looking for giggling young women in a parlor.\\n Marco Polo is a variation on Blind Man's Bluff, with three differences: a) It usually takes place in water, such as a pool. b) The hunter doesn't wear a blindfold, but rather just keep their eyes shut. c) Most importantly, the hunter can call out \\\"Marco!\\\" as often as they like, and if the hunted ones hear it then they must respond with \\\"Polo!\\\". It's pretty much a miniature version of submarine warfare, sonar and all.\\n Truth or Dare is stereotypically most common at a slumber party, but can take place in other situations as well. The very point of this game is to elicit personal revelations if someone picks \\\"Truth,\\\" or wacky hijinks if someone picks \\\"Dare\\\"; therefore, just by playing the game normally, it's quite likely that the events of the game will generate results interesting enough to be the plot of a story. Fan Fic writers know this very well, and Truth or Dare fics are practically a genre.\\n I Never is a similar game to Truth or Dare. Usually played more as a drinking game, although other forfeits are common. The premise is for one person to say something which (hopefully truthfully...or not, as the case may be) they have never done, and all the other players have to commit the forfeit if they have done that thing.\\n Spin the Bottle and Ten Minutes in the Closet (or whatever variation) are the classic young-coed-teen-party games. In the first one, sit in a circle, take turns spinning a bottle and kiss the first member of the opposite sex it points to. In the second, pull names/number out of a hat to form couples and go into the closet for two minutes and... amuse yourselves in some fashion. This is often a way to trap/nudge a character into his/her First Kiss, to set up/exacerbate romantic jealousies or to contrast different levels of sexual activity among a bunch of kids of the same age. There will be much awkwardness, blushing and wiping of sweaty palms.\\n Mafia divides the players into two teams. One team is initially much smaller than the other, but the composition of the teams is unknown to the members of the larger team. The game alternates between turns during which the larger team keep their eyes shut, allowing the smaller team to communicate in secrecy, and turns during which all players claim they belong to the larger team. The elimination of a player is debated every turn. Paper sheets or cards are often used to create the teams at the beginning and to \\\"unmask\\\" any player who was just eliminated. A referee is normally required. Furthermore, a single player of the larger team has a hidden turn of his own, during which he learns the true allegiance of another player. Additional roles and teams can be introduced, potentially leading to at least one Double Reverse Quadruple Agent. In fictional works, Ten Little Murder Victims will sometimes play this kind of game right before it becomes the plot.\\n The Werewolves of Miller's Hollow is one of many commercial versions, with a dedicated deck of cards."
    },
    "name": "Parlor Games",
    "rdf_element": "ParlorGames/int_691166df",
    "short_name": "ParlorGames",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ParlorGames"
  },
  {
    "categories": [
      "CharactersAsDevice"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "In Die Hard with a Vengeance, when they're tearing through Central Park in a stolen Taxi, barely missing several picnickers, Samuel L. Jackson asks Bruce Willis \\\"Are you AIMING for those people?\\\" \\\"No, no... well, maybe that mime.\\\"",
      "general": "People performing stunts on streets (say, a One-Man Band) in order to get money from spectators, often seen at any renaissance fair. Also known as \\\"buskers\\\" in Ireland (a word ultimately of Celtic and Iberian origin).\\nOne common element is having a hat (or some other container) out in front in which passersby can toss money into.\\nCommonly an Acceptable Target in the mass media, likely to be stigmatized either as New-Age Retro Hippie or \\\"wannabe performer with no talent\\\". However, quite a few of these artists have become successful and even world-famous.\\nStreet Musician and Organ Grinder are Sub Tropes."
    },
    "name": "Street Performer",
    "rdf_element": "StreetPerformer/int_691166df",
    "short_name": "StreetPerformer",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/StreetPerformer"
  },
  {
    "categories": [
      "Trivia"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Die Hard with a Vengeance (1995) and Live Free or Die Hard (2007) \\u2014 12 years.",
      "general": "A film or other literary work where a sequel is released long, long after the original work. May sometimes be a Trilogy Creep, very often related to Development Hell. Does not apply to Sequels In Name Only, Sequel Series, or Franchise Reboots. This Trope is for honest-to-goodness sequels. See also Capcom Sequel Stagnation, and a related Webcomic trope, Schedule Slip.\\n\\nExamples"
    },
    "name": "This entry is trivia, which is cool and all, but not a trope. On a work, it goes on the Trivia tab.\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\n\\t\\t\\n\\t\\tSequel Gap",
    "rdf_element": "SequelGap/int_691166df",
    "short_name": "SequelGap",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SequelGap"
  },
  {
    "categories": [
      "Trivia"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Throughout Die Hard with a Vengeance (1995), Simon Gruber has John McClane and Zeus Carver driving all around New York City to answer specific payphones where Simon issues different instructions, and he bluffs the NYPD off their radios by insinuating some of the bombs were keyed to police frequencies... then he locks up the entire New York switchboard by calling a popular radio station about the fake bomb he planted in a school, to destroy the other means of communication the NYPD could've had. Cell phones would've beaten both in a second (but then, Simon would've probably had something for that eventuality as well.)\\n Under heavy loads, cellular phone networks jam as well. A real life example would be during the Boston Marathon bombing in 2013.",
      "general": "So little Timmy is watching a show from the 1990s. In one episode, the characters are all excited because of a new computer game that will be released very soon. A computer game \\u2014 on CD-ROM!\\nAnd Timmy says, \\\"'CD-ROMs?\\\"\\nYou see, Technology has marched on, and things like CD-ROMs and VHS cassette tapes and so on have relatively recently become either so little-used as to be obscure, or obsolete altogether. This isn't Zeerust, which is about futuristic tech becoming old rather than about modern tech becoming old. The important qualifications of this trope are as follows:\\n Show takes place in modern or modern-ish times, usually the not-so-distant past.\\n Show makes reference to something, usually a form of technology, that is \\\"The next big thing\\\" or \\\"state of the art\\\", and indeed it was \\u2014 at the time the show was made.\\n Said technology has since proved to be impractical, has become obsolete, is at least gradually on its way out, or it is just not in the spotlight anymore.\\n Cue Hilarious in Hindsight for those who remember when said tech was either very common or hyped as the next big thing.\\nAs far as that last point is concerned, remember that there have been spectacular technological leaps in just the past twenty years \\u2014 within the lifetimes of many (read: most) Tropers, in fact!note\\u00A0And if you haven't experienced it yet, don't worry. The first time will hit you completely by surprise sometime within the next five years. For the most part, once a technology is invented, it tends to develop at warp speed. Remember, it took only about 65 years (1903-1969) to go from one rickety plane barely able to get off the ground to putting a man on the MOON! So this can lead to some odd moments for those who grew up watching certain things go from \\\"absolutely essential\\\" to \\\"taking up space in your basement\\\".\\nTo clarify, an excellent example would be a scene in Friends where Chandler gleefully describes all the awesome features of his brand-new computer:\\nThere was a time when these specifications would be mockingly contrasted with a modern counterpart. However, technology has moved on so far and so fast that Chandler's computer is now unimaginably primitive; these days, even a low-end smartphone is several times more powerful than that in every way, while fitting in the user's pocket and costing considerably less than he would have spent. Because of this, most writers nowadays don't get too specific about computer performance, to avoid sounding dated before long.\\nSomewhat related are those moments, during not-so-old films, where you realize the entire plot could be resolved with something the world takes for granted today. (Cell Phones, perhaps.) A related and increasingly common source of humor shows down-on-their-luck characters as only able to afford the kind of older technology found in thrift stores today. Additionally, shows set in the past will often lampshade this for humor.\\nA Long Runner might even have its earlier episodes/books/etc. have one level of technology, and later installments have more up-to-date technology with little or no Hand Wave at all.\\nOften turns a work into an Unintentional Period Piece. Can sometimes be a Trope Breaker: a change in cultural context that affects Tropes. A cousin of sorts to Our Graphics Will Suck in the Future. See Magic Floppy Disk for cases when the tech onscreen in a futuristic series was dated when the show was made.\\nSee also Computer Equals Tape Drive, Science Marches On, and some examples of Aluminum Christmas Trees. Long-Runner Tech Marches On is when this happens In-Universe. Contrast I Want My Jetpack, where the writers overestimated the advance in technology. A fictional world where Technology doesn't march on despite the passage of time is in Medieval Stasis."
    },
    "name": "This entry is trivia, which is cool and all, but not a trope. On a work, it goes on the Trivia tab.\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\n\\t\\t\\n\\t\\tTechnology Marches On",
    "rdf_element": "TechnologyMarchesOn/int_691166df",
    "short_name": "TechnologyMarchesOn",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TechnologyMarchesOn"
  },
  {
    "categories": [
      "DesignatedAcceptableTargets"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Die Hard with a Vengeance: John McClane briefly considers running over a mime. And that scene where he and Samuel L. Jackson are in a taxi screaming across Central Park:",
      "general": "Mimes are universally hated in fiction. They're an Acceptable Target of sorts. No real reason is ever given, but the Uncanny Valley may have something to do with it - after all, their pure white faces and refusal to speak give them a definite alien aura. This trope isn't limited to people who hate mimes, but also works of fiction that seem to have it out for them. In other words a character doesn't have to say \\\"I hate mimes\\\" for it to be this trope. All the character needs to do is fall on, punch, kick, or otherwise cause intentional or accidental harm to a mime. Compare Enemy Mime."
    },
    "name": "Everyone Hates Mimes",
    "rdf_element": "EveryoneHatesMimes/int_691166df",
    "short_name": "EveryoneHatesMimes",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/EveryoneHatesMimes"
  },
  {
    "categories": [
      "CharacterReactionIndex"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Happens a lot between John McClane and his partner-of-circumstance Zeus in Die Hard with a Vengeance. McClane asks, for instance, \\\"can you pick this lock?\\\" Zeus calls him a racist (\\\"Oh, all black dudes know how to pick locks, right?\\\"), then when McClane calls him out on it, says that, yes, yes he can.\\n Earlier in the movie, when McClane asks if Zeus can hotwire a car, Zeus says:\\n But as it turns out, Zeus doesn't know how to use a gun.",
      "general": "One character assumes another has a certain item, skill, or relationship based on a stereotype, be it racial, gender, or orientation-based.\\nFor instance, someone asks a gay character if he can design clothes, or a latino character if he has any relatives who work on cars, or a black character if he knows where to buy weed.\\nThe character being asked is incensed, and outraged that his friend would believe such outlandish and bigoted assumptions.\\nThen, of course, it turns out he does, in fact, have the skill or item in question readily at hand, and calmly gives up the info with a calm \\\"yeah, okay.\\\" This allows writers to indulge ethnic and gender assumptions with built in Lampshade Hanging. The best way of putting it is \\\"but he didn't know that.\\\"\\nCompare I Resemble That Remark. Contrast with Stop Being Stereotypical, Mistaken for Racist, Discriminate and Switch. Also see Hypocritical Humor.\\n\\nExamples"
    },
    "name": "Stereotype Reaction Gag",
    "rdf_element": "StereotypeReactionGag/int_691166df",
    "short_name": "StereotypeReactionGag",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/StereotypeReactionGag"
  },
  {
    "categories": [
      "ContinuityTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Die Hard with a Vengeance (1995) has a memorable allusion to \\\"that thing in the building in L.A.\\\", which knowledgeable viewers will recognize as a Continuity Nod to the attempt by Hans Gruber and his gang of thieves to rob the Nakatomi Plaza tower in the original 1988 Die Hard movie. Even though there's a brief flashback to the climax of the 1988 film within the 1995 sequel, it can be difficult for first-time viewers to understand why Simon Gruber (Hans's brother) is so consumed with the desire to exact revenge on John McClane, the series' hero. The 1995 film even has an offscreen conversation between John and his ex-wife Holly, who was a major character in the first Die Hard (and is mentioned again in the fourth movie, Live Free or Die Hard, in 2008) and is the subject of the '95 film's closing punchline, which seems to come out of nowhere and make for a somewhat confused ending if you are new to the franchise.\\n Although McClane does briefly explain to Zeus that he dropped Simon's brother off a building not long after The Reveal.",
      "general": "The writers have let the mythos they have generated get so thick and convoluted that a newcomer has very little chance of understanding the significance of anything. They are 'locked out' of understanding the story by all the continuity.\\nThis is one of the main bones of contention between creators and executives. Executives generally want each episode to potentially bring in new audience. Creators generally want to entertain the audience they have. In a rare case of this wiki taking the side of the executive meddlers, we have to admit that continuity lock-out is never caused by the execs. It has to be written.\\nThe standard answer to this issue is the Previously On segment: many shows open each episode with a short capsule summary of prior events. Of course, Previously Ons have their own drawbacks, such as inadvertently providing spoilers or flat-out not working (because it is impossible to explain everything adequately in the space of 60 seconds).\\nWhy bother with the intense continuity at all? Simple: An intricate series-spanning plot often results in a stronger and more interesting overall show. You may not catch as many fans, but the ones you do get are yours for life. This does mean that you have be sure to rope in as many as possible early on before the Lockout effect takes hold to make the effort worthwhile.\\nSome Long Runners and certain mediums (such as novels) are designed to be engaged within a linear multi-volume fashion over a period of time, and the authors can't reasonably be expected to keep everything entirely accessible to a newcomer if they want to engage in any meaningful plot or Character Development; if you start reading a seven-volume series at volume five and find yourself hopelessly lost, then you arguably have only yourself (or in some cases the publisher) to blame.\\nThis is particularly prevalent in comic book series, more so than television or film, because while most TV shows run for a maximum of a few hundred episodes (most of which are easily obtainable one way or another) some comic book series run for much longer. (Like Superman: Consistently in print since the 1930s). This, and the fact that comic books can be incredibly rare (with the auction prices this entails), ensures that most new readers are just going to either give up or ignore most of the last 70 years of continuity. In the past, it wasn't uncommon for long-running series to actually recycle storylines with little variation, in keeping with the Seven Year Rule.\\nA Compressed Adaptation might cause this. In Web Comics, this can be the impetus for an Archive Binge or a justification for Archive Panic.\\nThe rise of services like on-demand video have done wonders to push this toward Dead Horse Trope status, especially as more series move toward airing fewer episodes in order to put a higher production budget into each and making it easier to catch up (Game of Thrones is the most potent example of this.) The internet allowing for easy access of fan-made sources of information (see: The Wiki Rule) has also made this less existent.\\n\\nExamples"
    },
    "name": "Continuity Lock-Out",
    "rdf_element": "ContinuityLockOut/int_691166df",
    "short_name": "ContinuityLockOut",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ContinuityLockOut"
  },
  {
    "categories": [
      "InfauxmationDesk"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "In Die Hard with a Vengeance the main villain is presented as a mad bomber with a personal grudge against John McClane  for killing his brother who was the Big Bad of the first film. Turns out that was all a distraction to keep John and his unwitting civilian partner busy finding bombs, while he and his crew of professional mercenaries rob Fork Knox of its gold. It's later revealed that the villain  didn't even like his brother, and John dying from one of the bombs going off was just a bonus while doing the robbery, not a personal priority.",
      "general": "A clue that leads in the wrong direction.\\nA red herring is a good red herring when it interweaves itself into the story's events. For example, the murder victim may have been a philanderer. His wife has no alibi. Aha! It was the wife!\\nThe wife's lack of an alibi is a red herring. It turns out the wife was shtupping somebody else at the time and didn't want to provide that information. However, the deceased husband's philandering is what got him killed, as it turns out, by his girlfriend's jealous husband. Philandering as a motive is introduced for good cause, not just to set up suspicions about the wife's lack of an alibi.\\nThe supertrope to Red Herring Shirt, Red Herring Mole and Red Herring Twist.\\nCompare: Mistaken for Evidence, where the same result is caused by a mix-up instead of intentional misdirection. The Untwist is when a plot twist is confused for a Red Herring because it's too obvious, but turns out to have been genuine all along. See also Chewbacca Defense, when a red herring is used to baffle your opponents, and Non Sequitur, when an event does not make sense in context. See also Big Secret. Has nothing to do with With This Herring. If a major star is used to sucker the audience rather than the actual characters, you've just been served Dead Star Walking, or at least an aversion of Narrowed It Down to the Guy I Recognize. Subject to being Spoiled by the Format: if they've just found a plausible suspect, but there's 180 more pages to go, well\\u2026\\nWarning: Due to the nature of this trope, unmarked spoilers ahead!"
    },
    "name": "Red Herring",
    "rdf_element": "RedHerring/int_691166df",
    "short_name": "RedHerring",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/RedHerring"
  },
  {
    "categories": [
      "IAmAnIndex"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Die Hard with a Vengeance:",
      "general": "A form of sarcastic rejoinder, responding to an improbable statement with an even more impossible statement.\\nPopular forms include \\\"I'm the Queen of Sheba\\\" and \\\"I'm a monkey's uncle\\\".\\nCan lead to interesting results if Bob takes Alice at her word, which may be because he's constitutionally deaf to sarcasm, doesn't expect her to disbelieve him, or doesn't recognize the improbability of her statement. Or Bob may sarcastically reference Alice's statement when his improbable statement is proved true; see Cue the Flying Pigs.\\nSee also Or My Name Isn't...."
    },
    "name": "And I'm the Queen of Sheba",
    "rdf_element": "AndImTheQueenOfSheba/int_691166df",
    "short_name": "AndImTheQueenOfSheba",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/AndImTheQueenOfSheba"
  },
  {
    "categories": [
      "TropesThatGoBoom"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Played straight and later subverted in Die Hard with a Vengeance. The liquid/gelled binary explosive used in the movie, PLX, actually exists but neither looks like it does in the movie nor does it explode on impact (instead requiring at least a blasting cap). It's also certainly not energetic enough that the amount collected on the tip of a paper clip would be enough to flip a chair. Seen later on, the actual bombs made with it feature more realistic amounts of priming explosives.",
      "general": "There are powerful explosives, and can blow up almost everything. But Hollywood gives it a nasty drawback: anything can make it explode. And I do mean anything. You have to be super-careful or it will blow up. Or maybe it blows without any apparent reason.\\nSome Real Life explosives really have a hair trigger, some...don't. Note that most explosives in fiction are not depicted this way. Usually in fiction, a plunger or a similar device (e.g. with a blasting cap, fuse, Plunger Detonator, etc.) is used to safely blow up explosives. But also in fiction, they get the volatility of explosives wrong, especially TNT and dynamite.\\nSubtrope of Stuff Blowing Up and The Last Straw. Supertrope of Nitro Express. Also see Explosive Stupidity when someone doesn't know this. This applied to a car intentionally is Molotov Truck, and unintentionally is Every Car Is a Pinto. Compare/contrast Made of Explodium, in which something that should not be explosive explodes anyway. If a nuclear weapon is treated like this, it's Artistic License \\u2013 Nuclear Physics."
    },
    "name": "Hair-Trigger Explosive",
    "rdf_element": "HairTriggerExplosive/int_691166df",
    "short_name": "HairTriggerExplosive",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/HairTriggerExplosive"
  },
  {
    "categories": [
      "MoralityTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Die Hard with a Vengeance has Anvilicious moments about this: the line \\\"children may find it [the bomb]\\\" is uttered by both the good guy and a bad guy. This brings a question of doubt in the perpetrators' actions, and it's revealed the Big Bad never planted a real bomb, just a fake one, because \\\"he's a soldier, not a monster\\\".",
      "general": "Many adult viewers and writers are upset about kids being harmed. Kid viewers aren't, but then, kids aren't the ones doing the writing, are they? As a result, many characters on TV Wouldn't Hurt a Child.\\nThis is often done simply by not showing kids at all in action and suspense shows, but sometimes it's rather conspicuous when characters seemingly go out of their way to not hurt kids, or circumstances happen to conveniently align themselves so that kids don't get hurt. For example, a slasher movie where the slasher just happens to not encounter children in hiding, or the kids manage to be rescued just in time, while the adults and teens get killed. It's also pretty common that when Even Evil Has Standards, not harming children is one of them.\\nIn fact, when this trope does get averted and children do get harmed, it can often be shocking for the audience.\\nSee Also Wouldn't Hit a Girl for the female-specific version of this trope. See Friend to All Children for those adults who not only don't hurt kids, but will actively protect them (even if the adults in question are clearly evil). For video games, see Hide Your Children, where children aren't even portrayed so as to avoid the implications that they could be hurt. For a more specific form of Wouldn't Hurt a Child, in which very young children are shielded from danger by the plot due to society's squeamishness about hurting babies, see Infant Immortality.\\nA common subversion is when a character who goes by this motto has to face a Creepy Child, or worse an Enfant Terrible.\\nMay be a form of Heroic Vow.\\nOddly enough, it's also Truth in Television as many gangs, such as the Mexican Mafia, brutally murder their members that hurt children. This even extends to prison, where inmates, or even prison-based gangs, that welcome robbers and murderers into their fold will not tolerate someone who hurts a kid. In fact, killing one of these people often results in being well liked by the other inmates.\\nContrast Child Hater and Would Hurt a Child."
    },
    "name": "Wouldn't Hurt a Child",
    "rdf_element": "WouldntHurtAChild/int_691166df",
    "short_name": "WouldntHurtAChild",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/WouldntHurtAChild"
  },
  {
    "categories": [
      "ActionAdventureTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Simon in Die Hard with a Vengeance handcuffs John McClane and Zeus to a bomb on a ship and leaves them to die, instead of shooting them and blowing up the ship after.",
      "general": "Bond Villain Stupidity is a form of Genre Blindness commonly exhibited by villains. It occurs when a villain fails to kill the hero when he has him cornered, incapacitated, or otherwise defenseless, thus giving the hero a chance to escape and later come back to defeat the villain. It is so named because it occurs frequently in James Bond movies. A common form of Bond Villain Stupidity is to place the hero in an elaborate Death Trap from which he can escape (slow dipping mechanisms over pits of sharks, alligators, or lava are perennial favorites). If you ever asked why the villains don't just shoot him then use their pets/lava to dispose of the body, then congratulations, you are smarter than the average megalomaniac. Also common is the inability to resist a Just Between You and Me moment before putting the hero in said death trap. Several variants of this one made the Evil Overlord List.\\nOften includes Monologuing, accompanied by stock quotes such as \\\"You Have No Chance to Survive! I don't think we'll meet again... Goodbye!\\\"\\nIf they actually expect the hero to die before their eyes, it's Prepare to Die.\\nObjective logic aside, a big part of the reason for this trope is because \\\"mundane\\\" kills do indeed seem to annoy audiences; see Dropped a Bridge on Him.\\nThis is so common that the Hypercompetent Sidekick pointing out the inherent flaws in this trope and suggesting a more pragmatic solution has become a trope on its own: Stating the Simple Solution. For more generalized villainous incompetence, see Villain Ball. For those villains that avert this trope, see Dangerously Genre Savvy."
    },
    "name": "Bond Villain Stupidity",
    "rdf_element": "BondVillainStupidity/int_691166df",
    "short_name": "BondVillainStupidity",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/BondVillainStupidity"
  },
  {
    "categories": [
      "ActionAdventureTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Die Hard with a Vengeance, bomb squad technician Charlie Veiss says this to a bomb he's attempting to defuse:",
      "general": "A Stock Phrase most often heard right before an action scene and used as a Pre Ass Kicking One Liner. The Hero comes across a random Big Bad, or one of his mooks. When the Hero announces his intention to fight/kill said Bad Guy, he might laugh a little sadistically before a reply of \\\"Let's Dance\\\". Sometimes this is accompanied by a cracking of knuckles, or even of the victim's neck.\\nCompare Bring It. Dance Battler also takes this literally."
    },
    "name": "Let's Dance",
    "rdf_element": "LetsDance/int_691166df",
    "short_name": "LetsDance",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/LetsDance"
  },
  {
    "categories": [
      "CrimeAndPunishmentTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Averted in Die Hard with a Vengeance. The NYPD Captain is ordering his men to search the schools and challenges the FBI Agent not to pull a jurisdictional stunt. The FBI Agent has kids in one of the threatened schools, and he's more than happy to help.",
      "general": "When two or more law enforcement organizations both can lay claim on a particular criminal case or suspect they will rarely see eye-to-eye on the best way to prosecute/investigate the case. In the US, local cops vs. the Federal government (FBI, DEA, etc) is the most common setup. Usually, the locals will want to shut down a petty crook to protect their town and the \\\"little guy\\\", while the Feds are focused on the big picture and would rather he go free so they can focus on building a case against the \\\"big fish\\\" higher up the criminal ladder. When a case is particularly sensitive or difficult, the friction may be reversed: each group of investigators wants to absolve themselves of jurisdiction to avoid the problems that will come with it. This is most likely to happen if one of the groups is under pressure to improve their conviction rate and does not want to risk taking on a case they cannot solve.\\nJurisdiction Friction may also occur at the initial crime scene: the hero investigator will barely have the time to unearth a few clues before the rival investigation outfit shows up to flash badges all over the place and claim jurisdiction. At this point, the hero will either turn Vigilante Man or move on to a new case that's oddly reminiscent of the old one.\\nWhich side of the dispute is sympathetic and which is heartless/incompetent/arrogant/corrupt/trigger happy/working for the shadow government depends entirely on who the main characters are. FBI agent series such as The X-Files and Without a Trace naturally will have them in the right, while a Police Procedural like Law & Order is frequently on the other side.\\nIn addition to local versus Feds, the friction can occur between other law enforcement subdivisions over the same suspect, like drug enforcement officers versus homicide investigators, or simply one of a city's police districts versus another. Internal Affairs can also get involved at some point. And everybody has it in for the Private Detective.\\nOccasionally, the normal effect is inverted: the friction lies in everyone trying to shove off responsibility, if any part of the investigation is likely to be unduly burdensome.\\nCompare Right Hand Versus Left Hand and We ARE Struggling Together for when the factions bickering over a common goal are not part of any government."
    },
    "name": "Jurisdiction Friction",
    "rdf_element": "JurisdictionFriction/int_691166df",
    "short_name": "JurisdictionFriction",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/JurisdictionFriction"
  },
  {
    "categories": [
      "Dialogue"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "This is repeated with Hans' brother in Die Hard with a Vengeance where he first authorities to believe that he's a terrorist who wants revenge on McClane, but is actually using the confusion to set up a huge robbery. The fact that he would also get revenge on the cop who killed his brother was just icing on the cake. He then almost convinces the world that he carried out the robbery in order to destroy the gold rather than keep it, which as a mercenary he has actually been paid to do.",
      "general": "Disgusted by the Big Bad's squirrel-stealing antics, Steven Ulysses Perhero finally corners the dastardly villain in the Abandoned Warehouse, where the following dialog takes place:\\nWhat a shocking twist! The hero... and naturally we the audience... assumed the villain was up to something. And we were correct. He was. Unfortunately, the hero... and naturally we the audience... were utterly incorrect about precisely what the villain was up to.\\nThis happens a lot when your hero is either too eager... or simply an idiot.\\nBasically, this trope is when a character comes to an erroneous conclusion about a villain's motives based on his actions. While the Big Bad is certainly still a horrible person, how he truly intends to go about it or why he's going about it in the first place turns out to be something for which everyone else's suspicions were way off the mark. And sometimes, the evil scheme isn't actually an evil scheme at all. In either case, the Big Bad didn't try to fool the hero, or leave a false trail, or otherwise trick him in any way. No, with this trope, the hero was fooling himself all along.\\nSometimes the result of paying attention to the Red Herring. Compare Hidden Agenda Villain (the villain is concealing his true intentions) and Civilian Villain (the villain tricks the hero into mistaking legitimate activites for nefarious ones in order to make the hero look bad and make himself look like an innocent victim). Contrast Evil Plan for a more obvious motive though this trope still might occur. See also Not Me This Time.\\nThis is an Ending Trope, so expect UNMARKED SPOILERS.\\n\\nExamples"
    },
    "name": "Motive Misidentification",
    "rdf_element": "MotiveMisidentification/int_691166df",
    "short_name": "MotiveMisidentification",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/MotiveMisidentification"
  },
  {
    "categories": [
      "CharactersAsDevice"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Zeus Carver from Die Hard with a Vengeance doesn't know anything about John McClane other than he's a white man in Harlem wearing nothing but a racist sandwich board sign. Despite being a rather unrepentantly bitter and biased man when it comes to white people, he saves him from a gang. Not that he necessarily wanted him to live, but he was afraid of what would happen if a white guy was killed on his block. Throughout the film, Simon Gruber calls him \\\"The Samaritan\\\".",
      "general": "Part of being a Hero is taking up arms to fight the wicked and righting wrongs, even (or perhaps especially) when no one else will. Some even have to fight the people they want to help, but a rare few can count on the help of a Good Samaritan.\\nThe Good Samaritan is a character who, despite owing nothing to the hero helps them when they're at their weakest, often at risk or cost to themselves. There are many variations, but they generally follow this form: a wounded hero wanders in, while others pass him by (or even further harm the hero), the Samaritan takes him in, tends his wounds and extends as much hospitality as she's able. This has the bonus of roping the hero into owing her a debt and giving him a reason to stick around the Adventure Town and fight off the Corrupt Corporate Executive threatening the Samaritan. Also, in a pinch, she makes an excellent Love Interest what with having proven she's got a heart of gold. (Good Samaritans who do not complicate the hero's life like that may come across as a Deus ex Machina.)\\nNot coincidentally, the Samaritan is almost always a part of the blue collar or underclass of society. There's almost no such thing as rich Samaritans in fiction. (Of course, in reality, one usually needs money if he wants to make any real difference donating to a legitimate charity, let alone starting one.) Interestingly, this is despite a pertinent aspect to the original Biblical story that is often overlooked: \\\"No-one would have remembered the Good Samaritan if he'd had only good intentions. He had money as well.\\\" All the same, it creates Unfortunate Implications if someone in a privileged position sees others as helpless without them; see White Man's Burden.\\nIf the Samaritan follows the protagonist into the m\\u00EAl\\u00E9e, expect her to be an Action Survivor to his Action Hero. Often overlaps with The Chick, Innocent Bystander, Determined Homesteader, and Heroic Bystander.\\nA nasty subversion is that the Samaritan hasn't taken in a Hero, but a Viper intent on doing him harm. If the villain the Samaritan helps is instead confused and curious at their generosity, it may lead to the Samaritan becoming their Morality Pet prior to a Heel-Face Turn.\\nA lot of Superheroes are considered to be Good Samaritans taken Up to Eleven.\\nThe Trope Namer is one of Jesus' parables from The Bible, in which an Israelite is mugged and left injured and naked on the side of the road. Several of his own people (including a priest) simply walk past, and the only person who helps him is a Samaritan. However, this parable carried some racial and cultural baggage lost to modern audiences. To Israelites, Samaritans were a hostile if not enemy peoplenote\\u00A0Samaritanism is an offshoot of Judaism (or the other way around, from the perspective of the Samaritans) so the two cultures might have seen each other they way Catholics and Protestants see each other now \\u2014 in agreement on the broad strokes, but disagreeing on the details, and having a non-trivial amount of bad blood between them.. So when the traveler falls on the wayside and the only one to help him is an enemy of his people, it carried a humanizing message akin to Dark Is Not Evil (certainly, a story where a Samaritan was portrayed in a positive light would have been a shock to the likely audience that Jesus was telling it to); the modern day equivalent might be a Palestinian stopping to help an Israeli, or vice versa. The closest trope to the above moral is probably I Was Just Passing Through. To further complicate the story, the Israelites passed by the wounded man because the Sabbath was beginning and it would be laborious to carry the man to safety, or in the case of the priest, falling back on the excuse that he could reasonably assume the man was dead and that being in contact with corpses was a gross impurity for a priest. The Samaritan story shows that goodness is more important than blindly following the law. In many modern uses of this trope, the Samaritan will protect and heal the hero even if the hero is explicitly a hunted fugitive.\\nThis Trope is often combined with No Good Deed Goes Unpunished (when a Good Samaritan is treated negatively or unfairly) or with Androcles' Lion and/or Character Witness (when what he does is rewarded).\\nSub-Trope of A Friend in Need. See also Samaritan Syndrome. Compare with Bad Samaritan, this character's moral opposite."
    },
    "name": "Good Samaritan",
    "rdf_element": "GoodSamaritan/int_691166df",
    "short_name": "GoodSamaritan",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/GoodSamaritan"
  },
  {
    "categories": [
      "IndexOfExactTropeTitles"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "In Die Hard with a Vengeance, the character of Zeus is a black man with serious problems with white people, most especially white racists. Eventually McClane calls him out on the fact that he's acting like a racist himself.",
      "general": "This is the implication that a character who dislikes a particular thing is secretly a practitioner of that thing.\\nThis especially comes into play when ethnicity or homosexuality is involved. Such a character is likely to believe in negative stereotypes about his own group (no matter how irrational), and hate himself for it, or live by those stereotypes so they become self-fulfilling prophecies. If Fantastic Racism is in play, such as with Differently Powered Individuals, the person may try to suppress the trait that makes them part of the hated group, or use said power as a weapon against them.\\nIn older shows this sometimes comes up with racist characters who are exposed as being light-skinned African-Americans who are 'passing'. Depending on the time frame of the media, the result may be either to show that the character should love himself or, in very old media from before 1940 or so, to show that the character is a sneaky liar who wasn't ethical enough to accept his \\\"natural\\\" place in the order of things.\\nThis sort of implication is \\\"non-falsifiable\\\": If even denial is taken as proof, there's no way to prove innocence. Characters who don't actually fall under this trope, but are accused of it by other characters, may get increasingly angry (or despondent) about no one believing them.\\nThis trope comes in several flavors.\\n The hater genuinely does not know he is a member of the group he hates.\\n The hater has clear evidence that he is a member of the hated group but is in denial. He refuses to identify with said group and often comes up with convoluted explanations as to why he isn't actually a member. Will often invoke the No True Scotsman fallacy.\\n The hater privately accepts that he is a member of the hated group but hides it from others.\\n The hater hates all members of the group, including or especially themselves.\\nWhen the character is openly a member of the group he despises, then that's a Boomerang Bigot. It is possible for the two to overlap. A bigot's membership in the hated group might be secret to most people but known to a few. If he continues to sincerely express hatred towards the group, even when in a situation where his secret will not be exposed, then he might show shades of both Boomerang Bigot and You Are What You Hate.\\nOften a cause of Unfortunate Implications. See also Hypocritical Humor, Psychological Projection, He Who Fights Monsters, Karmic Transformation, Cultural Cringe, I Do Not Like Green Eggs and Ham. Contrast Pretend Prejudice, in which a person pretends to hate a group but secretly likes or tolerates them. Armoured Closet Gay is one common Sub-Trope. If the hater doesn't realize that they're a member of the group they hate, they might just be a Tomato in the Mirror. Contrast Hunter of His Own Kind which usually involves fantastic Half Human Hybrids. Contrast Color Me Black for when a bigot is forcibly turned into a member of the group they hate, usually by supernatural means. See also Stop Being Stereotypical in which a person doesn't hate his group but is embarrassed by the behavior of some members."
    },
    "name": "You Are What You Hate",
    "rdf_element": "YouAreWhatYouHate/int_691166df",
    "short_name": "YouAreWhatYouHate",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/YouAreWhatYouHate"
  },
  {
    "categories": [
      "MetaConcepts"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Die Hard with a Vengeance. While the film's villain, Simon Gruber, doesn't quite fit this trope in terms of his mooks (they're all Germans and Slavs, with a token Hungarian as second-in-command), John McClane uses this description to convince Zeus to help him. McClane lies and tells Zeus that Simon put a bomb in Harlem (he actually put it in Chinatown), saying, \\\"This guy doesn't care about skin color even if you do.\\\".",
      "general": "Bad guys are often remarkably open when it comes to race, gender, religion, species, and so forth of their members. Some races might always be evil, but evil really knows no bounds. If the characters have the ambition, the bloodlust, the hatred of puppies, or the simple enjoyment of being evil, they're welcome to sign up. Evil Is One Big Happy Family, after all.\\nAt full force, this trope leads to a remarkably diverse set of top brass, as well.\\nIf this trait is emphasized more than necessary, it might come across as a Pet the Dog moment. It might even result in Rooting for the Empire if the \\\"good guys\\\" are not so unbiased. It might even suggest that it's okay to be unethical or even murderous as long as you're \\\"fair\\\" about it. A villain could do this if it serves their own evil ends, and someone who employs equally can just as easily hate everyone equally and may have no problems with disposing of their minions just as easily, often permanently.\\nWhile often done to avoid Unfortunate Implications about certain races, it can just as easily fall into it, such as portraying the heroes as all one ethnicity and every other race as the villains. Compare White Gang-Bangers and Straight Edge Evil. Contrast Politically Incorrect Villain. Note however that they are not mutually exclusive; a villain can be intolerant towards some groups but progressive towards others. See also Alike and Antithetical Adversaries and Anti-Human Alliance. May go hand in hand with Better Living Through Evil. See Five-Token Band for the good-aligned version."
    },
    "name": "Equal-Opportunity Evil",
    "rdf_element": "EqualOpportunityEvil/int_691166df",
    "short_name": "EqualOpportunityEvil",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/EqualOpportunityEvil"
  },
  {
    "categories": [],
    "descriptions": {
      "DieHardWithAVengeance": "They also did that three-unit container + five-unit container with a need to get four units. You know, the one from Die Hard with a Vengeance. Easy When You Know How.",
      "general": "Puzzles in Adventure Games and Adventure-hybrids tend to fall into one of two categories: the Lock and Key Puzzle, wherein the player must collect and use objects from around the model world to effect changes to the state of the game, and the Set Piece Puzzle, which consists of a single object to be manipulated.\\nA Set Piece Puzzle is typically some sort of device, usually a complicated machine, whose controls must be operated in a particular way to solve the puzzle. Most often, interacting with the puzzle will bring up a new user interface, distinct from the one used for playing most of the game.\\nThere are many possible sorts of set piece puzzles, often based on traditional non-computer puzzle toys. For many years, the most popular of these was the Fifteen Puzzle or sliding-tile puzzle. The Towers of Hanoi (with a small number of disks) is another favorite. A single round of a Puzzle Game can often be found built into the mechanism.\\nAdventure games have long used a combination of the two types of puzzle, though the Set Piece Puzzle became overwhelmingly popular to the point of excluding all others during the dominance of Myst-clones. These puzzles were popular with designers because, isolated as they were from the rest of the model world, they were technically easier to design and avoided the problem of Combinatorial Explosion. A game consisting of only this sort of puzzle need not, for example, provide a player inventory at all.\\nTo the player, a mix of both puzzle types adds variety, though overuse of the Set Piece Puzzle makes the puzzles feel disconnected from the narrative, and can lead him to feel that he's dealing with a Solve the Soup Cans puzzle.\\nOn occasion, the player may be faced with a broken Set Piece Puzzle, and would have to find an item that repairs the puzzle before it can be played. Examples of this are sporadic, but games that feature both Set-Piece and Lock-And-Key will usually have at least one.\\nThe Set Piece Puzzle usually features Puzzle Reset."
    },
    "name": "Set Piece Puzzle",
    "rdf_element": "SetPiecePuzzle/int_691166df",
    "short_name": "SetPiecePuzzle",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SetPiecePuzzle"
  },
  {
    "categories": [
      "Spectacle"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Die Hard with a Vengeance had a helicopter get destroyed, as well as one escape with moderate damage.",
      "general": "Oh no! The Bad Guys had the foresight to prepare an aerial getaway (usually in the form of a helicopter).\\nDoes the hero take it lying down because Gravity Is a Harsh Mistress? Of course not. Especially not if he is a Hollywood action hero! He will destroy the vehicle in a spectacularly explosive manner (because Everything Is Better With Explosions), but usually not before he leaps into the flying vehicle in question to have one final, mano-a-mano, brutal fistfight with the Big Bad in question."
    },
    "name": "Short Lived Aerial Escape",
    "rdf_element": "ShortLivedAerialEscape/int_691166df",
    "short_name": "ShortLivedAerialEscape",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ShortLivedAerialEscape"
  },
  {
    "categories": [
      "StockPhrases"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Heroic example in Die Hard with a Vengeance, McClane says \\\"Say hello to your brother\\\" just before he kills Simon Gruber, referring to Hans Gruber who McClane killed in the first film.",
      "general": "A stock Pre-Mortem One-Liner which usually comes in two flavours:\\nFrom the killer to the victim. Often told from the villain to the Disposable Woman or anyone close to The Hero that they're about to kill. When it's The Hero saying this, it's usually to Mooks attempting to avenge their boss or to an enemy upon the issue of a Duel to the Death.\\nFrom the victim to their friends or sometimes the killer themselves. The Tear Jerker variant which is usually found among the True Companions when one of them is dying in the arms of one of his comrades, usually along the lines of \\\"Meet you on the other side\\\".\\nThis One-Liner is sometimes used in the context of a Mercy Kill but it's rarer.\\nRelated to See You in Hell and We Will Meet Again.\\nAs this accompanies a character's death, beware of spoilers on this page."
    },
    "name": "Give My Regards in the Next World",
    "rdf_element": "GiveMyRegardsInTheNextWorld/int_691166df",
    "short_name": "GiveMyRegardsInTheNextWorld",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/GiveMyRegardsInTheNextWorld"
  },
  {
    "categories": [
      "SpeculativeFictionTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Die Hard with a Vengeance, released in 1995, has the villain calling from the vault of the New York Federal Reserve Bank. While it's in Wall Street, this is still underground... and the phone somehow doesn't pick up the noise made by the heavy machinery picking up gold as he speaks.",
      "general": "With the advent of the computer age, writers still don't quite know how to work cell phones into a story. Half the time, the mere existence of the cell phone breaks the story entirely unless the author invokes some rationale to lose, break, or disable them.\\nThis trope covers the other half, when writers have cell phones function like crazy James Bond-esque communication devices. Except when the plot demands, they work in places that no cell phone should \\u2014 such as in a sewer, a cave system, Antarctica (which would only be viable with a very expensive and large satellite phone), or even other worlds and dimensions. They might probably come equipped with flawless webcams to boot.\\nA sub-trope of Plot-Sensitive Items. Futuristic communications not working have a Phlebotinum Breakdown. Such a cell phone could be a Supernatural Phone, if it's justified in-universe. Compare The Web Always Existed for another kind of devices working all logic. Contrast Sudden Lack Of Signal, where a phone logically fails to work in a different world.\\n\\nExamples"
    },
    "name": "Super Cell Reception",
    "rdf_element": "SuperCellReception/int_691166df",
    "short_name": "SuperCellReception",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SuperCellReception"
  },
  {
    "categories": [
      "AudienceReactions"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Die Hard with a Vengeance was somewhat divisive to critics (though its reputation has improved since then), but was still the highest-grossing film of 1995 and well-received by fans.",
      "general": "Critical Dissonance is polar opposition of public to critical opinion. Critics might love a certain work while general audiences shun it, or vice versa.\\nCritics may look down on a popular work on principle, denouncing it as Lowest Common Denominator garbage that\\u2019s all flash and no substance. Conversely, the public may see a work beloved by the critics as boring, angsty and pretentious drivel engineered solely to win awards from equally boring, angsty and pretentious Academy members.\\nSometimes later opinions can match, and then we have Vindicated by History (or Deader Than Disco, as the case may be), but not always.\\nSome media are less affected by this than others. Since comedy relies on what an individual finds funny, this is the genre of movie most likely to spur on Critical Dissonance. One critic may find a movie hilarious while another finds it tacky. Switch out comedy for the horror genre and you get the same polarizing results. Art \\u2014 all kinds, not just abstract \\u2014 is notoriously subject to this. And architects get hit with it all the time.\\nIn general, this trope has historically been uncommon with video games, partly due to the far greater reliance on reviews among gamers, and partly because the technical side (gameplay, graphics, etc.) tends to carry more weight with games than with books or TV. Additionally, good gameplay (at least in terms of, say, lacking glitches) is much more black-and-white than a good story, writing, or acting. However, video-game journalism is infamous for its frightening degree of corruption, to the point where reviewers who don\\u2019t sufficiently praise games that buy enough advertising space on their stomping grounds tend to get fired pretty quickly. When Critical Dissonance does occur with games, it is more often than not because gamers thought that the critics had been overly kind (like the Four Point Scale), or had even been paid upfront by the publishers as part of an advertising and/or first-look article special.\\nNiche media may particularly suffer this because some or all of the critics assigned to review it aren\\u2019t members of its target demographic, or don\\u2019t even have a basic knowledge of the genre. To look at it another way, if the business model involves an audience who will actively seek it out, those people will be predisposed to enjoy it, whereas critics who see it out of professional necessity will not have that selection bias.\\nTelltale signs of Critical Dissonance include disagreement between a work\\u2019s revenue and its reviews, simultaneous nominations for both \\u2018best X\\u2019 and \\u2018worst Y\\u2019 awards (bonus points if X=Y), and angry comments on those review sites that have them.\\nThat the main differences between the average audience viewer and the average critic are vocabulary, sometimes ego, and employment in the field of journalism is what makes the large contrast between viewpoints either fascinating or predictable, depending on your degree of cynicism.\\nSee also Critical Backlash, Critic-Proof, Bias Steamroller, It's Popular, Now It Sucks, Opinion Myopia, 8.8 and Oscar Bait. Could overlap with Pop-Culture Isolation and Acclaimed Flop. Contrast with Cult Classic where a work tends to have neither critical acclaim nor general popularity, but is enjoyed by a few diehard fans. Possibly the cause of Mainstream Obscurity.\\n\\nExamples"
    },
    "name": "Critical Dissonance",
    "rdf_element": "CriticalDissonance/int_691166df",
    "short_name": "CriticalDissonance",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/CriticalDissonance"
  },
  {
    "categories": [
      "Dialogue"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "In Die Hard with a Vengeance, McClane stops a truck.",
      "general": "... and you'll Get a Stupid Answer.\\nYou know how obnoxious Captain Obvious can be. You just want to yell at them and say, \\\"Any blind idiot can tell what's going on!\\\" But then there are those Captains Obvious who can not only tell what is going on, but ask a stupid question just to verify.\\nThis is not only when that question is asked, but to the frustrated individual this is their chance to strike back with a non-sequitur, either in a Deadpan Snarker retort or full on Mind Screw confusion. A specific variation of Sarcasm Mode.\\nWhile examples on this page are of In-Universe instances of this type of exchange, this is certainly a staple of MSTing by pointing out where people are being oblivious to their dialogue (or being repetitive in them). For example: \\\"This is a map to Hammunaptra.\\\" \\\"The Hammunaptra?\\\" \\\"No, the one in Jersey.\\\"\\nBill Engvall's \\\"Here's Your Sign\\\" routine was dedicated to these exchanges. MAD also had a section called \\\"Snappy Answers To Stupid Questions\\\" written by Al Jaffee.\\nOf course, if you decide to avert the inevitable sarcastic retort by not seeking explicit confirmation that your friend with the house full of boxes is actually moving, nine times out of ten it will turn out (after a generous helping of Poor Communication Kills) that he is just having the house fumigated.\\nAn attempt to maneuver someone into asking a stupid question for the purpose of delivering a snappy answer is What's a Henway? When the stupid answer is, in fact, correct, it's Don't Be Ridiculous. See Stupid Question Bait for a similar concept."
    },
    "name": "Ask a Stupid Question...",
    "rdf_element": "AskAStupidQuestion/int_691166df",
    "short_name": "AskAStupidQuestion",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/AskAStupidQuestion"
  },
  {
    "categories": [
      "FrenemyTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "Taken very literally in Die Hard with a Vengeance, wherein John McClane finds his new sidekick obnoxious, Zeus (said sidekick) despises him in return, but quite literally cannot live without him as the evil mastermind has set traps that he demands they solve together.",
      "general": "A development often used in buddy films and romantic comedy. One person, often a loner-type, is paired off with someone else against his/her will.\\nHe can't stand the person/situation and wishes for his old routine. When he gets his old routine back, he suddenly realizes he misses that person a lot and does everything in his power to get her back. Usually, happens when a bickering pair become Vitriolic Best Buds, or generate an Aww, Look! They Really Do Love Each Other situation, whether it's a fraternal sort of love among buddies, or romantic love.\\nSometimes subverted to \\\"Can't live with 'em, can't kill 'em\\\".\\nSee also Odd Couple.\\nCompare We Want Our Jerk Back (when the resident Deadpan Snarker's presence is sorely missed), Belligerent Sexual Tension.\\n\\nExamples"
    },
    "name": "Can't Live With Them, Can't Live Without Them",
    "rdf_element": "CantLiveWithThemCantLiveWithoutThem/int_691166df",
    "short_name": "CantLiveWithThemCantLiveWithoutThem",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/CantLiveWithThemCantLiveWithoutThem"
  },
  {
    "categories": [
      "NumberTropes"
    ],
    "descriptions": {
      "DieHardWithAVengeance": "In Die Hard with a Vengeance, McClane must stop a bomb by dialing \\\"555 and the answer\\\" to the riddle the villain just gave.",
      "general": "Virtually all US phone numbers on fictional programmes are made up of the following:\\nArea Code - 555 - four random digits\\n\\\"555\\\" is an exchange number commonly thought to be reserved by the phone companies for use by TV and movies in order to prevent prank phone calls to real people. In fact, only 555-0100 through 555-0199 are now specifically reserved for fictional use, and the other numbers have been released for actual assignment. The 555 exchange was originally useful for this purpose because it was (in North America) reserved for various internal phone company service numbers, so calling one of the 555 numbers would not have reached an actual customer. In particular, in most areas in North America (AREA CODE)-555-1212 connects with directory assistance.\\nAnother fake number used back in the 1950s through the 1970s when most of Southern California was entirely one area code, 213, was to reserve the extension 1 plus the prefix in every prefix, so that the number 462-1462 or 733-1733 was never a working number. Eventually the 714 area code would be split off from 213 in 1953 and later 818 would split from 213 in the early 1980s, but Pacific Telephone continued the practice of reserving the prefix-1-prefix number in every exchange as a non-working number. A number of TV shows and made-for-tv movies took advantage of this fictional number feature.\\nAs it happens, if the area code is \\\"800\\\", \\\"888\\\", \\\"877\\\", \\\"866\\\", \\\"855\\\", or \\\"844\\\" (the US area codes for toll-free dialing), \\\"555\\\" is a valid prefix. So 1-800-555-(four digits) will be a real phone number. Not everyone knows that.\\nA variation of this is IP addresses; media will commonly use addresses such as 127.0.0.1 (which refers to the local computer) or impossible addresses (an address in the most commonly used protocol, IPv4, is essentially a 4-digit number in base-256, so any address with a \\\"digit\\\" 256 or greater is fake). Similarly, any hexadecimal character higher than F is fake (Hex only uses the characters 0-9 and A-F). And to top it off, there are certain IP addresses that are reserved for private networks and will never be assigned to internet-facing machines (see Real Life section for more info).\\nNot to be confused with A Kamen Rider of similar naming. Or a popular timer IC of the same name.\\nWorks set during an era when exchanges were commonly specified as names (say, during World War II) may use the exchange name \\\"KLondike (or KLamath)\\\" (followed, or not, by a 5 depending on the exact time period), which works out to the same thing. Works actually from those eras normally don't; the songs \\\"Beechwood 4-5789\\\" and \\\"PEnnsylvania 6-5000\\\" are examples.\\nSee also Logging onto the Fourth Wall for the website equivalent."
    },
    "name": "555",
    "rdf_element": "FiveFiveFive/int_691166df",
    "short_name": "FiveFiveFive",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/FiveFiveFive"
  }
]