[
  {
    "categories": [
      "EvilTropes"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "In Harry Potter and the Philosopher's Stone, Filch mentions how they used to hang up disobedient students by their thumbs for punishment in the good old days.",
      "general": "Some people find happiness in hearing a peaceful stream, or the laughter of children, or maybe a beautiful symphony. Others... not so much. Sometimes you'll find people who very openly find joy, solace, or at least, familiarity, in the sounds of suffering and violence.\\nExpect this trope to crop up if there's a torture scene, particularly if someone's being Interrogated for Nothing. If the victim is The Stoic, The Spock, or Defiant to the End, they'll probably resist giving their captor the satisfaction.\\nUsually a sign that the person you're dealing with is a Psycho for Hire, or at the very least a sadist (it's not exactly a heroic quality). These types may be prone to Reminiscing About Your Victims. For characters who actually feed off of feelings of suffering, see Emotion Eater. Related to Bad Is Good and Good Is Bad."
    },
    "name": "Loves the Sound of Screaming",
    "rdf_element": "LovesTheSoundOfScreaming/int_890b49e",
    "short_name": "LovesTheSoundOfScreaming",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/LovesTheSoundOfScreaming"
  },
  {
    "categories": [
      "CostumeTropes"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "In the first movie, Quirrell collapses to dust, leaving his clothes to fall empty to the floor.",
      "general": "Items of clothing have a way of sticking around unchanged, even if their wearer is shrunken, transformed, or outright disintegrated in front of the viewer's eyes. This presentation is usually used as a visual cue to drive home the extremity of what's just happened to the victim. Simple gravity may pile the clothes into a heap, or convenient magic scatter them a moment later, to Hide the Evidence. In other instances, the clothes are ripped apart during the transformation, leaving them in tatters.\\nIn Shapeshifting, this can be an effect of Animorphism, or as simple as Just Woke Up That Way. Also a frequent pairing with the Baleful Polymorph or Incredible Shrinking Man. Since the clothes stay where they are, if the victim has survived the event, it's likely to lead to Naked on Revival. Although works unwilling to depict nudity may nonetheless ignore the effect on reversal, in favor of returning the character to human form fully clothed.\\nThis is also seen in Sizeshifting gone wrong, Ascending to a Higher Plane of Existence, or the effects of a Fountain of Youth.\\nTypically onscreen; in any case, the cause of the loss of clothing is revealed to the audience and characters present in the scene. May trigger a foreboding Empty Piles of Clothing moment if discovered later by a character, without this context.\\nThe inversion is Technically Naked Shapeshifter. Compare Invisible Streaker (aka \\\"Invisibility Excludes Clothing\\\") Empty Piles of Clothing, My Suit Is Also Super, Morphic Resonance, and Dress Hits Floor. Contrast Magic Pants.\\nNotice: As it can be used as a possible DEATH TROPE, there can be SPOILERS here. Beware!\\n\\nExamples"
    },
    "name": "Shapeshifting Excludes Clothing",
    "rdf_element": "ShapeshiftingExcludesClothing/int_890b49e",
    "short_name": "ShapeshiftingExcludesClothing",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ShapeshiftingExcludesClothing"
  },
  {
    "categories": [
      "VoiceActors"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "Harry Potter and the Philosopher's Stone: The prologue is set in 1981.",
      "general": "The Excessive Eighties: a time where you wake up before you go-go when you want to kick up your Sunday shoes as you walk like an Egyptian, hear doves cry or feel the Punky power like a virgin while you moonwalk the Thriller.\\nAll the men were preppies who wore pastel suits with narrow ties, drove sports cars that Lee Iacocca personally stood behind and traded stocks on Wall Street - after all, as Oscar Wilde said, nothing says success like excess. (Unless they happened to be teenagers, in which case they were Totally Radical or studied karate and learnt the meaning of \\\"Wax On, Wax Off\\\".) Everyone had huge hairdos, enough make-up to sink a ship and power suits with shoulderpads big enough to knock the giant mirrored sunglasses off anyone who walked within a three foot radius of them. And those without them had flat-tops and wore gym clothes and break-danced on top of cardboard. Millenials (then known as \\\"Echo Boomers\\\" and later \\\"Generation Y\\\") started being born, one day to become, despite their best efforts, the young adults of The Turn of the Millennium.\\nComputing technology first became a true cultural force in this decade, starting a trend that would keep on snowballing to this very day. The Eighties was the decade of cell phones literally sized and shaped like bricks, jokes about being unable to program VCRs, the death of Betamax, and the beginnings of personal computers and gaming consoles beginning to proliferate inside homes, perhaps one of the trends from this decade with the largest of cultural implications. Cable television also took off big time, with MTV, TBS, HBO, and CNN becoming household acronyms.\\nIn the US, it was also the first wave of The Japanese Invasion, the inklings of which started in '78 with the dub of Battle of the Planets, continuing on with Star Blazers ('79), Voltron ('84), getting even more hardcore with Robotech in '85, and hitting its apex by cranking the quality Up to Eleven with the nationwide release of AKIRA ('88).\\nOn the homefront, the 1980s produced a rash of pop-cultural icons that today are looked upon, at worst, with Affectionate Parody, and at best, as the national ideal. The conservative political culture of the era meant two rather contradictory things for the production of pop-culture; on the one hand, the surge of private enterprise together with new media technologies allowed corporations such as Hasbro an unprecedented ability to build massive franchises around their products, typically with a TV show and accompanying toys, but on the other Moral Guardian complaints would challenge the ethics of making a show that was \\\"essentially one large commercial.\\\" The result was the rather spoof-worthy And Knowing Is Half the Battle segment common to many mass franchise shows, shoving an Anvilicious moral into the action. Fortunately, these were conveniently located after the actual plot, so kids could just turn it off at that point and run down to buy the toys. Besides, the segments make great joke fodder.\\nPolitically, the first part of the decade, Cold War tensions continued to escalate such as the US doing things like invading Grenada and proposing ludicrously unfeasible military schemes like the Strategic Defense Initiative. Some accuse this of being an intentional move by the West to render the economically inept Soviet Union infeasible by drawing its resources away from things like infrastructure and feeding its people, which market economies could accomplish easily. While this is, essentially, what ended up happening (though more complicated than that in real life; in Eastern Europe the decade's real deathblow to communism was considered to have been all the new media technology), the fact that the other possible outcome of such a strategy was global thermonuclear annihilation had a profound impact on Western media tropes. Most obviously, dystopian Speculative Fiction, particularly set After the End Twenty Minutes into the Future, enjoyed a surge. On the other hand, Star Trek became a defiantly optimistic mainstream Sci-Fi mainstay with the feature film series and its return to live action TV with Star Trek: The Next Generation.\\nThe second part of the decade, however, couldn't be more different. Mikhail Gorbachev, spry for a CPSU leader at age 54 (this was the only time in the Cold War that the Soviet leader was substantially younger than the American), shook up the by-then sclerotic Soviet leadership upon taking power in 1985. Gorbachev restructured the economy (perestroika) for \\\"accelerated\\\" development (uskoreniye), encouraged openness (glasnost), made tentative moves towards democracy (demokratizatsiya), and went Karting with Reagan. For a hot second in 1988-89, it seemed like the USSR had reached a final rapprochement with the West. And then came The Great Politics Mess-Up.\\nThroughout this era, there came new problems like the spread of AIDS which created a public health panic that dealt first a body blow to the gay community as homophobes treating them as modern lepers (even though that community took the danger seriously far sooner than others). However, the epidemic paradoxically later proved a partial blessing in disguise for gay rights as stricken people like Rock Hudson were shoved out of the closet, forcing the public to realize that LGBTI people were all around them, much like themselves. The Eighties also had the highest murder rate in U.S. history, almost twice what it is today.\\nPolitically speaking, the decade lasted roughly from the inauguration of Ronald Reagan on January 20, 1981 to the collapse of the Soviet Union on December 25, 1991, so almost 11 years. (Sometimes Margaret Thatcher becoming Prime Minister in 1979 is considered the start, especially in the UK.) Culturally, the decade lasted roughly from the death of Disco in 1979 to the release of Nirvana's album Nevermind in 1991.\\nThanks to a common twenty- or thirty-year lag, it's still The Eighties in much of Fictionland. Although The '70s and The '90s are gradually returning.\\nSee Also: The Roaring Twenties, The Great Depression, The Forties, The Fifties, The Sixties, The '70s, The '90s, Turn of the Millennium and The New Tens."
    },
    "name": "The '80s",
    "rdf_element": "TheEighties/int_890b49e",
    "short_name": "TheEighties",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TheEighties"
  },
  {
    "categories": [
      "Spectacle"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "In the film of Harry Potter and the Philosopher's Stone, a glow surrounds Harry when his wand chooses him. (A slightly different thing happened in the book.)",
      "general": "Power glows. The more power, the more glow. So, anything that glows is automatically presumed to be superior to otherwise identical things that don't glow, and more glow is better. This is closely related to the Rule of Cool because glowing is cool, so things that glow automatically get more Willing Suspension of Disbelief, allowing them to be more unrealistically powerful. They're often Good Colors, Evil Colors, too. For example, evil glows bright red, good glows blue or gold, and radioactive materials glow green.\\nGlowing Eyes of Doom? Inherently superior to ordinary, everyday, garden-variety eyes of doom. Glowing Battle Aura? Opponents who don't glow won't stand a chance! Any physical object that glows will also be powerful somehow. Glowing sword vs. boring sword? Glowing sword wins, every time. Explodey things that emit a glow first are bigger, louder and/or do more damage, and if they were Sucking-In Lines first, they're even more so. The most powerful magical potions will also glow to signify their superiority over ordinary, non-glowing magical potions. And don't forget the inherent awesomeness of the Pillar of Light, which is Glow going to Heaven just to show how overwhelming it is.\\nStrangely enough, in real life glowing would usually indicate a wasting of energy, but it could still count as just the excess energy manifesting as light. A good example is in Mercedes Lackey's Velgarth series in which Gates and Portals only glow when energy is being used inefficiently.\\nSuper Trope to Battle Aura, Holy Halo, Volcanic Veins, and Phosphor-Essence. See also: Power Crystal, Power Echoes, Power Floats, Power Makes Your Voice Deep, Pure Energy, Holy Backlight, Background Halo and Family-Friendly Firearms. Pre-Explosion Glow, Star-Spangled Spandex, Throat Light, and Sucking-In Lines are special cases of this trope. In media with audio, this is commonly a Whining Light. Very often overlaps with Power-Up Full Color Change.\\nIf only certain people are aware of the glow you could be looking at Editorial Synaesthesia or even Aura Vision. May be used as a Fantastic Light Source as Mundane Utility.\\nAs one final note, DO NOT rely on this trope to determine danger in Real Life. People have been killed from touching downed power lines that aren't glowing or sparking but still have enough charge to electrocute anyone who touches them, and permanently disabling to lethal levels of radiation can be present without any visual signs at all (which is why Geiger counters and dosimeters exist!)\\n\\nExamples"
    },
    "name": "Power Glows",
    "rdf_element": "PowerGlows/int_890b49e",
    "short_name": "PowerGlows",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/PowerGlows"
  },
  {
    "categories": [
      "ArtisticLicenseBiology"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "Cleverly averted in Harry Potter and the Philosopher's Stone. They couldn't get a boa constrictor, only a Burmese Python, so they changed the reference from Brazil to Burma and removed the snake's use of the word \\\"Amigo\\\".",
      "general": "The bane of naturalists, just as Anachronism Stew is the bane of historians. This is a trope that can manifest several different ways.\\nGenerally, filmmakers use whichever animals they can get for a scene involving wild animals, especially in films set in Darkest Africa or The Amazon. Whether the animals are in the right environment, on the right continent or displaying appropriate behaviour is something they just hope we won't ask about.\\nNotorious in the case of elephants for scenes in Darkest Africa, since the only trained elephants available tend to be Indian, not African.\\nGlaringly obvious in the case of monkeys, as the cutest monkeys, the ones with the round faces and prehensile tails, are exclusive to the New World. Old World monkeys have long, wrinkly, often brightly colored faces and bare, often colourful, butts with non-prehensile (most of the macaque family and the colobus family) or vestigial (the drill and mandrill) tails, so any film in Africa, India, Asia, or the Middle East featuring a cute little monkey hanging by its tail will annoy a naturalist like a Shakespearean costume at King Arthur's court annoys an English historian.\\nAlso, scary things like snakes and spiders will consist of whatever the pet store had in stock. Never mind where these animals live. Never mind if they're even really dangerous either.\\nCan qualify as a full-fledged biology fail in cases where the animal wouldn't even be able to survive in the environment where it's depicted, never mind being in the wrong place. Fishes are perhaps the most common victims of this, as when freshwater species such as piranha or electric eels are shown living in the ocean, salinity ought to kill them in minutes.\\nMisidentified wildlife is another feature of this Trope. This tends to happen to birds a lot. Some movies show a bird making generic ambient noise type calls, usually via stock footage. This ruins any sense of immersion for birdwatchers, who will immediately ask, \\\"Hey, what's a White-throated Sparrow doing in feudal Japan?\\\" Indeed one will eventually come away with the impression that there are no birdwatchers in Hollywood.\\nOccasionally, a movie or TV show will attempt to justify Misplaced Wildlife by identifying an animal onscreen, such as that White-throated Sparrow, as something ''completely'' different - even if it's a species that looks nothing like the creature onscreen.\\nAlso, sometimes background sound effects contain sounds of animals not native to the setting of the film/TV show. Perhaps the most notorious example is the use of the distinctive \\\"laugh\\\" of the Australian kookaburra in jungle scenes set in Africa, or anywhere else other than Australia. This began with MGM's early-30s jungle movies like Tarzan, the Ape Man, and ever since, everybody has used this sound as jungle background.\\nNaturally, this trope occurs much less often when the filming actually takes place within the area where the story is set. Also, this trope generally applies only to normal animals. Funny Animals can be easily called as immigrants of some sort if found out of their element. A few cases might be explained with Creator Provincialism, as the creators incorporate the animals they're are most familiar with.\\nNote that this trope can also occur with plant life. In fact, it occurs often enough that Misplaced Vegetation is its own Sister Trope.\\nSee also Noisy Nature, Diurnal Nocturnal Animal, Artistic License \\u2013 Paleontology, Somewhere, an Ornithologist Is Crying, Somewhere, a Herpetologist Is Crying, and Polar Bears and Penguins.\\n\\nExamples"
    },
    "name": "Misplaced Wildlife",
    "rdf_element": "MisplacedWildlife/int_890b49e",
    "short_name": "MisplacedWildlife",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/MisplacedWildlife"
  },
  {
    "categories": [
      "FoodTropes"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "Subverted in Harry Potter and the Philosopher's Stone (The Movie), when Harry asks Ron on the train if he'd like anything from the trolley. His expression and tone of voice when he pulls out his squashed corned beef sandwich and says \\\"I'm set\\\" is priceless.",
      "general": "Tastes great, better filling! Sandwiches of one kind or another have been the Trademark Favorite Foods of many characters.\\nOccasionally characters may comment on its simplicity, use wacky ingredients, or overstuff their sandwiches, but it's all the same basic food item.\\nWith the aid of a handy logical fallacy, one can prove that a ham sandwich is better than eternal happiness: nothing is better than eternal happiness, and a ham sandwich is better than nothing.\\nAlso see Dagwood Sandwich. See also Inherently Funny Words, Wasteful Wishing, as a common part of that trope is the character wishing for a sandwich. When provided as a health item or powerup in videogames, see Hyperactive Metabolism and Power-Up Food.\\n\\nExamples"
    },
    "name": "Satiating Sandwich",
    "rdf_element": "SatiatingSandwich/int_890b49e",
    "short_name": "SatiatingSandwich",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SatiatingSandwich"
  },
  {
    "categories": [
      "DiscreditedTrope"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "While it may be a magical plant rather than quicksand, the devil's snare in the film version of Harry Potter and the Philosopher's Stone fits the functional parts of the trope perfectly. When it grabs the heroes and starts crushing them, Hermione remembers that devil's snare only reacts to panicked movement, so she and Harry relax, slipping through the plant's vines. Ron, on the other hand, is so freaked out that he keeps flailing around and will obviously get strangled. Hermione manages to remember another weakness of devil's snare and uses it to free him.",
      "general": "Quicksand is a common and deadly element of jungle and desert terrain, and its most dangerous feature is its ability to suck people and animals down and drown them in a malevolent blend of sand and water. Although most victims blunder blindly into quicksand, it sometimes seems that the merest touch of an extremity is enough to pull the unwary into its muddy and all-consuming depths like iron filings to a magnet.\\nOriginally a movie serial and B-film device, this trope has been carried over to television by way of programs that mimicked or paid homage to those films, or to pulp fiction in general. Then it also moved to Video Games. This trope is pretty much a Discredited Trope nowadays, although the Shifting Sand Land of video games is still allowed to play it straight, as a gameplay challenge if nothing else.\\nIn truth, quicksand (while real) isn't terribly common, and exerts none of its movie counterpart's mythical \\\"sucking\\\" power and isn't nearly the Sticky Situation the movies made it look like. In fact, real quicksand is so dense that you can't sink in it; the usual advice for someone who finds themselves caught in deep quicksand is to simply relax and float on their back. Struggling in a panic may actually cause you to drag yourself down instead of up, and survival guides stress the importance of staying still if this starts to happen. While animals and people do sometimes die in quicksand, it's almost never from drowning \\u2014 it's from exposure, dehydration or predation after exhausting themselves struggling to get out - with the right combination/consistency of sand, clay, water, and salt, it is nearly impossible to escape the stuff without help.\\nIf you are weighed down by something you can't remove, you could sink, but that would happen even in boring, old regular water.\\nSpeaking of water, real quicksand requires it and writers are traditionally unfettered by such technicalities. Fictional quicksand tends to be placed in the desert or away from a river or any apparent source of water, although a hidden spring could in theory create quicksand in surprising places. In live action, budget and set-design constraints sometimes lead to a \\\"quicksand pit\\\" barely large enough to hold the actor. Technically speaking, desert quicksand is hand-waved as being very loose sand that looks normal but is incapable of supporting a large amount of weight.\\nAlthough not always strictly \\\"sand\\\", tidal flats (mudflats) have mud which is actually closer to the danger portrayed in fiction as quicksand. The tide regularly refreshes the surface and smooth implies solid to people. Viscosity decreases after an initial stress. More to the point, being a tidal flat, it's a case where people actually ARE at risk for their lives, since tides have this funny way of coming back in after going out. There are tidal flats which have seen so many deaths the locals are tired of watching stupid people die, but it's not wholly clear how much that is getting stuck in one specific spot versus getting trapped some distance from dry ground on slow-to-traverse terrain or attempting to wait on an insecure bit of slightly higher ground as the tide comes in around you.\\nThere is also a hazard in nature called a \\\"predator trap,\\\" where an animal gets itself hopelessly stuck in thick, sticky mud or tar and its corpse attracts the attention of multiple carnivores, causing them to become trapped and die of exposure as well\\u2014sometimes becoming fossil goldmines (the La Brea tar pits are one example).\\nSee also Sand Is Water, Mucking In The Mud, Swamps Are Evil, and Bubblegloop Swamp... Also compare Unrealistic Black Hole because both black holes and quicksand are portrayed in media as pulling in anything nearby whereas both only consume things which have gotten too close in the first place."
    },
    "name": "Quicksand Sucks",
    "rdf_element": "QuicksandSucks/int_890b49e",
    "short_name": "QuicksandSucks",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/QuicksandSucks"
  },
  {
    "categories": [
      "ActionAdventureTropes"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "In the Harry Potter and the Philosopher's Stone movie, the gang is alerted to Fluffy's presence by his drool on Ron's shoulder. Notably, they're aware he's there; the drool just lets them know he's awake.",
      "general": "What is the first hint that a giant monster, yet unseen, is towering over some characters, or clinging to the ceiling above them?\\nNot the vibration of its moves, the sound of its breathing, the putrid smell or anything like that...\\nNo, in some case, the very first hint they'll get of this menacing presence is... some liquid splashing over their heads or shoulders.\\nMost often drool, though it can be other secretions. Sometimes this drool is acidic, and they're really in trouble. May be also the blood or remains of the monster's last victim for extra fun.\\nIn a way, an organic form of *Click* Hello, typically followed immediately by Oh Crap!.\\nAlso see Phlegmings. If the characters are inside a Cave Mouth, they may realize in horror that this is the cause of that drippy sensation.\\nNot to be confused with Perverted Drooling."
    },
    "name": "Drool Hello",
    "rdf_element": "DroolHello/int_890b49e",
    "short_name": "DroolHello",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/DroolHello"
  },
  {
    "categories": [
      "MediaAdaptationTropes"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "A minor one from Harry Potter and the Philosopher's Stone is how the kids get caught out of bed. For some reason they decide to go to Hagrid's house at night despite finding out about the Philosopher's Stone during the day. They have no reason to sneak out, and why would Malfoy have any reason to follow them? Does he skulk around outside the Gryffindor common room waiting for them to make a move? It's just giving them one big Idiot Ball so they can be caught and have to do detention in the forest. In the book, they were out of bed at night because they were trying to smuggle Hagrid's dragon (who had hatched weeks earlier) out of the school. Malfoy knew about this because he'd read a letter in Ron's book about the time and date of when they'd be out and about to get rid of the dragon.",
      "general": "So you're watching the movie version of your favorite book, and wait \\u2014 wasn't Alice's sword broken two scenes ago? What happened to the scene where she went to go get it reforged? And why is Bob seemingly flirting with Charlotte? Doesn't he indicate in the third book that he never liked her and suspected her of being a traitor?\\nAlmost no adaptation is perfectly accurate. Details often get left out of adaptations, and sometimes this works, sometimes this doesn't (particularly to those unfamiliar with the original work). Other times, details are added that seem perfectly fine at the time, but end up directly contradicting canonical plot points \\u2014 with a continuing work, this may even be a plot point the original writers hadn't actually written yet. Sadly, authors are not psychic.\\nIf added material results in a plot hole, it may require an additional scene to Hand Wave it away. If removed material caused the problem, there may be a brief Info Dump to fill everyone in on what they missed. Contrast with its inverse, the Plot Tumor.\\nIf this is caused by a work being translated into another language, it's a Dub Induced Plothole.\\nIf there is simply a lack of explanation as to why something happened, instead of a full-on Plot Hole, it's Adaptation Explanation Extrication."
    },
    "name": "Adaptation-Induced Plot Hole",
    "rdf_element": "AdaptationInducedPlotHole/int_890b49e",
    "short_name": "AdaptationInducedPlotHole",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/AdaptationInducedPlotHole"
  },
  {
    "categories": [
      "TranslationTropes"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "In Harry Potter and the Philosopher's Stone in Malaysia, the part where Quirrell bursts in and announces \\\"THERE'S A TROLL IN THE DUNGEON!\\\" has \\\"troll\\\" translated in the Malay subtitles as \\\"orang kerdil\\\" - \\\"tiny person\\\".",
      "general": "Translation is difficult. Failing to carry details from one language to another is all too easy. A term in one language may have no equivalent in another, or the associations might differ wildly. Rendering idioms literally often makes no sense whatsoever. Subtleties get dropped and grammatical correctness slides when things get complex.\\nPuns, figurative speech, connotations and cultural references: they all create problems.\\nThe risk for this is especially high when translating from one's native language into a second language, which is why most professionals translate into their own language.\\nFaced with this problem, translators have come up with various tactics. In extremes, some do a Gag Dub, or a Woolseyism. Some even hang a Lampshade on the untranslatable term. A skilled translator might need to be almost as creative as the original writer in creating a satisfying parallel text. And when the translator is really excellent, we don't notice their work at all.\\nWhen the original language of a film is mentioned in the film itself (for example, \\u201CDo you speak English?\\u201D in an American Hollywood film), translators, depending on country, might replace it with the phrase \\u201Cour language\\u201D. Countries with the opposite conventions include at least Finland, Sweden and the Netherlands, where nothing outside little children's and \\\"family\\\" films gets dubbed.\\nWhen done with this in fansubs, some often place a little note explaining the context of the pun or cultural reference. Other translations put a note explaining it. This often happens if the translator decides to Translate the Loanwords Too.\\nFor the film of the same name, see Lost in Translation."
    },
    "name": "Lost in Translation",
    "rdf_element": "LostInTranslation/int_890b49e",
    "short_name": "LostInTranslation",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/LostInTranslation"
  },
  {
    "categories": [
      "ComingAttractions"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "Philosopher's Stone:\\n The teaser includes the shot when Neville is flying away from the flying class, except Neville hasn't been Chroma Keyed in yet so it's just a background plate of everyone looking up at nothing.\\n A number of TV spots showed Hermione saying, \\\"He's rather disagreeable, isn't he?\\\" It's nowhere in the film and was also not in the Deleted Scenes on the DVD. The fact that the kids don't have their house-colored uniforms yet would seem to indicate that it takes place sometime before they get up to their dormitories for the first time. Possibly it's from the filmed-but-never-released scene with Peeves, in which case Peeves would presumably be the \\\"he\\\" to which Hermione was referring. It may also be from the scene when Harry meets Malfoy for the first time.\\n The theatrical trailer also has a shot not in the film. It shows Percy leading the first years down a hallway and is therefore quite likely from the elusive Peeves scene.",
      "general": "Never Trust a Trailer taken to the logical extreme: some trailers are so untrustworthy they include scenes that have been cut from the film itself. Or even worse, filmed just for the trailer.\\nMost trailers are put together by companies that have no idea what is or is not going to get cut from the film, but this doesn't really help the poor bastard that only came to see the scene that didn't make it in.\\nThis may, however, be justified by the fact that the movie is still being edited as the trailers are released. Since the editing process may take months and sometimes only finish mere weeks before the theatrical release, it is rather common for the trailer scenes to either become a Deleted Scene or be replaced by an alternate take in the final cut.\\nIn fact, such scenes can be found in nearly every movie with a sufficient amount of promotional material. Expect them to appear in the Deleted Scenes section of the DVD or to be included in a Recut for a Limited Special Collector's Ultimate Edition."
    },
    "name": "Missing Trailer Scene",
    "rdf_element": "MissingTrailerScene/int_890b49e",
    "short_name": "MissingTrailerScene",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/MissingTrailerScene"
  },
  {
    "categories": [
      "MusicTropes"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "During Christmas time in Harry Potter and the Philosopher's Stone ghostly carolers are seen roaming the Hogwarts halls, singing a rather eerie song.",
      "general": "Ah, Christmas time! When the trees are trimmed, presents are wrapped, and people form troupes and go around singing Christmas Songs. It's just one of the ways to establish that it's that time of the year again.\\nCarolers are often used in works to establish the season and help create the environment. But they differ from other such things, Christmas trees, lights, wreathes and holly and mistletoe, in that carolers are actual characters and thus are able to interact with each other and at times affect the plot of the story.\\nIf participating, the characters may be the ones arranging it or at least willingly joining in, or they may be pressed into it and dragged along, in which case they will either do everything they can to ruin the experience for everyone else, or will gradually come to enjoy themselves. If listening they may pause to appreciate the singing, perhaps dropping some cash if the carolers have a donation box or they may simply ignore them or even yell at or chase them off, which is common for The Grinch or the Scrooge.\\nThe carolers themselves can be anything from a family or group of friends who get together and go sing to people, to a full choir singing on the street corners or in the city parks in seasonal costume, often styled after nineteenth century England or early twentieth century America. While they are often shown in small choirs, this is not necessary; it may only be a single person going around singing to friends and neighbors (singing talent optional).\\nIn a fantasy setting, carols for a Christmas Equivalent could also count.\\nA staple of the Christmas Episode. Not to be confused with fans of A Christmas Carol. Satirical and mock carols will often be an Anti-Christmas Song."
    },
    "name": "Christmas Carolers",
    "rdf_element": "ChristmasCarolers/int_890b49e",
    "short_name": "ChristmasCarolers",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ChristmasCarolers"
  },
  {
    "categories": [
      "Spectacle"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "Harry Potter and the Philosopher's Stone used a brief shot of Big Ben, the Houses of Parliament, and the River Thames to establish London before we cut to Harry and Hagrid arriving at the Leaky Cauldron. The 6th shows the Millennium Bridge being destroyed by Death Eaters.",
      "general": "Some cities are renowned for their industries. Hollywood makes movies, Detroit makes...made cars. Others are known as hotspots for the scientific community, like Geneva. Or for the political community, like... Geneva. And in some places, there is a landmark. Such as Geneva.\\nA few of these landmarks, in various locations around the globe, are so well-known by so many people that they've come to function as a sort of visual shorthand for the city, sometimes the country, in which they're located to the point where some footage of the landmark in question must be portrayed on the screen, even when that landmark is irrelevant to the plot and nowhere near where the characters are supposed to be. The National Mall in Washington, DC, Westminster Palace (specifically, its clock tower housing Big Ben) in London, the Taj Mahal in India, St. Basil's Cathedral in Moscow (occasionally mistaken for the nearby Kremlin), the Sydney Opera House in Sydney... When these locations are portrayed in a film or TV show, expect numerous, panoramic establishing shots of the landmark in question. Occasionally, these landmarks will be visible out of windows or from rooftops where viewing them in real life would be geographically impossible, or in historical settings when they weren't actually built yet.\\nIconic structures such as these can also function as Red Shirts. If they are ever destroyed, then circumstances have become dire indeed. Which naturally means that in a disaster movie, the landmark in question will probably be doomed to certain destruction. The remainder of the Hollywoodland sign in California and the Statue of Liberty are popular targets for CGI catastrophes. Alternatively, the structure will be one of the few things left intact After the End, either mostly undamaged, to give the characters some kind of hope for the future, or nearly collapsed, as a testament to how much has been lost.\\nThis trope is not simply here to list various landmarks around the world, but rather instances of landmarks in fiction used as a shortcut to showing either where the action occurs or how bad things have gotten.\\nCan overlap with both Scenery Gorn and Scenery Porn, depending on how lovingly and lavishly the landmark in question is filmed. For instances where entire countries, or more, are represented by the landmarks of only one city, see Britain Is Only London. Compare Landmarking the Hidden Base, where a major HQ is situated inside or underneath one of these monuments; Rushmore Refacement, where they are deliberately altered; Weaponized Landmark, where they're turned into Weapons Of Mass Destruction; and Monumental Damage, where they are damaged or destroyed, possibly as a result of a Monumental Battle.\\nThe trope namer is on the Champ de Mars in Paris and was completed in 1889. The Other Wiki calls the Eiffel Tower \\\"one of the most recognizable structures in the world.\\\"\\n\\nExamples"
    },
    "name": "Eiffel Tower Effect",
    "rdf_element": "EiffelTowerEffect/int_890b49e",
    "short_name": "EiffelTowerEffect",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/EiffelTowerEffect"
  },
  {
    "categories": [
      "ActionAdventureTropes"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "Downplayed in Harry Potter and the Philosopher's Stone, since Ron doesn't actually get killed, but near the end of the chess game, he had every reason to believe that he would be...",
      "general": "Before a character dies, they fire off a line essentially saying \\\"I'm going to die, but our fight goes on,\\\" or otherwise demonstrating their continued defiance toward and disdain for their killers.\\nCan be the last line of an entire series if it's a Bolivian Army Ending. The Doomed Moral Victor is... fond of this trope. A specific take is Regret Eating Me as well as See You in Hell. Very very often a Dying Moment of Awesome. Some do manage to live, which The Cavalry can help along, but there's significant overlap with Famous Last Words. A subtrope of Gallows Humor.\\nSee Face Death with Dignity. Similar to Defiant to the End, but employs humor rather than treating the situation with contempt or rage. See also Dying Declaration of Hate.\\nSince this is a Death Trope, beware of unmarked Spoilers.\\n\\nExamples"
    },
    "name": "\\\"Facing the Bullets\\\" One-Liner",
    "rdf_element": "FacingTheBulletsOneLiner/int_890b49e",
    "short_name": "FacingTheBulletsOneLiner",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/FacingTheBulletsOneLiner"
  },
  {
    "categories": [
      "Spectacle"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "In Harry Potter and the Philosopher's Stone, the floating candles in the Great Hall were done with wires. In fact, after Quirrell announces the troll in the dungeon, there's a close-up of McGonagall in which you can plainly see the wires which the candles are suspended from. An accident with a falling candle prompted them to make the switch to CGI candles for safety reasons.",
      "general": "The inevitable fact that, as franchises go on, they will be given a special effects (very often, CGI) upgrade to compete with the times. Justified in the fact that many of today's sequels are of series from the 1980s or 1990s, where then-new CGI was often ditched in favor of actual explosions and stunts, and CGI is much safer (and cheaper) than, say, blowing up an entire office building. Often results in They Changed It, Now It Sucks if the CGI is poor or merely jarring."
    },
    "name": "Special Effects Evolution",
    "rdf_element": "SpecialEffectsEvolution/int_890b49e",
    "short_name": "SpecialEffectsEvolution",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SpecialEffectsEvolution"
  },
  {
    "categories": [
      "ThisIndexIsOnFire"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "Happens to Seamus Finnigan in the movie adaptation of Harry Potter and the Philosopher's Stone. Also tends to happen to Finnigan in the books.",
      "general": "Whenever fire or explosions are involved, the first thing to go is inevitably the eyebrows. This is nearly always Played for Laughs. This is usually a good way to have people hit by fire come away without true injuries in comedic works.\\nIn Real Life, eyebrows do get singed off fairly readily in the case of flame, due to being fairly prominent on the face and thinner than normal hair. However, singed eyebrows may accompany more serious burns as well, so Don't Try This at Home.\\nSee also Playing with Fire, Kill It with Fire, or Ash Face. Compare Close-Call Haircut."
    },
    "name": "Eyebrows Burned Off",
    "rdf_element": "EyebrowsBurnedOff/int_890b49e",
    "short_name": "EyebrowsBurnedOff",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/EyebrowsBurnedOff"
  },
  {
    "categories": [
      "CallToAdventure"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "Something similar is done in the movie version of Harry Potter and the Philosopher's Stone. \\\"I can't be a wizard! I'm just Harry! Just Harry!\\\"",
      "general": "Often preceded by \\\"You're a hero!\\\" The Hero will respond: \\\"I'm not a hero. I'm _____!\\\"\\nCan be used in a variety of ways, including:\\n The Hero is awesome. May deliver the line as \\\"I'm no hero. I'm ____man!\\\", \\\"I'm not a hero; I'm a superhero!\\\" or \\\"I'm not a hero. I'm just doing my job.\\\" If delivering the line to a villain and trying to be exceptionally badass, The Hero may say: \\\"I'm not a hero. I'm Your Worst Nightmare\\\" or something along those lines.\\n The Hero is humble. Occasionally accompanied by Think Nothing of It. They may point out others who are The Real Heroes.\\n Heroic Self-Deprecation. May lead to You Are Better Than You Think You Are.\\n The Hero attempts to refuse or ignore the call, but will eventually accept it.\\n The Hero exhibits false humility. Can lead to Dude, Where's My Respect? or Dude, Where's My Reward?. This \\\"hero\\\" may not be a hero at all. Can provide a lesson on the importance of humility.\\n The Hero realized that he/she is not the hero he/she thought he/she was, and, as a result, his/her confidence is shot. Depending on the medium and the genre, may deliver An Aesop.\\n The Hero only says his/her name.\\n The Hero (or Anti-Hero) uses this logic to enable himself/herself to do what no one else could do, or should do, for the \\\"greater good\\\". Occasionally accompanied with the Zero-Approval Gambit.\\n The Hero may not actually be a hero.\\nA subtrope of I Am the Noun. Compare I'm a Doctor, Not a Placeholder. Contrast The Chosen Zero."
    },
    "name": "I'm Not a Hero, I'm...",
    "rdf_element": "ImNotAHeroIm/int_890b49e",
    "short_name": "ImNotAHeroIm",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ImNotAHeroIm"
  },
  {
    "categories": [
      "Trivia"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "In Harry Potter and the Philosopher's Stone, Rik Mayall filmed scenes as Peeves the Poltergeist. They were cut from the film and for some reason or another have never been released.",
      "general": "It can be nearly impossible to tell exactly what will happen between script and screen. Between casting, rewrites, various production quibbles and the like, the final product could easily be completely different than what the people involved thought they were working on. Editing can have a particularly dramatic impact, with the director and editor being able to shape the footage at their own whim. Occastionally, whole characters fall victim to cutting. This trope is what happens when a Deleted Scene also removes an entire actor from the product.\\nSee also Demoted to Extra, when a character's screentime is simply cut to the point of insignificance."
    },
    "name": "This entry is trivia, which is cool and all, but not a trope. On a work, it goes on the Trivia tab.\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\n\\t\\t\\n\\t\\tDeleted Role",
    "rdf_element": "DeletedRole/int_890b49e",
    "short_name": "DeletedRole",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/DeletedRole"
  },
  {
    "categories": [
      "CreatorSpeak"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "Rik Mayall claims some of the child actors tried to do this to him during his (cut from the final film, sadly) scenes as Peeves in Harry Potter and the Philosopher's Stone. Luckily for Mayall, he had experience with that sort of thing.",
      "general": "\\\"Corpsing\\\" (also called \\\"breaking\\\") is actor-speak for having an unscripted fit of laughter onstage, so-called because the worst time to have the giggles is when one is playing a corpse. Corpsing doesn't necessarily mean that the material is especially funny (though, of course, it can be), or that the actors aren't taking it seriously; it just happens, and even excellent actors can corpse. Many actors try to cover this by covering their mouth and muffling the sounds they make. When this is done, a fit of laughter can rather haphazardly be turned into violent sobbing, with varying levels of success. Of course, that only helps if violent crying is appropriate for the scene (again, playing a corpse leaves you in trouble, as corpses usually don't laugh - usually).\\nSome actors, of course, will try their level best to make other actors corpse. It seems to be a feather in one's cap of some sort, to either be the guy who never corpses, or the guy who can make even the guy who never corpses corpse. Bonus points if you're working in a scene with a very seasoned and well-respected actor. Even if they have a great sense of humor in real life, getting someone the caliber of Jeremy Irons or Meryl Streep to get the giggles is a big achievement.\\nAt other times, it is just mean to tell an actor to keep a straight face on camera while watching a character bounce off the walls.\\nA common type of Hilarious Outtakes. On the other hand, can be subject to Throw It In \\u2014 if the work is a comedy and the actors are able to recover in time for their next line, it can make for a natural aversion of Tough Room. Opposite of The Stoic.\\nWhen the hapless individual actually is trying to play a corpse, this can overlap with The Living Dead."
    },
    "name": "Corpsing",
    "rdf_element": "Corpsing/int_890b49e",
    "short_name": "Corpsing",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/Corpsing"
  },
  {
    "categories": [
      "SpeechesAndMonologues"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "In Harry Potter and the Philosopher's Stone, Hermione explicitly tells the title protagonist, \\\"Do be careful.\\\"",
      "general": "Our hero is about to go into a dangerous situation. Cue the hero's best friend/mentor/lover/commanding officer/etc., reminding the hero just how dangerous it's going to be.\\n\\nExamples"
    },
    "name": "The Be Careful Speech",
    "rdf_element": "TheBeCarefulSpeech/int_890b49e",
    "short_name": "TheBeCarefulSpeech",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TheBeCarefulSpeech"
  },
  {
    "categories": [
      "InformationDesk"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "In Harry Potter and the Philosopher's Stone, Harry yells \\\"YOU LIAR\\\" at Voldemort.",
      "general": "This trope is when a character flatly accuses another of outright lying. This can be phrased in different ways; \\\"You lie,\\\" \\\"That's a lie,\\\" \\\"You're lying\\\", \\\"You are telling a lie,\\\" \\\"You're a lying liar that lies,\\\" etc.\\nThis is usually the response to a trope from the Family Twists Index. This can happen either while the receiver is speaking or when he is not speaking. Occurs when a character speaks Blatant Lies and another character knows that he is lying. Often Played for Drama. Common in trial scenes when some witness has just attributed an incriminating remark to another person present. See also Suspiciously Specific Denial and Villains Never Lie. Contrast I Lied."
    },
    "name": "That Liar Lies",
    "rdf_element": "ThatLiarLies/int_890b49e",
    "short_name": "ThatLiarLies",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ThatLiarLies"
  },
  {
    "categories": [
      "IndexOfGothicHorrorTropes"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "In Harry Potter and the Philosopher's Stone, after he arrives in Hogwarts and everyone is in bed, Harry's up looking out his window at the moon. It fits into the \\\"melancholy yet hopeful\\\" category as it marks the beginning of a new life for him, yet it's a somewhat sad scene because of the backstory with his parents.",
      "general": "The Moon. Cold and distant, alone and lifeless... yet, it's the only celestial body whose light can pierce the pitch black night. So when a character is shown moon gazing, it means he or she shares many of these lunar traits: they are isolated and introspective, melancholy... yet oddly hopeful. All this just by having them look quietly at the moon, or using it as a big old backdrop.\\nHe or she may have a Tragic Dream, have suffered a Dark and Troubled Past, or have embarked on some new quest that promises to change their life. The trope is also frequently used in love songs.\\nCan overlap with Weird Moon, often to emphasize the moon. In this case, the moment is used both to establish the world and the character.\\nContrast Watching the Sunset and Cue the Sun."
    },
    "name": "Melancholy Moon",
    "rdf_element": "MelancholyMoon/int_890b49e",
    "short_name": "MelancholyMoon",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/MelancholyMoon"
  },
  {
    "categories": [
      "AudienceReactions"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "There's considerable disagreement among fans about whether the first two movies' (Philosopher's Stone and Chamber of Secrets) faithfulness to the books is their greatest strength or their greatest weakness. People in the first camp are likely to view Prisoner of Azkaban as a horrific plot hole-filled mess, while people in the second camp are likely to see it as when the movies finally started to get it right.",
      "general": "Sometimes there's a sequel that attempts to address complaints fans had with the original, or build upon the original's perceived strengths. Sometimes, in its attempt to do so, though, it may lose track of what made the original so great for many. If that happens, there may be a huge split in the fanbase, with some fans saying that the sequel is an excellent improvement, with others saying that the sequel's improvements aren't worth the other changes made. This can result in large flame wars when someone who prefers the original argues with those who consider the sequel to be superior.\\nSometimes, the company will try to fix things with the next installment in the series, only to make more friends and more enemies. This may lead to an unpleasable fanbase.\\nSee also First Installment Wins and Critical Backlash."
    },
    "name": "Contested Sequel",
    "rdf_element": "ContestedSequel/int_890b49e",
    "short_name": "ContestedSequel",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ContestedSequel"
  },
  {
    "categories": [
      "UnisexTropes"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "Harry Potter and the Philosopher's Stone: Harry faces Voldemort alone after Ron gives a \\\"Not me, not Hermione, you!\\\" speech essentially to this effect.",
      "general": "Everything comes down to a one-on-one fight between the hero and whoever has been his worst antagonist in the current plot. The hero's friends and reinforcements show up in time to intervene and give the hero a decisive victory with their overwhelming numbers and/or firepower, but they don't \\u2014 or the hero won't let them \\u2014 because \\\"This is something he's got to do himself.\\\"\\nThis is the logical extension of It's Personal, the cousin of Leave Him to Me, and often stems from Honor Before Reason. Also see I Work Alone for denying help from the beginning. There's also Locked Out of the Fight, where the hero does want help but circumstances contrive to prevent the helpers from helping. Compare Shoo Out the Clowns. Contrast In the End, You Are on Your Own, where the helpers can't be of any help even if they wanted to. See also What You Are in the Dark. Also contrast Figure It Out Yourself, where the bystanders could help, but don't, even if you ask, as well as I Can't Do This by Myself.\\nContrast Helping Would Be Killstealing, for when it's a matter of experience and personal growth rather than honor or revenge."
    },
    "name": "This Is Something He's Got to Do Himself",
    "rdf_element": "ThisIsSomethingHesGotToDoHimself/int_890b49e",
    "short_name": "ThisIsSomethingHesGotToDoHimself",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ThisIsSomethingHesGotToDoHimself"
  },
  {
    "categories": [
      "SpeculativeFictionTropes"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "Harry Potter and the Philosopher's Stone: This is no graveyard... it's a chess board!",
      "general": "Characters traveling in an unfamiliar area choose to stop at a landmark. They discover that it's not terrain, it's something, and much bigger than that something has any right to be.\\nA common Subtrope of this trope includes finding out the hill, island, or entire world you're on is a giant turtle, or that a mountain is a sleeping Giant / Troll / Earth Elemental, or that the asteroid cave you're hiding in is a giant space slug, or that it's still just the kind of place you thought it was, but alive.\\nFor ships/stations that may literally be confused with moons (or planets), see Planet Spaceship. See also Big Dumb Object and Dyson Sphere. If it's a real-world location, may overlap with Weaponized Landmark. Whatever the actual object turns out to be the discovery of it can often lead to an Oh Crap! moment. Contrast No Mere Windmill, Genius Loci. And just to note, Vulcan doesn't have one."
    },
    "name": "That's No Moon!",
    "rdf_element": "ThatsNoMoon/int_890b49e",
    "short_name": "ThatsNoMoon",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ThatsNoMoon"
  },
  {
    "categories": [
      "FlyingTropes"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "Harry Potter and the Philosopher's Stone: Harry actually does this when he and the Slytherin Seeker are both going for the Snitch. A subversion in that the Snitch actually is in sight and the Slytherin player gets skittish and cautiously pulls up well before he would collide with the ground, leaving Harry alone to finish the maneuver and snatch the orb.",
      "general": "A Wronski Feint is a maneuver where a pursued character feints at an obstacle in order to get their pursuer to follow. They pull up at the very last second, and the split second of confusion, or their enemy's inferior piloting skills, causes the enemy to crash into the obstacle.\\nThis trope allows the work to show off what a skilled pilot the hero is - he can take out the enemy with only his piloting skills. It also shows the audience his level of fearlessness and ability to keep cool under pressure.\\nNote that while the obstacle is usually a cliff, the ground, or a similar immobile object, it's not unheard of to pull this off with missiles, other vehicles, or other mobile targets.\\nNamed after the Quidditch technique where one team's Seeker will pretend to see the Snitch near the ground and go into a dive to attempt to lure the opposing Seeker into crashing into the ground. The Wronski Feint is first mentioned in Harry Potter and the Goblet of Fire, and again in Quidditch Through the Ages by Kennilworthy Whisp, wherein it was revealed to have been named after famed Polish Seeker Josef Wronski.\\nSometimes peppers and ends a longer Try and Follow sequence or Aerial Canyon Chase.\\nSubtrope of Try and Follow. Compare Dodge by Braking, Deadly Dodging. Buzzing The Deck is a similar move done just for the hell of it. A Game of Chicken can cause one or both participants to fall victim to this.\\n\\nExamples"
    },
    "name": "Wronski Feint",
    "rdf_element": "WronskiFeint/int_890b49e",
    "short_name": "WronskiFeint",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/WronskiFeint"
  },
  {
    "categories": [
      "CreatorStandpointIndex"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "In keeping with how the original novel was handled (see Literature, below), the American version of Harry Potter and the Philosopher's Stone, was retitled Harry Potter and the Sorcerer's Stone. This required every scene in which the term \\\"Philosopher's Stone\\\" was mentioned to be shot twice, with the actors changing the words to \\\"Sorcerer's Stone\\\". Viewers in Canada and the UK can see examples of these alternate scenes in the making-up featurettes on the DVD/Blu-ray release.",
      "general": "A common belief among film and TV executives is that everyone who watches media has the intellect of Beavis and Butt-Head.\\nThis belief is a root cause of Executive Meddling, especially common among shows intended for children. Kids can legitimately be said to be less knowledgeable than adults, though we all probably know a depressingly large number of exceptions.\\nOf course, there is a \\\"moron\\\" demographic out there, and it has its members, but executives seem to believe that every person who watches TV belongs in it. This may be due to something known as the \\\"80-20\\\" rule in business\\u2014in this case that market-research shows 80% of money spent on television-advertised products comes from the lowest 20% in terms of education and intelligence, so show-content is naturally geared towards them.\\nOn top of that, not only are viewers stupid, they are also intolerant of people and things unlike themselves, ignorant, hate change, need to be instantly satisfied, and have the attention span of a goldfish."
    },
    "name": "Viewers Are Morons",
    "rdf_element": "ViewersAreMorons/int_890b49e",
    "short_name": "ViewersAreMorons",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ViewersAreMorons"
  },
  {
    "categories": [
      "DeathTropes"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "Harry Potter and the Philosopher's Stone:\\n Ron sacrifices himself as a chess piece so that they can win the magical game of chess and reach the stone. Noted by Hermione and Harry in the book, where he himself is the knight, so he has to stand still and let the queen 'take' him. In the film he's sitting atop a massive stone horse, and many people have asked themselves why he just sat on that horse and watched as the queen approached, rather than jumping off... Granted, he doesn't die, but he could have. It's likely that Ron didn't jump off of the horse because it would have counted as a forfeit (that is, he only counts as the knight as long as he remains on the horse, or that jumping off the horse and onto an adjacent square would have counted as \\\"cheating\\\").\\n Also Harry himself. Although he realises that he has little to no chances against the thief, be it Voldemort or Snape, he doesn't consider simply sending an owl to the absent Dumbledore until well into the \\\"obstacle course\\\". Neither does he heed McGonagall's assurances that the Stone was perfectly safe, which, big shock, it actually was. This can be narratively justified by the fact that he was an 11-year old boy, even if it was stupid for the character.",
      "general": "We all know the trope. Everyone's caught in a life-or-death situation. One of the characters hedges their bets, steps forward so the others survive, and ends up on the \\\"death\\\" side of the equation. Pathos is obtained, tears are shed, etc., etc.\\nExcept... well, did he/she really need to do that? Couldn't he have gotten out of the way of the death trap once it was smashed and about to explode? Couldn't she have just held out for a few seconds longer until help arrived? Couldn't he have just talked them all out of that? What can we say, it's pathos \\u2014 logic must be left by the wayside. The Plot Reaper has spoken.\\nA Stupid Sacrifice is what happens when a Heroic Sacrifice has a head-on collision with Fridge Logic. It is not a Senseless Sacrifice, where someone offers themselves up as a sacrifice only for outside factors to make it useless; this is when a sacrifice occurs when anyone in command of all their logical faculties could've seen that it didn't have to end that way. Surprisingly little overlap with Martyr Without a Cause, but sometimes the result of Chronic Hero Syndrome: The Knight Templar or Well-Intentioned Extremist may make them \\u2014 and lament them as Dirty Business \\u2014 because they can't be bothered to notice that they were unnecessary. If a proposed sacrifice is nixed on the grounds it would be stupid, see Who Will Bell the Cat?. Note that this doesn't apply when the character could have lived, but quite clearly didn't want to.\\nOften a case of Writer on Board. They want this character to die, for whatever reason. There are no other alternatives, period. This situation makes it similar to Dropped a Bridge on Him; the \\\"sacrifice\\\" part making it \\\"honorable\\\", but they weren't going to make enough effort to make it the only logical way.\\nIf the sacrifice is stupid because it didn't accomplish what it was supposed to but was still the logical choice, that's Senseless Sacrifice, not this trope. The two tropes can overlap when a Stupid Sacrifice doesn't accomplish its goal, but it is rare.\\nCounter Trope to Negate Your Own Sacrifice. Subtrope of Heroic Sacrifice. Compare Shaggy Dog Story.\\nThis is a Death Trope. Spoilers ahoy."
    },
    "name": "Stupid Sacrifice",
    "rdf_element": "StupidSacrifice/int_890b49e",
    "short_name": "StupidSacrifice",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/StupidSacrifice"
  },
  {
    "categories": [
      "CombatTropes"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "Seen in the film Harry Potter and the Philosopher's Stone, see Literature (and it was more gruesome, beside \\u2014  instead of merely burning Quirrel, Harry's touch actually caused him to crumble into ash.",
      "general": "Sometimes, you need to let the Big Bad have it right where it hurts. Sometimes, you just gotta burn that smirk off of The Dragon's face in the most direct and painful manner possible. Sometimes, The Hero deserves to know just how powerful you are when you're Drunk on the Dark Side.\\nSometimes, you just need to give them the Face Palm of Doom For Massive Damage.\\nThe Face Palm of Doom, named so because it is a Face Palm... of Doom, is basically when you grab someone in the face, or sometimes just by the head, but usually the face, and proceed to unleash the pain by releasing some kind of energy, or in a more bloody series, crushing it. As you can imagine, such a move is probably extremely painful and is usually pretty high up there in terms of power. Due to the nastiness inherent in assaulting someone's visage, as well as the frightening potential for Eye Scream, this trope is generally indicative of The Unfettered, an Anti- or Unscrupulous Hero, the Obviously Evil, or someone who has had their Berserk Button mashed extremely hard or otherwise reached their Rage Breaking Point. It is essentially the bare-handed equivalent of shooting an opponent executioner-style, and carries many of the same connotations.\\nCompare Neck Lift.\\n\\nExamples"
    },
    "name": "Facepalm Of Doom",
    "rdf_element": "FacePalmOfDoom/int_890b49e",
    "short_name": "FacePalmOfDoom",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/FacePalmOfDoom"
  },
  {
    "categories": [
      "StockPhrases"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "Harry Potter and the Philosopher's Stone: Oliver Wood tells Harry he was knocked out for a week after taking a Bludger to the head during his first Quidditch game.",
      "general": "The best way to underline that a character has just been through a particularly harrowing experience is to have them wake up in a bed and be told that they've been Asleep for Days. If you want to throw some Ship Tease into the scene as well, you can also have the character's Love Interest sleeping next to his or her bed, having exhausted him/herself watching over the sleeping character. Often also used to Time Skip the main character from The Climax right to the D\\u00E9nouement.\\nThere is a kernel of Truth in Television to this, as recovery from any particularly grievous injury or sickness (or simply fatigue) can occasionally demand tens of hours of sleep. Sometimes writers can get a little off mark though, unceremoniously describing characters as having slept for weeks or months on end when such long periods of unconsciousness would most likely get a person admitted to an intensive care unit for coma treatment in Real Life. Even if a character isn't literally unconscious the entire time but was merely bedridden or delirious, they would require extensive rehabilitation due to muscle atrophy before they were able to chase the Big Bad across the world or spring back into action defeating the evil vizier's mooks in hand-to-hand combat again.\\nA person who cleanly awakens from this without the benefit of a nursing staff and a bedpan is certainly invoking the trope of Nobody Poops.\\nUsually a form of Deep Sleep. When they wake up, they'll likely comment on the Unfamiliar Ceiling.\\nRip Van Winkle is the extended version of this trope."
    },
    "name": "Asleep for Days",
    "rdf_element": "AsleepForDays/int_890b49e",
    "short_name": "AsleepForDays",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/AsleepForDays"
  },
  {
    "categories": [
      "MadnessTropes"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "Quirrell has this in Harry Potter and the Philosopher's Stone due to his nerves and his generally anxious manner.",
      "general": "In fiction, a Twitchy Eye is never merely a facial tic \\u2014 for some reason, a twitch reveals your state of mind.\\nThe prevailing notion seems to be that an eye twitch denotes insanity, which can apply to a permanently mad person with a permanent tic, or an unstable character whose twitch manifests along with their madness. As such, it usually accompanies a Broken Smile, and sometimes overlaps with Mad Eye.\\nOf course, there are other emotions that give characters a Twitchy Eye, including anything from extreme annoyance, to horror, to caffeine. so much that *twitch twitch* has become a standard sound effect in anime and manga, as well as a standard anime gesture of slowly raising a clenched fist with a twitching eye. Might be the prelude to a Villainous Breakdown or a Heroic BSOD.\\nOther times it's not a mood, but an action \\u2014 such as lying \\u2014 that will bring about the twitch.\\nIn Real Life, a twitching eyelid can be sign of emotional instability, but it's usually a sign of tiredness or severe stress."
    },
    "name": "Twitchy Eye",
    "rdf_element": "TwitchyEye/int_890b49e",
    "short_name": "TwitchyEye",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TwitchyEye"
  },
  {
    "categories": [
      "Plots"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "In Harry Potter and the Philosopher's Stone, the sequences of killer plant, flying keys, and life size chessboard allow Harry, Ron and Hermione to demonstrate their abilities. In the book, there were several other challenges (such as an angry troll that was supposed to be a guard, but was knocked out by the previous entrant) that made this fact less visible. In the book, it was stated that each obstacle was something from the area of expertise of one specific professor.",
      "general": "A plot carefully constructed to use all the character-specific skills or abilities of the ensemble. Often referred to as \\\"Eigen Plot\\\", after a mathematical concept of mapping graphs around specific vectors.\\nFor example, if your team plays Elemental Rock-Paper-Scissors, they're going to have to face a water trap, a fire trap, an air trap, and an earth trap.\\nAs a plot, it's a double-edged sword; don't do it, and someone gets left out. Do it too often, and it looks like the bad guys are conspiring with the good guys to tailor their defenses to the heroes' strengths. Also, when one of the heroes has a lame power, there has to be a really bizarre obstacle in there to require their ability.\\nMost often occurs in series with heavy Super Hero Speciation. Can be the result of a Thematic Rogues Gallery. A good hypothetical example is if the Justice League had to destroy a nuclear threat. Superman and other flying members would take out the strategic bombers, the not-launched missiles would go to the grounded members, such as Batman, and the sub-launched missiles would go to Aquaman.\\nAs a variation, this may apply to multiple abilities or items which a single character has; each item or ability will always find some contrived use. This \\\"item-ized\\\" version of this trope is applicable to the gameplay environment design of metroidvania games.\\nIn Comic Books, often the most limiting when dealing with any character whose power is water (especially underwater) based.\\nCompare This Looks Like a Job for Aquaman, which is when the plot improbably makes use of a single character's abilities. This frequently comes up in a Tournament Arc, where the heroes will have to pair off against their equal and opposite villains. It's also common in Tabletop RPGs, where it serves as a way to ensure that everybody's doing enough stuff to have fun. In one-off works, it's a case of Chekhov's Gun - of course they're going to need to crack a safe, or they wouldn't have brought the safecracker."
    },
    "name": "Plot Tailored to the Party",
    "rdf_element": "PlotTailoredToTheParty/int_890b49e",
    "short_name": "PlotTailoredToTheParty",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/PlotTailoredToTheParty"
  },
  {
    "categories": [
      "WeaponsAndWieldingTropes"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "When Harry and Ron are playing Wizard's Chess in Harry Potter and the Philosopher's Stone, Ron's queen takes one of Harry's pieces by smashing it in half with her throne.",
      "general": "Have a seat. *CRUNCH*\\nIn fiction, chairs make for great bludgeoning objects capable of knocking people unconscious in one strike; enter the Chairman of the Brawl, that one guy who can be counted on grabbing the nearest sitting implement and smashing it across his unfortunate victim's head. If the chair is made of wood, it also immediately splinters into countless pieces to show how devastating the blow is.\\nIf there is a Bar Brawl going on, this is to be expected. Pretty much every single Western featuring a Bar Brawl, ever, has used this one, to the point of being a Dead Horse Trope.\\nA subtrope of Improvised Weapon and Wrestler in All of Us.\\nCompare Batter Up and Golf Clubbing."
    },
    "name": "Chairman of the Brawl",
    "rdf_element": "ChairmanOfTheBrawl/int_890b49e",
    "short_name": "ChairmanOfTheBrawl",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ChairmanOfTheBrawl"
  },
  {
    "categories": [
      "IndexOfExactTropeTitles"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "Lampshaded in Harry Potter and the Philosopher's Stone just after the troll incident. Prof. McGonagall awards Harry and Ron five House points each \\\"for sheer, dumb luck\\\". While there was some skill involved, both Ron and Harry were exceptionally lucky nevertheless.\\n Played much straighter near the end of the book/film. After losing Gryffindor massive points for sneaking out of bed in the middle of the night, the Power Trio do so again when they believe (through incomplete snooping and eavesdropping) that Snape will steal the Philosopher's Stone. Neville to keep them from going out lest they get caught and lose their House more points. They turn out to be half-correct; someone does try to steal it, but it isn't Snape. Still, what if they had been 100% wrong and no one was trying to steal it, or at least not that very night? But because they turned out to be right, they're hailed as heroes and awarded all the points they lost and then some at the End of Year Feast. Repeat: When they get caught sneaking out at night and have nothing to show for it, they lose House points. When they sneak out and it turns out their suspicion about a bad guy is correct, they are hailed as heroes.",
      "general": "Moral luck is a concept in philosophy in which a person is praised or blamed for an action they carried out, the consequences of which were primarily dependent on blind luck. The archetypal thought experiment is that of the painter Gauguin, who abandoned his family in order to pursue his artistic muse. Because he was successful, people praise him for his courage and determination. But supposing that, through no fault of his own, Gauguin never caught a lucky break or simply wasn't as talented as he thought he was. Would he then be any different from a Jerkass Disappeared Dad?\\nIn order to qualify for this trope, a character has to carry out an action whose consequences depend mostly on luck, and be praised (or blamed) by other characters (or by the work itself) for their morality/immorality. It doesn't count if a character carries out such an action and no one judges them for it, and the reader is left to draw their own conclusions. The action has to be specifically treated as ethical or unethical by the work itself or characters in it.\\nThis trope can easily transform a hero into a Designated Hero or even a villain once Fridge Logic or Fridge Horror set in (or, conversely, transform a villain into an Anti-Villain). It is often closely related to Protagonist-Centered Morality. Even among sympathetic characters in a work, a Double Standard may form: the resident Butt Monkey's actions will always result in failure and they will be blamed for it, while the Karma Houdini protagonist's will always succeed and they will receive praise.\\nWhat the Hell, Hero? can serve to avert this. Compare Moral Dissonance, No Endor Holocaust and the various Luck Tropes. Related to Million-to-One Chance and \\\"How Did You Know?\\\" \\\"I Didn't.\\\". Laser-Guided Karma is sometimes offered as an explanation for this. Luck-Based Mission is the video game equivalent, while The Magic Poker Equation is a rough equivalent for card playing. Compare Gambit Roulette: when a character's plans hinge so much on random chance and happenstance that the viewer's credibility is strained."
    },
    "name": "Moral Luck",
    "rdf_element": "MoralLuck/int_890b49e",
    "short_name": "MoralLuck",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/MoralLuck"
  },
  {
    "categories": [],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "Ian Hart is Professor Quirrell in Harry Potter and the Philosopher's Stone. He's a bald assistant in Tristram Shandy: A Cock and Bull Story. He has a quite thick NE England accent as a working-class father in the 1930s in Liam. He puts on an American accent for a bit of undercover work in Sherlock Holmes and the Silk Stocking that sounds nothing like his own voice (some viewers didn't think it was him for the first several seconds).",
      "general": "Most actors have a familiar energy that they bring to the screen, from the bubbly good-heartedness of Jennifer Aniston to the simmering intensity of Al Pacino. A few, however, bring a different energy to every character they play. They are chameleons, slipping fully into a variety of wildly dissimilar roles in which they are largely unrecognizable. They are masters of accents, alter their mannerisms for each character, and change their appearance so drastically that they seem almost like shape shifters.\\nThis type of performance is usually a requirement for films with one actor playing Loads and Loads of Roles. It is also at the heart of many Biopics.\\nA hallmark of this trope is that seeing an actor's name in opening credits gives you no idea of what sort of character to expect. This may particularly apply to actors who make few public appearances, because the audience may have no conception of what they would be like out of character, making it more difficult to see the actor behind each performance.\\nThis trope is the polar opposite of I Am Not Leonard Nimoy and Type Casting. These actors aren't Playing Against Type; they would never let themselves get pinned down to a type to begin with. You are unlikely to say, \\\"Hey, It's That Guy!,\\\" because you won't even recognize that it is the same actor. Also contrast with actors who have a generally well-known persona, but undergo the occasional Beauty Inversion.\\nIn voice acting, this is Man of a Thousand Voices. When the Man of a Thousand Faces is a character, they're a Master of Disguise."
    },
    "name": "Man of a Thousand Faces",
    "rdf_element": "ManOfAThousandFaces/int_890b49e",
    "short_name": "ManOfAThousandFaces",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ManOfAThousandFaces"
  },
  {
    "categories": [
      "TheGildedIndex"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "Harry Potter and the Philosopher's Stone mentions that the vaults of Gringotts Wizarding Bank are guarded by trained dragons. In Harry Potter and the Deathly Hallows, Harry, Ron and Hermione have to pass such a guard dragon when breaking into the LeStrange vault to steal the golden Cup of Helga Hufflepuff.",
      "general": "In some settings, dragons tend to guard hoards of treasure\\u2014typically by lying on top of it.\\nThis trope is especially ingrained in Germanic Mythology\\u2014in fact it is hard to find a dragon in ancient Anglo-Saxon, German or Norse legends that doesn't guard gold. Curiously, there is no consensus as to why dragons do this. Justifications in-story for why a dragon sits on a hoard, including backstories of how hoard and dragon came together, vary considerably.\\nIn some ways, hoard-guarding dragons are no different from other treasure guardians: They make sure it isn't too easy for the hero to get at a desired MacGuffin, and a heap of treasure in itself provides a convincing motivation for a hero to engage in an exciting monster-fight.\\nDragons have a peculiarity, though, in that they are especially attached to gold: dragon-hoards almost always contain at least a substantial share of gold. Whatever the reasons, on average dragons show noticeably less interest in other treasures, like silver or even jewels.\\nPeople have also long noticed that dragons have no apparent use for treasure: they cannot spend, wear or process it. Dragons, it was concluded, must be pathologically avaricious and stingy\\u2014kind of like a species of compulsive hoarders with a Money Fetish. In fact, up to the 17th century, dragons were considered the emblematic representation of Greed.\\nOne possible explanation of the origin of this trope comes from the old hypothesis about dragon legends being inspired by dinosaur fossils. Miners who were digging for gold would sometimes find dinosaur bones buried nearby, hence the association between the two. This is also believed to be the reason griffons are also sometimes associated with treasure, as they're supposedly inspired by ceratopsians, being quadrupeds with beaks. The serpentile nature of many dragons also connects them with snakes. Given the fact that many snakes live in caves, and precious minerals are most often found underground, the snake/dragon = gold connection may result from simple gilt by association.\\nThe association of dragons with greed, combined with their preference for gold, makes that dragon hoards coincide with a certain regularity with outbreaks of Gold Fever.\\nTreasure-hoarding dragons, once common, became increasingly forgotten in the age of Chivalric Romance: For a Knight in Shining Armor, fighting for so mundane a reward as treasure was no longer deemed noble enough. Hence gold-hoarding dragons were largely superseded by the princess-stealing ones, until the trope was revived by Fantasy literature, especially through the influence of The Hobbit.\\nIn more realistic settings where dragons don't exist, large reptiles may sometimes be encountered guarding treasures. Parody versions will involve dragons hoarding something other than treasure.\\nMay involve a Treasure Room. This trope is to Pooled Funds as a waterbed is to a swimming pool."
    },
    "name": "Dragon Hoard",
    "rdf_element": "DragonHoard/int_890b49e",
    "short_name": "DragonHoard",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/DragonHoard"
  },
  {
    "categories": [
      "EvilTropes"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "A heroic example, from Harry Potter and the Philosopher's Stone:",
      "general": "Is there a worse job to have than being a messenger for a major villain? The hours are long, the pay is low, your boss thinks that the world revolves around him, and likes to abuse his men for fun, and remember that dental plan that led you to join in the first place? Yeah, that got canceled last year.\\nAnd then there's the very worst part of being a Big Bad's messenger: bring him a message with bad news, any bad news, (even just something small like that his mother is running 10 minutes late for the party) and he'll flip out, fly into a rage, and kill you. Why? Because you're the closest thing to him when he gets the bad news, and you're expendable. Maybe it's time to see if the heroes need some extra help or sidekicks.\\nThe origin of the trope leads back to ancient Greece at least. One possible theory (besides the king being affected with Pride) is that the messenger was a defeated or losing general's son, and that his death was punishment for failure. It's also such a common cliche that the Evil Overlord List took time to specifically mention it.\\nBy the way, remember when we told the worst was bringing your master a bad news? We lied. The worst is bringing someone else a message from your master. Such as an ultimatum. The recipient is guaranteed to reply, in a non-ambiguous way, that he will have none of it; and by \\\"non-ambiguous\\\", we mean by sending your head back. Without the rest of your body. Also note that even the \\\"good guys\\\" might do this, especially Anti Heroes. Its depressing regularity in the ancient world led to the first rule of international law: Diplomatic Immunity. In the end, everyone (even Genghis Khan, who destroyed multiple empires) thought it was just a little unfair to the messengers. In fact, Genghis Khan wiped out one of those empires because they killed some of his messengers.\\nWhen villains do this, it is generally done as a subtrope of You Have Failed Me and Bearer of Bad News, and is a way to Kick the Dog by killing the person who annoys you despite their innocence. And if you're in a story featuring Black and Grey Morality, do whatever it takes to get out of delivering a message, since your life expectancy is slightly shorter than that of a guy standing on top of skyscraper in a thunderstorm saying \\\"What's the worst that could happen?\\\" It's also usually a subtrope of Aggressive Negotiations. Guys, the messengers are coming in peace.\\nWhen heroes do this (to enemy diplomats, never their own servants), it's because the messenger was a bad guy anyway, so why not murder him when he isn't making any threats? Some shows make the messenger look particularly evil to avoid the negative aspects of this trope.\\n\\\"I'm just the messenger\\\" is a stock phrase used to remind people that this trope isn't really fair, and is fairly likely to work.\\nNot to be confused with Please Shoot the Messenger, where the recipient is actively instructed by the message to kill the person who delivered it. Overlap with Offing The Annoyance is likely. Compare Offing the Mouth, which would be something like \\\"Shoot the Deadpan Snarker\\\".\\n\\nExamples"
    },
    "name": "Shoot the Messenger",
    "rdf_element": "ShootTheMessenger/int_890b49e",
    "short_name": "ShootTheMessenger",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ShootTheMessenger"
  },
  {
    "categories": [
      "EvilTropes"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "A dead straight example from Harry Potter and the Philosopher's Stone. After everyone is alerted to the troll in the dungeon and mass panic ensues, Dumbledore yells loud and clear, \\\"Silence!\\\" Everyone stops in their tracks and he gives out orders calmly.\\n Harry Potter and the Goblet of Fire has one too, but more drawn out and hammy. \\\"SILEEEEEEEEENNCCCCCEEEE!\\\"",
      "general": "A powerful character needs to talk. He's important, so nothing else but \\\"Silence!\\\" will do to quell the unruly masses or to stop the plucky hero mid-sentence. It shows that he or she is in charge, and what those other people are saying is unimportant or foolish.\\nDo this with a crowd of mooks and impress your friends with how quiet they become. Use this to intimidate poor peasants begging for clemency.\\nYou can say things like \\\"Quiet!\\\" or \\\"Be still!\\\", for a similar effect. However, the more vulgar \\\"Shut up!\\\" doesn't work as well, except when addressed to genteel types who would be stunned to hear such an improper outburst. Go ahead and hold up a hand, it helps with the image.\\nThere are dozens of ways to parody this. A common one is for the villain to yell \\\"Silence!\\\" at a minion who's trying to reveal something important, and later demand to know why he wasn't given the important information. Another is to shout \\\"SILENCE!\\\" when nobody is speaking to begin with. A third is for the character to yell \\\"SILENCE!\\\"... and be completely ignored.\\nSee also Shut Up, Hannibal! and Talk to the Fist. Big \\\"Shut Up!\\\" can sometimes overlap. Not to be confused with You Fool!"
    },
    "name": "Silence, You Fool!",
    "rdf_element": "SilenceYouFool/int_890b49e",
    "short_name": "SilenceYouFool",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/SilenceYouFool"
  },
  {
    "categories": [
      "Dialogue"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "This exchange from the film version of Harry Potter and the Philosopher's Stone, before Harry's first Quidditch game:",
      "general": "This trope is for when, in the middle of some tense, possibly life-or-death situation, one character will remark to the other: \\\"You know, this reminds me of a similar story...\\\". The other character, hopeful, will remark \\\"Oh, and they succeeded?\\\". And of course, the first character says \\\"No, they all died, actually.\\\"\\nMay overlap with Metaphorgotten if the person giving the example genuinely forgot the unfortunate ending of it. Also overlaps with Analogy Backfire."
    },
    "name": "Bad Omen Anecdote",
    "rdf_element": "BadOmenAnecdote/int_890b49e",
    "short_name": "BadOmenAnecdote",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/BadOmenAnecdote"
  },
  {
    "categories": [
      "SpeculativeFictionTropes"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "In the film version of Harry Potter and the Philosopher's Stone, Harry, upon first trying on his Invisibility Cloak, looks down at himself and exclaims, startled, \\\"My body's gone!\\\"",
      "general": "This phrase, or something to the same effect, is uttered by someone who discovers, upon looking in a mirror, that he or she has just become invisible. Extra credit if the character's clothes, jewelry and accessories are still visible, or if the character was already nude. Bonus points if it's two invisible characters talking to each other, or if their invisibility causes them hardship: stubbed toe, hands where they shouldn't be, walking into a door, etc, etc.\\nIf you start wondering how their retina is able to function when light goes straight through them, you're thinking too hard.\\nCompare You Can See Me?.\\n\\nExamples"
    },
    "name": "I Can't See Myself",
    "rdf_element": "ICantSeeMyself/int_890b49e",
    "short_name": "ICantSeeMyself",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/ICantSeeMyself"
  },
  {
    "categories": [
      "MediaAdaptationTropes"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "The final act of Harry Potter and the Philosopher's Stone:\\n At first, it seems the way Devil's Snare is thwarted has been changed: In the book, it was susceptible to fire; in the movie, it was made up so that you have to relax to get pulled through to the other side. However, Ron is unable to relax, so Hermione ends up thwarting it the same way she did in the book, by targeting light at it.\\n The confrontation with Voldemort: In the book, Harry spends the whole scene adamantly refusing to give Voldemort the Stone. In the movie, Voldemort tempts Harry with the possibility of bringing his parents back to life and, for a moment, it looks like Harry might actually hand over the Stone, but then he doesn't.",
      "general": "What happens when a work of fiction, so old or so well-known that knowing its ending doesn't even count as a spoiler, is adapted into a new installment? Mostly the adapters choose to keep the main plot points, so the twist ending will stay, and thus there will be no twist at all. But that's not the only option!\\nSometimes the production team do want the viewers to be surprised, and so they will change the twist at the end. This is, of course, especially prone to leaving plot holes if the producers do not change the rest of the plot that leads to the original ending accordingly, leaving the new twist hanging over the plot as if suspended by wires. When well done, though, it can lead to genuine surprise, a satisfying new resolution, and an excellent application of Death of the Author, in other words, awesomeness.\\nAs a sub trope of Meta Twist, it's never too much warning that HERE BE SPOILERS. In fact, these spoilers are even more dangerous than the usual variety, since it's impossible to not spoil the twist ending from the moment the name of the work is stated if you're familiar with the original, as well as spoil yourself on both versions if you aren't. Proceed with caution.\\nContrast with It Was His Sled, the trope that leads to this.\\nAs a clarification, this Trope deals with Adaptations and Alternate Continuities; de-twisted sequels fall under Meta Twist. Also, if the plot twist was added by a more successful adaptation and removed by a later adaptation/reboot, the later adaption/reboot counts here since the audience was expecting the earlier imitation; the original, however, would not count and that instance should be taken to Lost in Imitation."
    },
    "name": "Not His Sled",
    "rdf_element": "NotHisSled/int_890b49e",
    "short_name": "NotHisSled",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/NotHisSled"
  },
  {
    "categories": [
      "FilmTropes"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "Some places originally shot on location were later reproduced as sets at Leavesden Studios. For example, Privet Drive was a real street on the first movie, but a backlot reproduction was used from the second movie onwards. The hospital wing was Oxford Divinity School in the first movie, but it became a set in the second film. Amusingly, Oxford Divinity School later appeared as a different room in the fourth movie. In a weird example, Snape's classroom was filmed in the Lacock Abbey sacristy in the first film, but later his classroom became a set which did not even remotely look like the same room. It appears they took the Snape's office set from the second movie and revamped it into his classroom for the fifth movie (the classroom does not appear onscreen between the first and fifth movies).",
      "general": "A set has to be rebuilt. Sometimes this is due to it having been taken down between movies, and the designers take the opportunity to revamp the set in the meantime. Other times its because they want to do something nostalgic, and this often involves rebuilding a set from an earlier version of the franchise.\\nCommon to film sequels, but also a horribly common problem in videogames, since source files are so poorly kept track of. In the case of sets that have been changed, sometimes the producers choose to Trash the Set to explain why they've been changed."
    },
    "name": "Rebuilt Set",
    "rdf_element": "RebuiltSet/int_890b49e",
    "short_name": "RebuiltSet",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/RebuiltSet"
  },
  {
    "categories": [
      "HorrorTropes"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "Partial example in Harry Potter and the Philosopher's Stone when Harry, Draco and Fang accidentally interrupt Voldemort's unicorn meal in the Forbidden Forest. He doesn't turn around, but he does look up, and there is blood on his lips.",
      "general": "The heroes are looking for something suspicious. Possibly a murderer.\\nThey find him busy at work on his grisly deed, but he perks up and notices our heroes.\\nBonus points if the murderer is having lunch in the process.\\nThis is pretty much always shot from behind the murderer for dramatic reasons\\u2014it partially obscures the victim, lending ambiguity and tension to the scene and helping the audience's imagination to fill in the grisly details."
    },
    "name": "Over-the-Shoulder Murder Shot",
    "rdf_element": "OverTheShoulderMurderShot/int_890b49e",
    "short_name": "OverTheShoulderMurderShot",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/OverTheShoulderMurderShot"
  },
  {
    "categories": [
      "CameraTricks"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "In the film of Harry Potter and the Philosopher's Stone, as Harry walks past a Quidditch store, the view, from inside the store, shifts from his face to a closeup of the Nimbus 2000 lettering on the broom in the window.",
      "general": "Changing the point of focus from one character or object in frame, to another character or object that is closer to or more distant from the camera, typically with little or no movement from the camera itself. Used to subtly direct the viewers' attention to a specific part of the screen.\\nAlternatively called \\\"Roll Focus\\\" or, in film, \\\"Pull Focus\\\". Requires deft manipulation of the Depth of Field.\\nIn motion picture and film-based television production, this is often done by a separate person (the \\\"focus puller\\\" or \\\"first camera assistant\\\") rather than by the primary camera operator. In video production, the cameras usually aren't large enough for this to be necessary, and on consumer-level gear, it might not even be possible because of the way autofocus is usually implemented. note\\u00A0Now that video-equipped DSLRs (originally designed for newspaper photographers creating web content) have made inexpensive, near-film-quality video a reality for all but No Budget directors, rack focus is something nearly any camera operator can do, but it requires either a very steady hand (and tripod), a pile of expensive Hollywood-style equipment (the big guys are starting to use DSLRs too), or a software hack like Magic Lantern that can automate the process by taking over the camera's autofocus mechanism. Needless to say, like every other pro trick that amateurs pick up, it can be horribly misused, and as DSLRs and their smaller EVIL brethren become cheaper and more popular, it probably will be.\\nSometimes used in two-dimensional animation, which involves filming the foreground and background separately and then combining them.\\nIn theory Rack Focus should be made redundant in new 3D films because the viewer would be able to change focus at will. Of course because it is a simulation of 3D this isn't quite true and the technique remains. This sometimes causes frustration as the viewer wants to change focus but cannot.\\nIf you were expecting a trope about shots focussing on women's racks, see Male Gaze."
    },
    "name": "Rack Focus",
    "rdf_element": "RackFocus/int_890b49e",
    "short_name": "RackFocus",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/RackFocus"
  },
  {
    "categories": [
      "StockPhrases"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "The Sorcerer's Stone: \\\"The one that started it all\\\"",
      "general": "The one with the description of the \\\"The One With\\\" trope.\\nWhen somebody wishes to discuss an episode of a TV programme and they can't remember what it's called, they will usually describe it as \\\"The one with...\\\" or \\\"the one where...\\\"\\nSometimes, such a phrase will literally be used as a name for something (which may lead to slight confusion similar to Who's on First?).\\nSee In Which a Trope Is Described."
    },
    "name": "The One with...",
    "rdf_element": "TheOneWith/int_890b49e",
    "short_name": "TheOneWith",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TheOneWith"
  },
  {
    "categories": [
      "YMMV"
    ],
    "descriptions": {
      "HarryPotterAndThePhilosophersStone": "Also from the first one:",
      "general": "We all know trailers are intended to promote their production. To do this, they will invariably use notable scenes depending on the type of movie. In the case of a comedy, Funny Moments may be selected. When first shown, they probably elicit the desired reaction: The audience will \\\"laugh out loud\\\", as it were. All fine and good, but this trailer is constantly airing and/or streaming, so you're inevitably going to see it more than once, meaning you're going to be seeing that same amusing scene over and over.\\nWhen it comes to finally seeing the movie/TV show and that rib-tickling scene plays out, you notice that the gag isn't doing it for you. In fact, you may find yourself thinking that it's kinda lame \\u2014 this, ladies and gentlemen, is Trailer Joke Decay. Additionally, it may be due to the unfortunate exposure to a Memetic Mutation of the gag, or it can be a case of both Never Trust a Trailer and Trailers Always Spoil, oddly enough.\\nExpect that almost every comedy movie will fall victim to this. It's possible to get around it by using the joke out of context in the trailer so that it's funny on another level when you see it in context, but trailers rarely seem to have that much thought put into them. After time passes and the trailer is no longer widely shown, it's possible that the joke can become funny again to viewers who weren't overly exposed to the previews.\\nAs noted, related to Never Trust a Trailer and Trailers Always Spoil (or possibly a subtrope). See also Discredited Meme."
    },
    "name": "This is based on opinion. Please don't list it on a work's trope example list.\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\t\\t\\t\\t\\t\\n\\t\\t\\n\\t\\t\\n\\t\\tTrailer Joke Decay",
    "rdf_element": "TrailerJokeDecay/int_890b49e",
    "short_name": "TrailerJokeDecay",
    "web_page": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TrailerJokeDecay"
  }
]
